{"schedule":{"conference":{"title":"Devnexus 2022","start":"2022-04-12","end":"2022-04-14","daysCount":3,"timeslot_duration":"00:10","days":[{"index":0,"date":"2022-04-12","day_start":"2022-04-12T06:00:00-04:00","day_end":"2022-04-12T20:00:00-04:00","rooms":{"Unobtanium":[],"Tools and techniques":[],"Security":[],"Practices and other tech":[],"Keynote Room":[],"Foyer":[{"id":7147,"date":"2022-04-12T17:30:00-04:00","start":"17:30","duration":"01:30","room":"Foyer","title":"Jakarta EE reception (5.30 PM Room 412, all are invited!)","track":"Full day Workshops","type":"workshop","abstract":"Join IBM and Eclipse Foundation for this reception at the end of workshop day at 5pm for snacks and drinks!","persons":[]}],"Web and Front-end":[{"id":6893,"date":"2022-04-12T09:00:00-04:00","start":"09:00","duration":"08:00","room":"Web and Front-end","title":"Meshing with DevOps for the Java Developer","track":"Full day Workshops","type":"workshop","abstract":"Are you looking for improved observability, security, and reliability of your Java based microservices deployment? Are you curious about the functionality and potential benefits that a service mesh has to offer? This session is a hands-on workshop that will walk attendees through the DevOps experience of a Java based microservices application — all the way from continuous integration to deployment with the Linkerd service mesh.","persons":[{"id":2551,"full_public_name":"Melissa McKay","abstract":"Melissa is a long time developer turned international speaker and is currently a Developer Advocate for JFrog, Inc. Her background and experience as a software engineer spans a slew of technologies and tools used in the development and operation of enterprise products and services. She is a mom, Java Champion, Docker Captain, co-author of the upcoming book DevOps Tools for Java Developers, a huge fan of UNconferences, and is always on the lookout for ways to grow and learn. She has spoken at Kubecon, DockerCon, CodeOne, JFokus, Java Dev Day Mexico, the Great International Developer Summit, and is part of the JCrete and JAlba UNconference teams.","twitter_name":"https://twitter.com/melissajmckay","avatar_path":"/system/avatars/2551/large/20211022_085330_(1).jpg?1636995509"}]}],"Java Platform":[{"id":7021,"date":"2022-04-12T09:00:00-04:00","start":"09:00","duration":"08:00","room":"Java Platform","title":"Software Design By Practice","track":"Full day Workshops","type":"workshop","abstract":"We all are familiar with SOLID and other software design principles and have explored many design patterns. There is no better way to get a deeper understanding than to practice the concepts. Furthermore, some of the principles and patterns minifest themselves in what appear to be rather unconventional ways when applied under a set of constraints and requirements. In this hands-on intensive workshop we will take some problems and device elegant lightweight design, in code, and discuss the tradeoffs. Come experience the evolution of ideas into code and take shape by way of incremental development.","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]}],"Frameworks":[{"id":6937,"date":"2022-04-12T09:00:00-04:00","start":"09:00","duration":"08:00","room":"Frameworks","title":"Implementing Passwordless Logins using the Spring Authorization Server  and the WebAuthn protocol","track":"Full day Workshops","type":"workshop","abstract":"What if users can create an account and log into your application without ever having to enter a password. For example, a new user accesses your application from an iPhone they can create a new account and login using FaceId. The workshop shows you how to use the Web Authentication Protocol and the Spring Security Authorization Server to implement such functionality. The Web Authentication is widely implemented in all modern browsers provides a highly secure and user-friendly onboarding and authentication experience.  In the workshop we will cover everything you need to know to understand how the Web Authentication  protocol works and how to implement it using Spring Security and Spring Authorization Server. ","persons":[{"id":3383,"full_public_name":"Adib Saikali","abstract":"Adib is a currently a Principal Solutions Engineer at VMware Tanzu and part of the Office of the CTO. He is long time Spring Java / Developer having built in application from small 2 person start, to large multinational companies. Adib is the author of Securing Cloud Applications https://www.manning.com/books/securing-cloud-applications  a book that teaches Java developers effective real-world practices to keep cloud and Kubernetes-deployed applications safe and sound.","twitter_name":"@asaikali","avatar_path":"/system/avatars/3383/large/Adib_Profile_Photo.jpg?1637294304"}]}],"Core Java":[{"id":7031,"date":"2022-04-12T09:00:00-04:00","start":"09:00","duration":"08:00","room":"Core Java","title":"Developer Productivity Engineering All-Day Workshop","track":"Full day Workshops","type":"workshop","abstract":"If you are not already familiar with DPE, it is a new software development practice that uses acceleration technologies and data analytics to speed up the critical software development processes—from builds to testing to CI—and make troubleshooting more efficient. In this hands-on workshop with labs we will demonstrate DPE best practices and tools in action—using examples from Java projects that rely on Maven or the Gradle build tool.\r\n\r\nOne of the principal techniques recommended as part of Developer productivity engineering is the use of a build cache.  A build cache reduces build time by reusing outputs produced by other builds in your organization. This workshop will dive into the basics and best practices to make the most of caching in your build. We’ll discuss the different possible architectures and how they affect build performance.\r\n\r\nThe end-result of pursuing DPE excellence will be a transformative and highly satisfying developer experience. Gradle and Maven build tool users interested in speeding up build and test cycles are encouraged to attend this workshop.\r\nPrerequisites and Objectives\r\nMake sure you have JDK 11 or later installed if you do not already. You can use your favorite IDE or text editor during the workshop.\r\nAfter this training the participants will be able to:\r\nUnderstand the benefits of using the Gradle or Maven build cache\r\nUse and configure the build cache\r\nOptimize build logic for maximum cacheability\r\nMaximize the benefits of the local and remote build cache for both Gradle and Maven\r\nUnderstand the benefits of using the Gradle build cache\r\nUse and configure the build cache\r\nOptimize build logic for maximum cacheability\r\n","persons":[{"id":115,"full_public_name":"Raju Gandhi","abstract":"I am a Software Craftsman with over a decade of experience building Web Applications and Enterprise Software and I love to build great software","twitter_name":"looselytyped","avatar_path":"/system/avatars/115/large/me2_400x400.png?1409064068"}]}],"Cloud Technology":[{"id":7022,"date":"2022-04-12T09:00:00-04:00","start":"09:00","duration":"08:00","room":"Cloud Technology","title":"Java Security Jumpstart Workshop","track":"Full day Workshops","type":"workshop","abstract":"Introductions\r\n \r\nCyber Attacks and the Developer\r\n           Introduction to the current state of cyber attacks. Motivations, objectives, methodologies.\r\n           Changing the mindset of the developer. Examples and discussions on how individuals, communities and open source projects get attacked and exploited.\r\nLearning from the Log4Shell saga.\r\n           Hands-on demonstration, analysis and discussion of the many ways that the vulnerability can be exploited.\r\nBetter coding for more secure software\r\n           Series of hands-on exercises with sample code and discussion afterwards\r\n           Covers most of the 7 pernicious kingdoms\r\nDealing with Java serialisation\r\n           How serialisation works and how it’s exploited.\r\n\tHow to write safter Java code\r\n           Alternatives to Java Serialisation\r\n           Introduction to microstream with hands-on\r\nSoftware Supply chain\r\n           New government directives that will affect how software is produced and consumed\r\n\tThe SBOM forcing function:\r\n\t how open source communities are affected.\r\n\tWhy your build pipelines will need turbo-charging\r\n           Advanced guidance on selecting open source projects -its more than functionality\r\n           Hands-on review of related open-source tools that should be on your list now\r\n           Commercial interlude and why good intelligence is vital\r\n           Snyk / Sonatype portfolios\r\nWrap up\r\n","persons":[{"id":3177,"full_public_name":"Markus Kett","abstract":"Markus and his team have been working on IDE tools for Java and database development for almost 20 years. He is the product owner of the RapidClipse IDE project, which is a free Eclipse distribution and visual Java IDE. Markus is co-founder and CEO at MicroStream, editor in chief for the free JAVAPRO magazine in Germany, and organizer of the Java conference JCON. He is an independent editor for several magazines, and speaker at many developer conferences, user groups, and meetups. ","twitter_name":"@MarkusKett","avatar_path":"/system/avatars/3177/large/MarkusKett.png?1625818440"},{"id":1163,"full_public_name":"Brian Fox","abstract":"Co-founder and CTO at Sonatype, Brian Fox is a member of the Apache Software Foundation and former Chair of the Apache Maven project. As a direct contributor to the Maven ecosystem, including the maven-dependency-plugin and maven-enforcer-plugin, he has over 20 years of experience driving the vision behind, as well as developing and leading the development of software for organizations ranging from startups to large enterprises. Brian is a frequent speaker at national and regional events including Java User Groups and other development related conferences.","twitter_name":"brian_fox","avatar_path":"/system/avatars/1163/large/fox-2016-1-sq-200.jpg?1516304578"},{"id":1037,"full_public_name":"Brian Vermeer","abstract":"Sr. Developer Advocate for Snyk, Java Champion, and Software Engineer with over a decade of hands-on experience in creating and maintaining software. He is passionate about Java, (Pure) Functional Programming and Cybersecurity. Brian is a JUG leader for the Virtual JUG and the NLJUG. He also co-leads the DevSecCon community and is a community manager for Foojay. He is a regular international speaker on mostly Java-related conferences like JavaOne, Devnexus, Devoxx, Jfokus, JavaZone and many more. Besides all that, Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher.","twitter_name":"BrianVerm","avatar_path":"/system/avatars/1037/large/profile-picture.jpeg?1634309368"},{"id":816,"full_public_name":"Steve Poole","abstract":"Steve Poole is a Developer Advocate, DevOps practitioner  and a long time  Java developer, leader and evangelist. He’s been working on Java SDKs and JVMs since Java was less than one year old. ","twitter_name":"spoole167","avatar_path":"/system/avatars/816/large/steve.png?1632196472"}]}],"Cloud Infrastructure":[{"id":7023,"date":"2022-04-12T09:00:00-04:00","start":"09:00","duration":"08:00","room":"Cloud Infrastructure","title":"Java 11 to 18 Hands on workshop","track":"Full day Workshops","type":"workshop","abstract":"The features released between Java 11 and Java 18 have brought many opportunities for developers to improve application development productivity as well as code expressiveness and readability.In this hands-on session, you will discover all the recent Project Amber features added to the Java language such as Records (including Records serialization), Pattern Matching for `instanceof`, switch expression, sealed classes, and hidden classes. You will also have the ability to test some of the newer APIs introduced in the JDK (ex. UDS). In addition, this lab will also touch on some newer tools (ex. jwebserver) and features introduced recently in the JDK (ex. serialization filter).Attend this Hands-on Lab to understand what JDK 18 brings to developers, and make sure to bring your laptop!","persons":[{"id":1413,"full_public_name":"David Delabassée","abstract":"David is a Developer Advocate in the Java Platform Group at Oracle. Prior to that, he was involved in Oracle’s Serverless initiatives. David has also been heavily involved in Java EE 8 and its transition to the Eclipse Foundation as part of the Jakarta EE initiative.\r\n\r\nOver the years, David has championed Java extensively throughout the world, by presenting at conferences and user groups, large and small. He blogs at https://delabassee.com and has authored many technical articles for various publications.\r\n\r\nDavid lives in Belgium. In his spare time, he enjoys playing video games with his daughter and tinkering with technologies such as domotics, electronics, and pinballs.","twitter_name":"@delabassee","avatar_path":"/system/avatars/1413/large/Delabassee_square_copy.png?1582003751"},{"id":2234,"full_public_name":"José Paumard","abstract":"José works as Java Developer Advocate at Oracle. PhD in applied maths and computer science, assistant professor at the University Sorbonne Paris Nord for 25 years, he is a Java Champion Alumni and JavaOne Rockstar. He is a member of the french Paris Java User Group, has been a co-organizer of the conference Devoxx France, and is a disorganizer of JChateau, an unconference held in the Chateau of the Loire Valley. He works on the dev.java documentation and community website, publishes the JEP Café, a monthly video cast on YouTube, and maintains a french YouTube channel with more than 80 hours of Java courses. He is also a Pluralsight author in the Java space.","twitter_name":"@JosePaumard","avatar_path":"/system/avatars/2234/large/apple-color-rect-02.jpg?1643701859"}]}],"Architecture":[{"id":7040,"date":"2022-04-12T09:00:00-04:00","start":"09:00","duration":"08:00","room":"Architecture","title":"API design and APIOps","track":"Full day Workshops","type":"workshop","abstract":"Building an API is just the first step. You also need to deploy that API and help your customers onboard to drive API consumption. Design APIs in Insomnia, generate configurations for Kong Gateway, and publish REST, GraphQL, and gRPC services to the Kong Dev Portal to enable your audience. In this workshop, we will go through all steps of the API Management cycle - from designing API specifications to publishing APIs for public consumption.\r\nA Short Outline\r\n\r\n    Design API in Insomnia\r\n\r\n        Design\r\n\r\n        Debug\r\n\r\n        Test\r\n\r\n    Deploy Services to API management (APIM) Platform - Kong\r\n\r\n        Generate config with inso from OpenAPI spec.\r\n\r\n        Learn how to use deck and GitHub actions for continuous delivery.\r\n\r\n        Use a mocking plugin for the default implementation.\r\n\r\n        Use rate limit plugin\r\n\r\n    Publish API to Developer Portal for public consumption.","persons":[{"id":656,"full_public_name":"Vik Gamov","abstract":"Viktor Gamov is a Principal Developer Advocate at Kong, Java Champion, and published author.","twitter_name":"gamussa","avatar_path":"/system/avatars/656/large/EDEC3D4E-AF01-4A04-ADB6-167AE599B1CE_1_201_a.jpeg?1586183630"}]}],"Agile":[{"id":7041,"date":"2022-04-12T09:00:00-04:00","start":"09:00","duration":"08:00","room":"Agile","title":"Best Practices for Kube-Native Java Apps Workshop","track":"Full day Workshops","type":"workshop","abstract":"Developers can deploy almost any Java application to Kubernetes. But how easy is it to build a container image? What about creating YAML files? What about putting it into production? And how efficient is it going to be?\r\n\r\n\r\nJoin us on this full-day workshop to learn the best way to manage Java application resources on Kubernetes efficiently. Some of the things you will master:\r\n\r\n    How to create applications that are Kube-Native\r\n    How to leverage existing tools to be more productive when developing Java applications\r\n    How to adapt application configuration for smooth Kubernetes deployment\r\n    How to define custom health checks\r\n    Deployment strategies\r\n    Sizing resource limits and requests\r\n    Kubernetes and Java integration testing \r\n    Tailoring metrics\r\n    Distributed tracing\r\n    And much more!","persons":[{"id":2581,"full_public_name":"Alex Soto","abstract":"Java Champion, Red Hatter. Speaker, Teacher, CoAuthor of Testing Java Microservice, Quarkus Cookbook, Securing Kubernetes Secrets books.","twitter_name":"@alexsotob","avatar_path":"/system/avatars/2581/large/1517153.jpeg?1599125532"},{"id":3366,"full_public_name":"Sébastien Blanc","abstract":"Sébastien Blanc, Red Hat's Director of Developer Experience, is a Passion-Driven Developer with one primary goal: share his passion by giving talks that are pragmatic, fun, and focused on live coding.\r\n\r\n","twitter_name":"sebi2706","avatar_path":"/system/avatars/3366/large/sebi.jpeg?1636984601"},{"id":1879,"full_public_name":"Ana Maria Mihalceanu","abstract":"Ana is a Java Champion, Developer Advocate, co-founder of Bucharest Software Craftsmanship Community, and a constant adopter of challenging technical scenarios involving Java-based frameworks and multiple cloud providers. She is an active supporter of technical communities’ growth through knowledge sharing and enjoys curating content for conferences as a program committee member. ","twitter_name":"@ammbra1508","avatar_path":"/system/avatars/1879/large/amv.jpeg?1570755550"},{"id":915,"full_public_name":"Edson Yanaga","abstract":"Edson Yanaga, Red Hat's Director of Developer Experience, is a Java Champion and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java, Microservices, Cloud Computing, DevOps, and Software Craftsmanship. ","twitter_name":"yanaga","avatar_path":"/system/avatars/915/large/edson_yanaga.jpg?1507757067"}]}]}},{"index":1,"date":"2022-04-13","day_start":"2022-04-13T06:00:00-04:00","day_end":"2022-04-13T20:00:00-04:00","rooms":{"Unobtanium":[{"id":6750,"date":"2022-04-13T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Unobtanium","title":"What's in Kubernetes that developers should care about (and why)","track":"Unobtanium","type":"lecture","abstract":"Learn the tools, best practices, and approaches to take the best results from Kubernetes (as a developer), without feeling overwhelmed about it.","persons":[{"id":1390,"full_public_name":"Elder Moraes","abstract":"Elder helps Java developers to work on great projects by guiding them on how to build and deliver secure, available, and fast server-side applications.","twitter_name":"elderjava","avatar_path":"/system/avatars/1390/large/avatar-500x500.png?1601296698"}]},{"id":7091,"date":"2022-04-13T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Unobtanium","title":"Liberation for your data! ","track":"Unobtanium","type":"lecture","abstract":"oin us in this session to see a live demo using Apache Kafka showing how to set up a change data stream out of your application's database without any code changes and consume change events in other services, update search indexes, and much more.\r\n","persons":[{"id":3426,"full_public_name":"Hugo Guerrero","abstract":"Hugo Guerrero (@hguerreroo) is an information technology professional with 15+ years of experience in software development. He has worked as a developer, consultant, architect and software development manager with major clients in private and federal public sectors. He is a Red Hatter and currently an open source integration technology evangelist.","twitter_name":"hguerreroo","avatar_path":"/system/avatars/3426/large/1516787425516.jpeg?1645906698"}]},{"id":6781,"date":"2022-04-13T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Unobtanium","title":"Quarkus. A Bliss for developers","track":"Unobtanium","type":"lecture","abstract":"Everyone is excited about Quarkus, the Kubernetes Native Java stack that lets you create Java applications with a small memory footprint and amazingly fast boot time (just some milliseconds) offering near-instant scale-up and high-density memory utilization in container orchestration platforms like Kubernetes and a perfect match for serverless. But these capabilities are useful at runtime, but what does Quarkus offer to developers to use at development time?","persons":[{"id":2581,"full_public_name":"Alex Soto","abstract":"Java Champion, Red Hatter. Speaker, Teacher, CoAuthor of Testing Java Microservice, Quarkus Cookbook, Securing Kubernetes Secrets books.","twitter_name":"@alexsotob","avatar_path":"/system/avatars/2581/large/1517153.jpeg?1599125532"}]},{"id":7095,"date":"2022-04-13T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Unobtanium","title":"Containers without docker","track":"Unobtanium","type":"lecture","abstract":"Recent changes in one desktop product generated many doubts in developer communities regarding containers. Can we still use or create them? Do we have alternatives to docker?\r\n\r\nWe have some answers! Join us in this session to learn more about some popular docker alternatives. You can create containers without docker, and you can also run and publish them. There's life after docker, and containers are here to stay.","persons":[{"id":3427,"full_public_name":"Cedric Clyburn","abstract":"Cedric Clyburn (@cedricclyburn), Developer Advocate at Red Hat, is an enthusiastic software technologist with a background in Kubernetes, DevOps, and tools. He has experience speaking at several conferences and events including DevConf.US, DevNation, and TheDevConf. Based out of North Carolina!","twitter_name":"@cedricclyburn","avatar_path":"/system/avatars/3427/large/CedricClyburn.jpeg?1645560374"}]},{"id":6951,"date":"2022-04-13T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Unobtanium","title":"7 Strategies for Building Majestic Monoliths","track":"Unobtanium","type":"lecture","abstract":"“You shouldn't start a new project with microservices, even if you're sure your application will be big enough to make it worthwhile.” - \r\nMartin Fowler\r\n\r\nWe won't.  We will look at building (and build) a Majestic Monolith that can easily be refactored to microservices if and when the need arises.\r\n","persons":[{"id":2222,"full_public_name":"Jeremy Davis","abstract":"I am a Chief Architect for App Dev Technologies at Red Hat.  I solve problems, sling open source software, spend a lot of time on airplanes, and recently purchased a Fender Jazzmaster. ","twitter_name":"@argntprgrmr","avatar_path":"/system/avatars/2222/large/headshot.jpg?1565908657"}]},{"id":6899,"date":"2022-04-13T18:20:00-04:00","start":"18:20","duration":"01:00","room":"Unobtanium","title":"OffHeap Podcast (Devnexus Edition)","track":"admin","type":"other","abstract":"The one and only Java Newscast, where we talk about what's happening in the ecosystem, and interview some of the cool Java Personalities that happen to be around DevNexus","persons":[{"id":3377,"full_public_name":"Freddy Guime","abstract":"Freddy is a Principal Developer at Expedia. Always dealing with performance and usability he is always curious on how to make the overabundance of data useful for travelers, traders and consumers. Having worked with different technologies before has allowed him to come with solutions to rendering bottleneck problems. A Usability Guru, Freddy understands and bridges the concepts of high-throughput with usability within software.\r\n","twitter_name":"fguime","avatar_path":"/system/avatars/3377/large/1516314157446.jpeg?1641519602"}]}],"Tools and techniques":[{"id":6689,"date":"2022-04-13T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Tools and techniques","title":"CI/CD Pipelines : What, Why, How?","track":"Tools and techniques","type":"lecture","abstract":"To avoid getting caught up in notions of “the right tool” it is important to understand the core concepts of continuous integration (CI) and continuous delivery or continuous deployment (CD). Choosing the right tool should be a consequence of defining the right goals, metrics and processes to automate. In this session we will explore common ideas that must be present in commercial and open source solutions to monitor, automate, verify and deliver software. \r\nFor example: Tasks, Steps, Runs, End-to-end automation, Workflows, Tool orchestration, Release cycles, among others. ","persons":[{"id":2235,"full_public_name":"Ixchel Ruiz ヾ(＾-＾)ノ","abstract":"Ix-chel Ruiz has developed software application & tools since 2000. Her research interests include Java, dynamic languages, client-side technologies and testing. Java Champion, Oracle Developer Champion, hackergarten enthusiast, Open Source advocate, public speaker and mentor.\r\n\r\nThe highest education is that which does not merely give us information but makes our life in harmony with all existence.\r\nRabindranath Tagore","twitter_name":"ixchelruiz","avatar_path":"/system/avatars/2235/large/ir.jpeg?1570642885"}]},{"id":6654,"date":"2022-04-13T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Tools and techniques","title":"Making Maven Marvelous","track":"Tools and techniques","type":"lecture","abstract":"Have you ever used Maven, ran into a bug and thought: “How on earth can a project this old have this bug?”. Then join this session! Maven, although a well-known and well-trusted project, is run by a relatively small bunch of people. There’s simply more work to do than these people can do!\r\n\r\nSo instead of getting angry, or looking for alternatives, you can contribute to Maven yourself and work on making it even better. Join us on our journey from “how on earth” to “works like heaven”. We’ll discuss how we did it, what we did, and most importantly: how you can start contributing to Maven as well!\r\n\r\nAs you walk out the room, better reserve some time in your calendar to start working on that bug ;-).","persons":[{"id":3324,"full_public_name":"Giovanni van der Schelde","abstract":"An adventurous developer that enjoys trying out new things. Besides, loves outdoor activities, food and games.","twitter_name":"https://twitter.com/gvdschelde","avatar_path":"/system/avatars/3324/large/foto-zelf-afstuderen-close-up.jpeg?1636536145"},{"id":1382,"full_public_name":"Maarten Mulders","abstract":"Enthusiastic architect, senior developer and trainer. Also Oracle Groundbreaker. Passionate about \"building the right thing\" and \"building the thing right\". Focusing on lean and elegant solutions. Love to share new ideas and knowledge. Outside work, I appreciate creating and consuming good food, photography, and music, in no particular order.","twitter_name":"mthmulders","avatar_path":"/system/avatars/1382/large/202106_speaker_headshot_smaller.jpg?1633931180"}]},{"id":6679,"date":"2022-04-13T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Tools and techniques","title":"Removing complexity from integration tests using Testcontainers!","track":"Tools and techniques","type":"lecture","abstract":"Integration tests are essential for testing both microservices and enterprise applications. Learn the best practices of using Testcontainers to make integration tests fast, flexible, stable, & repeatable.","persons":[{"id":2606,"full_public_name":"Oleg Šelajev","abstract":"Oleg Šelajev is a developer advocate at AtomicJar, working with the Testcontainers community to make integration tests better and a way more popular tool for developers! He helps organizing VirtualJUG, the online Java User Group, streams on youtube, and loves all programming languages. In 2017 became a Java Champion.","twitter_name":"shelajev","avatar_path":"/system/avatars/2606/large/oleg-joker-sq.jpg?1635879614"}]},{"id":6610,"date":"2022-04-13T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Tools and techniques","title":"Debugging 101","track":"Tools and techniques","type":"lecture","abstract":"New to programming or just need a quick refresher on Debugging? Please join Najae Stevenson and Lennon Scariano as they talk All About Debugging. In this short lecture, Najae and Lennon will define debugging, Explain its benefits and how it can increase your productivity. Then walk thru a few different way to debug using various IDEs, tools and tricks. ","persons":[{"id":3408,"full_public_name":"Lennon Scariano","abstract":"Full time software engineer, part time guitarist and cat lover. Proficient in Java, Javascript and Python. Graduated from the University of Georgia with a Bachelor's degree focused in Computer Science and a minor in Mathematics.","twitter_name":"@lennon_scariano","avatar_path":"/system/avatars/3408/large/1573933846029.jpg?1643236251"},{"id":2670,"full_public_name":"Najae Stevenson","abstract":"Najae is an extroverted software engineer with experience in multiple languages including Java and JavaScript. When Najae isn't saving the world using code, she spend her time promoting Diversity and Inclusion and actively generating fun interactive team build exercises within her team. ","twitter_name":"Mrs_Najae_Stevenson","avatar_path":"/system/avatars/2670/large/profile_pic.jpeg?1611241506"}]},{"id":6646,"date":"2022-04-13T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Tools and techniques","title":"Landscape of MicroProfile and Jakarta EE Tools","track":"Tools and techniques","type":"lecture","abstract":"Yes, I want to build my Java applications with MicroProfile and Jakarta EE. Then, do I have to build everything from scratch? Are there tools that will make coding my application easier (in 2022)? Join us as we answer these questions, demonstrate the tools in action, and talk about what may be coming next.\r\n\r\nMicroProfile seeks to optimize enterprise Java for microservices architecture and its APIs are gaining momentum and popularity. Jakarta EE is an open set of APIs that enables the worldwide community of Java developers to build applications for enterprises. Both MicroProfile and Jakarta EE are often used together to develop cloud-native Java applications. Then, are tools available for developers to easily build applications with MicroProfile and Jakarta EE?\r\n\r\nIn this session, we will examine the tools that are available to make your life easier as you code MicroProfile and Jakarta EE-based applications for cloud. These tools help developers throughout the development lifecycle, from creating a new application, working with compatible runtimes and your favourite editor, to testing your application. Join us to learn about what's out there, talk about what's coming, and see these tools in action.","persons":[{"id":1571,"full_public_name":"YK Chang","abstract":"YK is currently an architect and developer advocate on the IBM's application platform (Open Liberty/WebSphere) team and contributes to various OSS projects.  His focus is on developer experience and the development of cloud-native applications using MicroProfile, Jakarta EE and other cloud technologies.  He is keen on how we can make life easier for developers.","twitter_name":"yeekangc","avatar_path":"/system/avatars/1571/large/1516876387850.jpeg?1644596644"},{"id":3314,"full_public_name":"Kathryn Kodama","abstract":"Kathryn is a software developer on the Open Liberty Developer Experience team at IBM Canada. She has contributed to a number of open-source projects within the MicroProfile ™ and Jakarta EE ™ community, such as the Language Server for MicroProfile (Eclipse LSP4MP), the Language Server for Jakarta EE (Eclipse LSP4Jakarta), and the MicroProfile Starter for Visual Studio Code (VS Code). Kathryn has also contributed to the development of dev mode for OpenLiberty and corresponding editor plugins.","twitter_name":"@KathrynKodama","avatar_path":"/system/avatars/3314/large/1558567107289.jpeg?1641570435"}]}],"Security":[{"id":7146,"date":"2022-04-13T07:50:00-04:00","start":"07:50","duration":"00:50","room":"Security","title":"Women In Tech Breakfast","track":"admin","type":"other","abstract":"Women In Tech Breakfast","persons":[]},{"id":6881,"date":"2022-04-13T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Security","title":"Double-plus Ungood: Why Log4Shell Is So Bad","track":"Security","type":"lecture","abstract":"Log4Shell shook the Java community. What made it so bad and what do we do about it?","persons":[{"id":2647,"full_public_name":"Josh Cummings","abstract":"Josh enjoys application security, live hacking, and frosted mini-wheats. He works for VMWare, maintaining Spring Security.","twitter_name":"jzheaux","avatar_path":"/system/avatars/2647/large/mug.png?1601905310"}]},{"id":6522,"date":"2022-04-13T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Security","title":"Stranger Danger: Your Java Attack Surface Just Got Bigger","track":"Security","type":"lecture","abstract":"Building cloud-native Java applications is undoubtedly awesome. However, it comes with undeniable new risks. Next to your own code, you are relying on so many other things. Blindly depending on open-source libraries and Docker images can form a massive risk for your application. The wrong package can introduce severe vulnerabilities into your application, exposing your application and your user's data. Join this hands-on Java cloud-native live-hacking session where we’ll show common threats, vulnerabilities, and misconfigurations. Most importantly, you’ll learn how to protect your application with actionable remediation and best practices","persons":[{"id":1037,"full_public_name":"Brian Vermeer","abstract":"Sr. Developer Advocate for Snyk, Java Champion, and Software Engineer with over a decade of hands-on experience in creating and maintaining software. He is passionate about Java, (Pure) Functional Programming and Cybersecurity. Brian is a JUG leader for the Virtual JUG and the NLJUG. He also co-leads the DevSecCon community and is a community manager for Foojay. He is a regular international speaker on mostly Java-related conferences like JavaOne, Devnexus, Devoxx, Jfokus, JavaZone and many more. Besides all that, Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher.","twitter_name":"BrianVerm","avatar_path":"/system/avatars/1037/large/profile-picture.jpeg?1634309368"}]},{"id":6620,"date":"2022-04-13T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Security","title":"From DevOps to DevSecOps","track":"Security","type":"lecture","abstract":"This talk is a simple step-by-step framework for a full Dev(Sec)Ops cultural transformation borrowing ideas from Lean/Agile/Digital Transformation. It explains how to build trust. It addresses the mindset shift concerns for all relevant audiences. It covers first steps and how to track progress. It's adaptable to any environment regardless of industry, technology, or maturity. Most importantly it's been proven in a highly diverse environment of 600 development teams at Comcast.","persons":[{"id":3288,"full_public_name":"Larry Maccherone","abstract":" Larry is the author of a dozen or so open source projects one of which gets 1M downloads a month but his day job is Agile and Dev(Sec)Ops transformation. At Comcast, he launched and scaled the DevSecOps Transformation program over five years, and is now at Contrast helping organizations empower development teams to take ownership of security.","twitter_name":"LMaccherone","avatar_path":"/system/avatars/3288/large/8D97A822-5938-4E77-A544-CD4672E7CCE6.jpeg?1635952037"}]},{"id":6537,"date":"2022-04-13T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Security","title":"Mother Nature vs Java - the security face off","track":"Security","type":"lecture","abstract":"Mother Nature has had millenia to build up it’s defences to the many potential hazards and attacks it may face. So given it’s wisdom and expertise on this subject, what can we as software developers learn from it and bring back to the evolution of our own application’s security? In this session we’ll explore where software and biology overlap when it comes to security and lessons we can learn from nature to improve our own application security.","persons":[{"id":816,"full_public_name":"Steve Poole","abstract":"Steve Poole is a Developer Advocate, DevOps practitioner  and a long time  Java developer, leader and evangelist. He’s been working on Java SDKs and JVMs since Java was less than one year old. ","twitter_name":"spoole167","avatar_path":"/system/avatars/816/large/steve.png?1632196472"},{"id":3250,"full_public_name":"Grace Jansen","abstract":"Grace is a Developer Advocate at IBM, working with Open Liberty, MicroProfile and Cloud Technologies. She has been with IBM since graduating from Exeter University with a Degree in Biology. Grace enjoys bringing a varied perspective to her projects and using her knowledge of biological systems to simplify complex software patterns and architectures. As a developer advocate, Grace builds POC’s, demos and sample applications, and writes guides and tutorials. She is a regular presenter at international technology conferences and has recently authored a book on reactive systems. Grace also has a keen passion for encouraging more women into STEM and especially Technology careers.","twitter_name":"gracejansen27","avatar_path":"/system/avatars/3250/large/Picture_1.png?1634727641"}]},{"id":6683,"date":"2022-04-13T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Security","title":"Lock That Sh*t Down!","track":"Security","type":"lecture","abstract":"In this session, you'll learn about recommended patterns for securing your backend APIs, the infrastructure they run on, and your SPAs and mobile apps.\r\n","persons":[{"id":807,"full_public_name":"Brian Demers","abstract":"Brian Demers is a Developer Advocate at Okta and a PMC member for the Apache Shiro project. He spends much of his day contributing to OSS projects in the form of writing code, tutorials, blogs, and answering questions. Along with typical software development, Brian also has a passion for fast builds and automation.\r\n\r\nAway from the keyboard, Brian is a beekeeper and can likely be found playing board games. You can find him on Twitter at https://twitter.com/briandemers. ","twitter_name":"BrianDemers","avatar_path":"/system/avatars/807/large/gravatar.jpeg?1566324963"},{"id":588,"full_public_name":"Matt Raible","abstract":"Web Developer, Java Champion, and Developer Advocate at Okta with a passion for skiing, mountain biking, VWs, and good beer. Driving a '66 21-window and a '90 Syncro. Made in Montana. @mraible on Twitter.","twitter_name":"mraible","avatar_path":"/system/avatars/588/large/mattraible.jpeg?1574733917"}]}],"Practices and other tech":[{"id":7007,"date":"2022-04-13T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Practices and other tech","title":"Refactoring Code: An Incremental and Purpose Driven Approach","track":"Practices and other tech","type":"lecture","abstract":"Continuous refactoring is critical to succeeding in projects and is an important part of sustainable agile development.\r\n\r\nIn this workshop, we will start by discussing how to approach refactoring, the essential steps we need to take, and look into how to incrementally improve the internal design of code to make it extensible, maintainable, and cost-effective to change. In addition to discussing the concepts, we will take several code examples from real projects, discuss the code smells and explore the refactoring techniques. Along the way, we will also dive into refactoring short code samples and measure the quality of code before and after refactoring.","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]},{"id":6710,"date":"2022-04-13T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Practices and other tech","title":"Writing Code for the Future","track":"Practices and other tech","type":"lecture","abstract":"Are you still referring to your primary instances as \"master?\" In our evolving culture, there are myriad words and phrases to be avoided in our code, towards the goal of software being an equitable, welcoming space. Join me to learn what's problematic to include in your code, why these things ought to be avoided, and what to write instead. ","persons":[{"id":1190,"full_public_name":"Valarie Regas","abstract":"Valarie Regas is a DevOps enthusiast, a Georgia Tech coding bootcamp graduate, and a veteran mommy. She holds a BA in Psychology and currently works as a DevOps Engineer. After years being a stay-at-home mom, she decided to change her life by entering Tech, and has learned a lot along the way. In addition to DevOps, she enjoys mixed martial arts fighting, table-top role playing games, public speaking, creating tiny humans, and political activism.  ","twitter_name":"@ValarieRegas","avatar_path":"/system/avatars/1190/large/Screen_Shot_2022-01-12_at_3.38.21_PM.png?1642436675"}]},{"id":6729,"date":"2022-04-13T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Practices and other tech","title":"Forming a Culture Club","track":"Practices and other tech","type":"lecture","abstract":"Ever wonder how to build a good work culture? I will share the key steps based on over 25 years of experience building software. I will bring together my experience and academic knowledge based on reading obsessively about the subject.","persons":[{"id":577,"full_public_name":"Dennis Sharpe","abstract":"Dennis Sharpe is a software architect with over 20 years experience leading, designing, and coding software applications. He has experience in a variety of different industries including healthcare, federal government, loyalty, marketing, utilities, telecommunications, and financial. He has experience speaking at several conferences and events including DevNexus, DevFest and Java User Groups. He also has experience training and providing technical leadership for hackathons and coding dojos.","twitter_name":"@SharpeDennis","avatar_path":"/system/avatars/577/large/closeup.jpg?1627321716"}]},{"id":6974,"date":"2022-04-13T14:20:00-04:00","start":"14:20","duration":"00:20","room":"Practices and other tech","title":"From Zero to Monitored","track":"Practices and other tech","type":"lecture","abstract":"This talk will cover some of the basics of how to get started with metrics and getting your simple java application to have monitoring. Not only will we cover which metrics are best for SLIs and when and what your SLOs should be, but also when to incorporate logs and tracing, as well as metrics. Participants will expect to leave knowing some observability basics and how to use the monitoring to understand system health and avoid some potential incidents.","persons":[{"id":3320,"full_public_name":"Ajuna Kyaruzi","abstract":"Ajuna Kyaruzi works in Developer Relations at Datadog and cares about using software to help people sustainably run large-scale systems, focusing on Incident Managements and SLOs. She loves community building and volunteers with multiple mentorship programs aimed at helping early career folks break into tech, and ensuring they have successful careers. Previously she worked at Google as a Software Engineer on Google Maps and as a Site Reliability Engineer on Google Cloud.","twitter_name":"ajunaky","avatar_path":"/system/avatars/3320/large/ajuna.jpeg?1641519571"}]},{"id":6841,"date":"2022-04-13T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Practices and other tech","title":"Adding Full Text Search to your Java Applications with Elasticsearch","track":"Practices and other tech","type":"lecture","abstract":"So you've created a Java-based application with Micronaut that persists and retrieves data to your backend DB. Everything works perfectly! The client is happy, the PM is happy - everyone is happy! And then one day, the client calls the PM and says \"hey, can you add Google to my site?\" And the PM calls you and says \"hey, you can add Google to the site in like just a few hours, right?\" And in your head you're like \"uhhh...no, Google is a company, not an open-source Java module\" but you say to the PM \"sure, we can add full-text search to the site!\" What's that? You've never worked with full-text search before? Then this session is for you!","persons":[{"id":688,"full_public_name":"Todd Sharp","abstract":"I'm a Developer Advocate for Oracle focusing on the Oracle Cloud. I have 15 years experience as a full stack developer.  I've been working with dynamic JVM languages and various JavaScript frameworks for my whole career - originally with ColdFusion and more recently Groovy/Grails on the server side.  I have experience with everything from jQuery, ExtJS to all versions of Angular on the front end.","twitter_name":"recursivecodes","avatar_path":"/system/avatars/688/large/15035732_1310991748965002_2689404947618856960_n.jpg?1503360504"}]}],"Keynote Room":[{"id":7009,"date":"2022-04-13T09:00:00-04:00","start":"09:00","duration":"01:00","room":"Keynote Room","title":"Meta-modern Software Architecture","track":"Keynote","type":"lecture","abstract":"Where do architecture styles come from? Do architects retreat to an ivory tower to decide what the Next Big Thing will be? No–new capabilities constantly appear in the software development ecosystem, and clever architects figure out new ways to leverage the new building blocks, leading to new named architecture styles which are only named after they have existed for a while. This is similar to art and cultural movements, how Victorianism became Modernism. In this keynote, Neal traces the similarities between architecture styles and cultural movements, how each affect the other, and points towards how Metamodernism will inform architecture, corporations, and individual workers in a fundamental way.\r\n\r\nNote to organizers: This keynote covers technical details from both my books _Fundamentals of Software Architecture and Software Architecture: The Hard Parts to illustrate the larger observations about both software architecture and the profession of software engineer. This keynote is more philoshopical than the Software Architecture: The Hard Parts keynote, ending with a call to action that architects and developers must become aware of the impact of ethics in seemingly technical decisions and act accordingly to improve rather than degrade the world.","persons":[{"id":711,"full_public_name":"Neal Ford","abstract":"Neal is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a software company and a community of passionate, purpose-led individuals, delivering technology to address the toughest challenges, all while seeking to revolutionize the IT industry and create positive social change. He speaks at many conferences.\r\n","twitter_name":"neal4d","avatar_path":"/system/avatars/711/large/NF.png?1512951094"}]},{"id":7114,"date":"2022-04-13T16:50:00-04:00","start":"16:50","duration":"00:10","room":"Keynote Room","title":"DevNation Opening Act","track":"Keynote","type":"lecture","abstract":"DevNation Opening Act","persons":[{"id":1879,"full_public_name":"Ana Maria Mihalceanu","abstract":"Ana is a Java Champion, Developer Advocate, co-founder of Bucharest Software Craftsmanship Community, and a constant adopter of challenging technical scenarios involving Java-based frameworks and multiple cloud providers. She is an active supporter of technical communities’ growth through knowledge sharing and enjoys curating content for conferences as a program committee member. ","twitter_name":"@ammbra1508","avatar_path":"/system/avatars/1879/large/amv.jpeg?1570755550"},{"id":1389,"full_public_name":"Edson Yanaga","abstract":"Edson Yanaga, Red Hat's Director of Developer Experience, is a Java Champion and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java, Microservices, Cloud Computing, DevOps, and Software Craftsmanship.","twitter_name":"@yanaga","avatar_path":"/system/avatars/1389/large/edson_yanaga.png?1533308310"}]},{"id":7006,"date":"2022-04-13T17:00:00-04:00","start":"17:00","duration":"00:50","room":"Keynote Room","title":"The New Excitement Around The Good Old Java","track":"Keynote","type":"lecture","abstract":"A new version of Java is being released every six months. The days of giant releases are gone, Java has truly embraced the spirit of agility. Some wonder, what impact will this frequent release have on Java, its quality, adoption, and future development? What intensives do developers and organizations have to keep pace with Java. Should they stay abreast or catch up once in a few years? All good questions and reasonable concerns. To address those we will take a look at the recent changes, the benefits these offer, what exciting things are around the corner, and why we should stay abreast.","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]}],"Foyer":[{"id":7115,"date":"2022-04-13T07:30:00-04:00","start":"07:30","duration":"01:30","room":"Foyer","title":"Registration","track":"admin","type":"other","abstract":"Registration","persons":[]},{"id":7117,"date":"2022-04-13T11:00:00-04:00","start":"11:00","duration":"00:20","room":"Foyer","title":"Morning Break 2a","track":"admin","type":"other","abstract":"Morning Break 2a","persons":[]},{"id":7120,"date":"2022-04-13T12:20:00-04:00","start":"12:20","duration":"01:00","room":"Foyer","title":"Lunch Break I","track":"admin","type":"other","abstract":"Lunch Break I","persons":[]},{"id":7118,"date":"2022-04-13T15:20:00-04:00","start":"15:20","duration":"00:20","room":"Foyer","title":"Afternoon Break 1b","track":"admin","type":"other","abstract":"Afternoon Break 1b","persons":[]},{"id":7123,"date":"2022-04-13T18:00:00-04:00","start":"18:00","duration":"01:30","room":"Foyer","title":"Quarkus Rocks Party","track":"admin","type":"other","abstract":"Quarkus Rocks Party","persons":[]}],"Web and Front-end":[{"id":6916,"date":"2022-04-13T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Web and Front-end","title":"Alpine.js : Declare and React with Simplitcy","track":"Web and Front-end","type":"lecture","abstract":"In this session we will introduce the power of Alpine.js as a modern, lightweight, declarative and reactive Javascript framework that can be embedded on any webpage without any need of webpack or complicated build processes.","persons":[{"id":845,"full_public_name":"Luis Majano","abstract":"Luis Majano is a Computer Engineer born in El Salvador and is the president of Ortus Solutions (www.ortussolutions.com), a consulting firm specializing in web development, architecture and professional open source support and services.  His background includes over 17 years of software development experience, architecture and system design. \r\n\r\nHe is the creator of the ColdBox MVC Platform, TestBox BDD, ContentBox Modular CMS and many more open source projects.  He is an Adobe Community Professional and lives in Texas with his beautiful wife Veronica, baby girl Alexia and baby boy Lucas! \r\n\r\n","twitter_name":"lmajano","avatar_path":"/system/avatars/845/large/Screen_Shot_2017-09-30_at_12.18.23_PM.png?1506792095"}]},{"id":6868,"date":"2022-04-13T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Web and Front-end","title":"On the Edge of My Server","track":"Web and Front-end","type":"lecture","abstract":"Edge functions can be potentially game changing. You get the power of serverless functions but running at the CDN level - meaning the response is incredibly fast. All the providers are piling into the space – AWS, Cloudflare, Netlify and Vercel to name just a few – but all the offerings are quite different. In this talk, we'll explore why edge functions can be powerful, the different offerings available, and examples of how you can use them on different providers.","persons":[{"id":23,"full_public_name":"Brian Rinaldi","abstract":"Brian Rinaldi is a Developer Experience Engineer at LaunchDarkly with over 20 years experience as a developer for the web. Brian is actively involved in the community running developer meetups via CFE.dev and Orlando Devs. He's the editor of the Jamstacked newsletter and co-editor of Mobile Dev Weekly and co-author of The Jamstack Book from Manning.","twitter_name":"remotesynth","avatar_path":"/system/avatars/23/large/brian-rinaldi.jpg?1526387937"}]},{"id":6943,"date":"2022-04-13T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Web and Front-end","title":"AI in Web - TensorFlow.js","track":"Web and Front-end","type":"lecture","abstract":"AI is showing up everywhere, even on devices and websites.  You don't need a Ph.D. in machine learning to take advantage of AI.","persons":[{"id":471,"full_public_name":"Gant Laborde","abstract":"Inspirational technology strategist.  Tinkerer at heart, but with a passion to ship a quality product at the end.  Love leadership and teaching has driven me to many conferences worldwide.","twitter_name":"gantlaborde","avatar_path":"/system/avatars/471/large/gant-face.jpg?1484858603"}]},{"id":6855,"date":"2022-04-13T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Web and Front-end","title":"Peanut Butter Jamstack","track":"Web and Front-end","type":"lecture","abstract":"The Jamsack (JavaScript, APIs, and Markup) is far beyond \"static sites\" and provides you the flexibility of an app server locally and the simplicity of simple files in production.","persons":[{"id":329,"full_public_name":"Raymond Camden","abstract":"Raymond Camden is a Senior Developer Evangelist for Adobe. He works on the Document Services APIs to build powerful (and typically cat-related) PDF demos.  He is the author of multiple books on web development and has been actively blogging and presenting for almost twenty years. Raymond can be reached at his blog (www.raymondcamden.com), @raymondcamden on Twitter, or via email at raymondcamden@gmail.com.","twitter_name":"raymondcamden","avatar_path":"/system/avatars/329/large/raymond-camden.jpg?1559660223"}]},{"id":6744,"date":"2022-04-13T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Web and Front-end","title":"ARIA: A Grande Method Of Accessible Markup","track":"Web and Front-end","type":"lecture","abstract":"ARIA, or accessible rich internet applications, are a very powerful set of attributes that define non-semantic content for your users with disabilities. In this session, we are going to break down web accessibility at its most granular level before exploring ARIA properties that will help create amazing user experiences, when semantic markup won't cut it. By the end of this talk, you will walk away with the knowledge of introductory ARIA concepts and when to put them into practice.","persons":[{"id":803,"full_public_name":"Chris DeMars","abstract":"Chris DeMars is a Developer Advocate at Rocket Mortgage, the nation’s largest lender, based in Detroit, Michigan. He has over 20 years of technical experience and speaks all over the world on web accessibility, and CSS. For his community contributions, he holds awards as a Microsoft MVP, Google Developer Expert, and Cloudinary Media Developer Expert. Chris loves coming up with solutions for all types of applications, which include modular CSS architectures, performance, and advocating for web accessibility. When he is not working on making the web great and inclusive you can find him writing blog posts, rating Detroit Style pizza, and watching horror movies.","twitter_name":"saltnburnem","avatar_path":"/system/avatars/803/large/headshot.jpg?1634739384"}]},{"id":7148,"date":"2022-04-13T18:20:00-04:00","start":"18:20","duration":"01:00","room":"Web and Front-end","title":"Java JEP’dy : The community quiz hour","track":"admin","type":"other","abstract":"Java JEP’dy : The community quiz hour\r\nJoin in (and maybe win a prize) or just watch as we test the Java knowledge of Devnexus speakers and attendees.\r\nDesigned by the London Java Community and organised and sponsored by Sonatype and Microsoft this fun event will test your knowledge of all aspects of Java: people, technology, history, geography etc.\r\nInspired by the Jeopardy! TV quiz game we’ll test our participants with clues from various categories including\r\n“Cryptic Keywords”. - cryptic clues that match Java language reserved words\r\n“Java through the ages” - History of Java of course\r\n “Deprecated” - rarely used features\r\n“Billys cup of Joe”  - clues about real Java tech from our very own Billy Korando\r\nAnd many many more.\r\nCome be a part of this awesome event and witness the encyclopaedic knowledge (or lack ) of your favourite Java celebs as the try to answer clues like\r\n“In Java 15 we said goodbye to this German rhinoceros”\r\n“the name for the Java codebase prior to Hotspot”\r\n“This database engine sounds like an HTML tag”\r\n“-1 % 2 == 1\"\r\nWith Edson Yanaga from Redhat as the game host this event will teach you things about Java you never knew.\r\nSign up at the Sonatype booth if you want to be part of the action our just come along and cheer. Everyone is welcome.","persons":[]}],"Java Platform":[{"id":6987,"date":"2022-04-13T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Java Platform","title":"How Amber is Driving Java’s Evolution","track":"Java Platform","type":"lecture","abstract":"Project Amber is an OpenJDK project delivering productivity focused language improvements to Java. In this presentation we will be covering key changes delivered by project Amber in recent Java versions, understand the theme and motivations behind these changes, and peek into the future to see where Project Amber is leading the Java language! If you have been wondering about Records, Pattern Matching, and what this means for Java, this presentation is for you!","persons":[{"id":765,"full_public_name":"Billy Korando","abstract":"Billy is a Java Developer Advocate with the Java Platform Group at Oracle. With over a decade of experience in Java, Billy brings a passion for helping developers find ways to reduce tedious work; such as project initiation, deployment, testing and validation, through automation and adopting the latest features and tools in the Java ecosystem. Outside of work Billy enjoys traveling, playing kickball, and cheering on the Kansas City Chiefs. Billy also co-organizes the Kansas City Java users group.\r\n","twitter_name":"@BillyKorando","avatar_path":"/system/avatars/765/large/billy.jpg?1625677354"}]},{"id":6832,"date":"2022-04-13T11:20:00-04:00","start":"11:20","duration":"00:30","room":"Java Platform","title":"What is Adoptium?","track":"Java Platform","type":"lecture","abstract":"AdoptOpenJDK has moved to the Eclipse Foundation. In this session, I will explain what the move means, the progress we've made and the exciting new opportunities! Come along and learn what Eclipse Temurin is, what the migration path looks like and how to get involved in the project!","persons":[{"id":3165,"full_public_name":"George Adams","abstract":"George Adams is a Senior Program Manager at Microsoft, Java Champion and is the recently appointed Steering Committee chair at Eclipse Adoptium. Since co-founding AdoptOpenJDK in 2016 he has been leading the community outreach efforts and was heavily involved in moving the project to the Eclipse Foundation. George also contributes to both the OpenJS Foundation and the Node.js Foundation where he is a core collaborator and plays an active role in several of the workgroups.","twitter_name":"@gdams","avatar_path":"/system/avatars/3165/large/profile_pic.jpg?1625145042"}]},{"id":6829,"date":"2022-04-13T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Java Platform","title":"Java on CRaC: Superfast JVM Application Startup","track":"Java Platform","type":"lecture","abstract":"One of the key benefits of a microservice architecture is the ability to dynamically respond to changes in load by spinning up new instances as required. However, when deploying JVM-based services, the warmup time of JIT compilation can be a limitation on the effectiveness of this technique.\r\n\r\nOne approach to solving this problem is using native images, where the service is statically compiled using an ahead-of-time (AOT) compiler.  Although this does reduce startup time and footprint, it does so at the cost of overall performance.\r\n\r\nA new project has been proposed and accepted into OpenJDK called CRaC (Coordinated Restore at Checkpoint).  The goal is to research the co-ordination of Java programs with mechanisms to checkpoint (snapshot) a running application.  Restoring from the snapshot could solve some of the problems with the startup and warmup times, especially in microservices.\r\n\r\nIn this session, we’ll look at the main challenges for such a project, potential solutions and the results from a proof-of-concept implementation.\r\n","persons":[{"id":2526,"full_public_name":"Simon RItter","abstract":"I joined Sun Microsystems in February 1996, and have followed Java throughout its lifetime at Sun then Oracle and now Azul Systems.","twitter_name":"speakjava","avatar_path":"/system/avatars/2526/large/SimonRitter-181023-3.png?1585751745"}]},{"id":6825,"date":"2022-04-13T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Java Platform","title":"Simple tweaks to get the most out of your JVM","track":"Java Platform","type":"lecture","abstract":"This talk will go through all the different JVM options and give you some easy and simple advice on how to get the most out of your JVM to save not only money but also energy on the cloud.","persons":[{"id":1583,"full_public_name":"Jamie Lee Coleman","abstract":"Jamie is a software developer and Advocate for Open Liberty, MicroProfile and Kabanero based at IBM’s R&D Laboratory in Hursley, UK. He is a subject matter expert in containerised solutions and takes a keen interest in emerging technologies with experience in Maven, git, Jenkins and microservice architecture. He fell in love with Java at University and has gone on to talk at many conferences about using Java with microservices. He has worked on a wide variety of projects such as modernising CICS mainframe testing infrastructure, creating and automating the creation of Docker images for IBM’s products, contributing to a DevOps pipeline offering and creating web applications for events at the Lab. His recent passion is around raising awareness about energy consumption of technology and discovering ways to help reduce technologies carbon footprint.","twitter_name":"@Jamie_Lee_C","avatar_path":"/system/avatars/1583/large/IMG_6437.png?1578395918"}]},{"id":6730,"date":"2022-04-13T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Java Platform","title":"Using byte-code analysis to modernize your Java EE applications","track":"Java Platform","type":"lecture","abstract":"Did you know you can analyze Java EE applications directly from the application archive without needing to dig through the source?  We will show you how to analyze your applications using a simple command-line tool that will provide reports on your application structure and detailed analysis of potential issues when moving to a new Java SE or EE level or to cloud environments.  We will also demonstrate how you can write your own custom rules needed for your analysis. ","persons":[{"id":3332,"full_public_name":"Cindy High","abstract":"Cindy High is with IBM and is the WebSphere Application Server migration tools architect focusing on application modernization and configuration migration. She has worked over 20 years with Java EE and application server technology. The tools we have developed over the years for WebSphere can help you understand your applications better!  Cindy is a biking enthusiast and lives in Raleigh NC.","twitter_name":"CTHigh","avatar_path":"/system/avatars/3332/large/cthigh.jpg?1636650326"}]}],"Frameworks":[{"id":6784,"date":"2022-04-13T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Frameworks","title":"Batch Processing in Action","track":"Frameworks","type":"lecture","abstract":"In the enterprise world, we need to deal with a large amount of data that comes from multiple sources, and there's a considerable amount of effort to read, process, and distribute it. As the number of records increases, plain Java may not be the best solution. With many out-of-the-box solutions such as transaction management, retry, chunk processing, and several templates, Spring Batch is a lightweight framework to help you in these tasks. \r\nThis talk will dig into Spring Batch, discuss its architecture and templates, and live code examples to demonstrate its power.\r\n","persons":[{"id":3231,"full_public_name":"Hillmer Chona","abstract":"Java Champion, Lead Software Engineer, Medellín JUG Leader, Duke’s Choice Award Winner, focusing on software development with Java and Cloud Technologies","twitter_name":"https://twitter.com/HillmerCh","avatar_path":"/system/avatars/3231/large/hillmer.jpeg?1643385002"},{"id":2543,"full_public_name":"Rodrigo Graciano","abstract":"NYJavaSIG JUG leader, tech enthusiast, and principal software engineer in NYC. Every week you can find suggestions of articles related to the JVM ecosystem at https://graciano.dev.","twitter_name":"@rodrigograciano","avatar_path":"/system/avatars/2543/large/graciano.jpg?1589926986"}]},{"id":6963,"date":"2022-04-13T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Frameworks","title":"What’s New in Spring in 2022","track":"Frameworks","type":"lecture","abstract":"Spring Framework 5, Spring Boot 2, and Spring Cloud have had stable versions since 2017-2018. This year each active Spring project will have a new major release. We will talk about the practical implications of changes to the Java baseline, Jakarta EE, native compilation, observability and more. We will discuss the support options for remaining on the existing generation. We will show what upgrading an existing application looks like using the latest milestones.\r\n","persons":[{"id":1182,"full_public_name":"Spencer Gibb","abstract":"Spencer Gibb is a Software Engineer at VMware where he is the co-founder and lead of the Spring Cloud Core projects. He is a husband, father, and geek.","twitter_name":"spencerbgibb","avatar_path":"/system/avatars/1182/large/Spencer_Gibb_Headshot_-_Square_-_Hi_Res.jpg?1538405673"}]},{"id":7003,"date":"2022-04-13T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Frameworks","title":"5 Ways to Make Java Development and Kubernetes Spark Joy With Quarkus","track":"Frameworks","type":"lecture","abstract":"Kubernetes is great, but sometimes can be hard too. What about making it easy and productive at the same time? And what if we would spark joy while coding Kubernetes-Native Java applications?\r\n\r\nLook no further! Join us on this talk and learn how to have loads of fun with millisecond application restarts, experience tons of productivity with tools such as continuous testing and dev services, and how to make the job of packaging, sharing, deploying, and updating your code on Kubernetes a matter of a few keystrokes. Did we mention live demos? Yes, we do have them!","persons":[{"id":1389,"full_public_name":"Edson Yanaga","abstract":"Edson Yanaga, Red Hat's Director of Developer Experience, is a Java Champion and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java, Microservices, Cloud Computing, DevOps, and Software Craftsmanship.","twitter_name":"@yanaga","avatar_path":"/system/avatars/1389/large/edson_yanaga.png?1533308310"}]},{"id":6968,"date":"2022-04-13T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Frameworks","title":"Spring Cloud Stream Past, Present, and Future.","track":"Frameworks","type":"lecture","abstract":"Spring Cloud Stream is a framework for building highly scalable microservices connected to shared messaging systems.\r\nTogether with Spring Cloud Function, Spring Cloud Task and other frameworks from the Spring Cloud portfolio, it is evolving and quickly becoming a go-to solution for users who want to spend more time concentrating on functional aspects of their microservices while guarding themselves from nonfunctional (boilerplate) concerns such as connectivity, integration, and many others.\r\nIn this \"state of the union\" session (50/50 presentation/live-code), Oleg and Glenn will discuss and demonstrate the current features, the recent changes and enhancements, and talk about what's coming in the future.","persons":[{"id":699,"full_public_name":"Glenn Renfro","abstract":"As a Pivotal engineer, Glenn Renfro is a core committer for Spring Cloud Task, Spring Batch and Spring Cloud Data Flow. He has 14 years experience in designing, building and delivering enterprise level applications in Java and 21 years total of software development experience.","twitter_name":"cppwfs","avatar_path":"/system/avatars/699/large/glenn.jpeg?1504215166"},{"id":3386,"full_public_name":"Oleg  Zhurakousky","abstract":"Spring Cloud Stream/Spring Cloud Function lead.","twitter_name":"z_oleg","avatar_path":"/system/avatars/3386/large/Screen_Shot_2021-04-09_at_15.58.25.png?1637765153"}]},{"id":6769,"date":"2022-04-13T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Frameworks","title":"gRPC Cornerstone: HTTP/2… or HTTP/3?","track":"Frameworks","type":"lecture","abstract":"Hiding all the underlying protocol complexity makes gRPC really popular.  The framework makes all the decisions on how to layer an RPC model on top of HTTP/2. API designers and users are not exposed to low-level implementation details.\r\n\r\nOn the other hand, knowing these details may be necessary when troubleshooting and making performance optimizations in a real-life system. \r\n\r\nThis talk provides practical advice on triaging gRPC interactions and achieving performance improvements - by covering technical details, starting with HTTP/2 frames and streams in gRPC. It also exposes the limitations of HTTP/2 and prepares the audience for the upcoming HTTP/3 standard and its integration with gRPC.\r\n\r\nIt is intended for current & potential gRPC users as well as engineers interested in exploring the benefits of HTTP/3. \r\n","persons":[{"id":2470,"full_public_name":"Mykyta Protsenko","abstract":"Mykyta Protsenko is a senior software engineer at Netflix. He is passionate about all things scalable, from coding to deploying to monitoring. ","twitter_name":"@mykyta_p","avatar_path":"/system/avatars/2470/large/mykyta_square.jpg?1642196576"},{"id":1565,"full_public_name":"Alex Borysov","abstract":"Alex is currently a senior software engineer at Netflix, where he is working on building a unified global digital Studio that powers the effective production of Netflix content. \r\n\r\nPrior to joining Netflix, Alex had designed, implemented, and run various World-scale distributed systems, including ML infrastructure for payments fraud detection at Google; large-scale backends at Nest; microservice architecture for world-leading social casino games; and core infrastructure services for a unicorn startup.","twitter_name":"aiborisov","avatar_path":"/system/avatars/1565/large/alex_borysov_headshot.png?1565851077"}]}],"Core Java":[{"id":6668,"date":"2022-04-13T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Core Java","title":"A Tour of the Modern Java Platform","track":"Core Java","type":"lecture","abstract":"The Java Platform has seen a tremendous amount of evolution and improvements over the past 5 years in many different areas including: language features in Java, Kotlin, and Scala, Functional Programming, dev environments, test workflows, Reactive, Stream processing, distributed data, containerization, Serverless, and AoT compilation.\r\nThis talk will give you a tour of the most important improvements, why they matter, and how to take advantage of them.","persons":[{"id":1589,"full_public_name":"James Ward","abstract":"James Ward is a nerd / software developer who shares what he learns with others though presentations, blogs, demos, and code. After over two decades of professional programming, he is now a self-proclaimed Typed Pure Functional Programming zealot but often compromises on his ideals to just get stuff done. After spending too many sleepless nights in data centers repairing RAID arrays, he now prefers higher-level cloud abstractions with appropriate escape hatches. James is a huge Open Source proponent, hoping to never get burned by lock-in again.","twitter_name":"_JamesWard","avatar_path":"/system/avatars/1589/large/james_ward_2015.jpg?1548958691"}]},{"id":7005,"date":"2022-04-13T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Core Java","title":"What's \"Loom\"ing in Java: The Why and What of Project Loom","track":"Core Java","type":"lecture","abstract":"Multithreading has been in Java from day one. The multithreading API has gone through significant changes over the years. And yet, we have something major that's threading again. What's the reason for yet another implementation, yet another change? How is that different from what we already have. When will we use the new model and when will we stick to the existing APIs.\r\n\r\nToo many questions but we will not take them all in parallel. Instead we will give the questions serious thoughts and get a deeper understanding of the purpose of Project Loom, what problems it solves, and how and when we can benefit from it.","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]},{"id":6484,"date":"2022-04-13T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Core Java","title":"Preparing for the Java cert and learning new features (part 1 - Java 9 to 11)","track":"Core Java","type":"lecture","abstract":"Looking to learn about features in the language added after Java 8 in more detail? As programmers we are used to dealing with edge cases. But what about edge cases in the language? As certification book authors, we encounter lots of interesting and/or surprising behavior.  After a brief overview of the cert, we will explain these features and walk through lots of tricky questions. Come to this session and walk away with an increased awareness in these Java topics.\r\n","persons":[{"id":3403,"full_public_name":"Scott Selikoff","abstract":"","twitter_name":"ScottSelikoff","avatar_path":"/system/avatars/3403/large/tFlve38E_400x400.jpg?1642525052"},{"id":883,"full_public_name":"Jeanne Boyarsky","abstract":"Jeanne Boyarsky is a Java Champion and published author. She wrote wrote Sybex’s hugely popular Java 8 and Java 11 certification books. She is a Java developer with 17 years experience and volunteers with a FIRST robotics team.  In 2018, she spoke at DevNexus, Oracle Code One and QCon.  Jeanne is a Distinguished Toastmaster which involves giving over 50 public speeches. For more on Jeanne’s professional experience:, see http:/jeanne.boyarsky.com","twitter_name":"jeanneboyarsky","avatar_path":"/system/avatars/883/large/2017-black-and-white.jpeg?1510619579"}]},{"id":6485,"date":"2022-04-13T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Core Java","title":"Preparing for the Java cert and learning new features (part 2 - Java 12 to 17)","track":"Core Java","type":"lecture","abstract":"Looking to learn about features in the language added after Java 11 in more detail? As programmers we are used to dealing with edge cases. But what about edge cases in the language? As certification book authors, we encounter lots of interesting and/or surprising behavior.  After a brief overview of the cert, we will explain these features and walk through lots of tricky questions. Come to this session and walk away with an increased awareness in these Java topics.","persons":[{"id":3403,"full_public_name":"Scott Selikoff","abstract":"","twitter_name":"ScottSelikoff","avatar_path":"/system/avatars/3403/large/tFlve38E_400x400.jpg?1642525052"},{"id":883,"full_public_name":"Jeanne Boyarsky","abstract":"Jeanne Boyarsky is a Java Champion and published author. She wrote wrote Sybex’s hugely popular Java 8 and Java 11 certification books. She is a Java developer with 17 years experience and volunteers with a FIRST robotics team.  In 2018, she spoke at DevNexus, Oracle Code One and QCon.  Jeanne is a Distinguished Toastmaster which involves giving over 50 public speeches. For more on Jeanne’s professional experience:, see http:/jeanne.boyarsky.com","twitter_name":"jeanneboyarsky","avatar_path":"/system/avatars/883/large/2017-black-and-white.jpeg?1510619579"}]},{"id":6828,"date":"2022-04-13T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Core Java","title":"Clean Application Development with Records, Sealed Classes and Pattern Matching","track":"Core Java","type":"lecture","abstract":"The release of the JDK 17 brings interesting features in the Java language: sealed types and pattern matching for switch (as a preview feature). Along with the introduction of records, the implementation of pattern matching in the Java language begins to take shape. The JDK 18 brings even more with Record pattern matching (as a preview feature). In this presentation we show you how leveraging these features can bring very clean solutions to improve the modularity of your application. You will see on real patterns how pattern matching can change the way you write Java code. You will also see what we can expect on this topic in the future. It is mostly a live coding presentation, with some slides when the code shown cannot be executed. \r\n","persons":[{"id":2234,"full_public_name":"José Paumard","abstract":"José works as Java Developer Advocate at Oracle. PhD in applied maths and computer science, assistant professor at the University Sorbonne Paris Nord for 25 years, he is a Java Champion Alumni and JavaOne Rockstar. He is a member of the french Paris Java User Group, has been a co-organizer of the conference Devoxx France, and is a disorganizer of JChateau, an unconference held in the Chateau of the Loire Valley. He works on the dev.java documentation and community website, publishes the JEP Café, a monthly video cast on YouTube, and maintains a french YouTube channel with more than 80 hours of Java courses. He is also a Pluralsight author in the Java space.","twitter_name":"@JosePaumard","avatar_path":"/system/avatars/2234/large/apple-color-rect-02.jpg?1643701859"}]}],"Cloud Technology":[{"id":6678,"date":"2022-04-13T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Cloud Technology","title":"Apache Kafka simply explained","track":"Cloud Technology","type":"lecture","abstract":"Learn Apache Kafka in uncomplicated and entertaining terms and get equipped with practical knowledge for your first steps in the Apache Kafka world.","persons":[{"id":3257,"full_public_name":"Olena Kutsenko","abstract":"Olena is a software engineer and a developer advocate currently working at Aiven. She is passionate about open source, data, sustainable software development and team work. Her knowledge is shaped by expertise she acquired working in such companies as Nokia, HERE Technologies and AWS; and from the countries she was lucky to live in - Ukraine, Sweden, Spain and Germany.\r\n","twitter_name":"https://twitter.com/OlenaKutsenko","avatar_path":"/system/avatars/3257/large/IMG_20200628_082826_copy.jpg?1636634546"}]},{"id":6894,"date":"2022-04-13T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Cloud Technology","title":"Exploring Stateful Microservices in the Cloud Native World","track":"Cloud Technology","type":"lecture","abstract":"While stateless systems are easier to architect, design, and implement, the truth of the matter is that we live in a stateful world in which we need to keep track of the state of data in a lot of cases. So how can we handle persisting data with containerized microservices in a Cloud Native world?","persons":[{"id":3250,"full_public_name":"Grace Jansen","abstract":"Grace is a Developer Advocate at IBM, working with Open Liberty, MicroProfile and Cloud Technologies. She has been with IBM since graduating from Exeter University with a Degree in Biology. Grace enjoys bringing a varied perspective to her projects and using her knowledge of biological systems to simplify complex software patterns and architectures. As a developer advocate, Grace builds POC’s, demos and sample applications, and writes guides and tutorials. She is a regular presenter at international technology conferences and has recently authored a book on reactive systems. Grace also has a keen passion for encouraging more women into STEM and especially Technology careers.","twitter_name":"gracejansen27","avatar_path":"/system/avatars/3250/large/Picture_1.png?1634727641"},{"id":855,"full_public_name":"Mary Grygleski","abstract":"Mary is a Java Champion and a passionate Streaming Developer Advocate at DataStax, a leading data management company that champions Open Source software and specializes in Big Data, DB-as-a-service, Streaming, and Cloud-Native systems.  She spent 3.5 years previously as a very effective advocate at IBM, focusing on Java, Jakarta EE, OpenJ9, Open Source, Cloud, and Distributed Systems.  She transitioned from Unix/C to Java around 2000 and has never looked back since then.  She considers herself a polyglot and loves to continue learning new and better ways to solve real-life problems. She is an active tech community builder outside of her day job, and currently the President of the Chicago Java Users Group (CJUG), as well as a co-organizer for several IBM-sponsored meetup groups in the Greater Chicago area.","twitter_name":"@mgrygles","avatar_path":"/system/avatars/855/large/MaryGrygleski-2021.jpg?1637255348"}]},{"id":6967,"date":"2022-04-13T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Cloud Technology","title":"Supercharge your Ingress with Kong","track":"Cloud Technology","type":"lecture","abstract":"During this talk, you will learn how to declaratively enable security, API rate limiting, how to add native gRPC support using Kong Gateway and plugins.","persons":[{"id":656,"full_public_name":"Vik Gamov","abstract":"Viktor Gamov is a Principal Developer Advocate at Kong, Java Champion, and published author.","twitter_name":"gamussa","avatar_path":"/system/avatars/656/large/EDEC3D4E-AF01-4A04-ADB6-167AE599B1CE_1_201_a.jpeg?1586183630"}]},{"id":6971,"date":"2022-04-13T14:20:00-04:00","start":"14:20","duration":"00:50","room":"Cloud Technology","title":"Practical Cloud Pipelines","track":"Cloud Technology","type":"lecture","abstract":"Houseplants can be hard – in many cases, over- and under-watering can have the same symptoms. Take away the guesswork involved in caring for your houseplants while also gaining valuable experience in building a practical, event-driven pipeline in your own home! This talk explores the process of building a houseplant monitoring and alerting system using a Raspberry Pi and Apache Kafka. \r\n\r\nMoisture and temperature readings are captured from sensors in the soil and streamed into Kafka. From here, we’ll use stream processing to transform the data, creating a summary view of the current state and driving real-time push alerts to your phone through Telegram. In this session, I’ll talk about how I ingest the data, followed by a look at the tools, including ksqlDB and Kafka Connect, that will help transform the raw data into useful information.\r\n\r\nBy the end of the talk, you’ll have everything you need to start building practical streaming pipelines in your own home. Roll up your sleeves – let’s get our hands dirty!","persons":[{"id":3387,"full_public_name":"Danica Fine","abstract":"Danica began her career as a software engineer in data visualization and warehousing with a business intelligence team where she served as a point-person for standards and best practices in data visualization across her company. In 2018, Danica moved to San Francisco and pivoted to backend engineering with a derivatives data team which was responsible for building and maintaining the infrastructure that processes millions of financial market data per second in near real-time. Her first project on this team involved Kafka Streams -- she never looked back. Danica now works as a Developer Advocate with Confluent where she helps others get the most out of their event-driven pipelines. ","twitter_name":"@TheDanicaFine","avatar_path":"/system/avatars/3387/large/1540584701459.jpeg?1641519634"}]},{"id":6598,"date":"2022-04-13T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Cloud Technology","title":"How Microsoft Learned to Love Java","track":"Cloud Technology","type":"lecture","abstract":"This session is a fast-paced tour of all things Java and Azure at the modern Microsoft of today. We will first talk about the why, how and what of Java and Microsoft. We will then dive right into the broad range of tools, services and APIs that Microsoft offers around Azure for Java developers. We will show a small but representative demo of a Java application most developers would feel familiar with running well on Azure. Lastly, we will discuss the road map for what Java developers can expect from Microsoft in the future. This session is as much about sharing what Microsoft offers today as it is about listening to what the Java community wants to see from Microsoft tomorrow.","persons":[{"id":792,"full_public_name":"Reza Rahman","abstract":"Reza Rahman is Principal Program Manager for Java on Azure at Microsoft. He works to make sure Java developers are first class citizens at Microsoft and Microsoft is a first class citizen of the Java ecosystem. \r\n\r\nReza has been an official Java technologist at Oracle. He is the author of the popular book EJB 3 in Action. Reza has long been a frequent speaker at Java User Groups and conferences worldwide including JavaOne and Devoxx. He has been the lead for the Java EE track at JavaOne as well as a JavaOne Rock Star Speaker award recipient. Reza is an avid contributor to industry journals like JavaLobby/DZone and TheServerSide. He has been a member of the Java EE, EJB and JMS expert groups over the years. Reza implemented the EJB container for the Resin open source Java EE application server. He helps lead the Philadelphia Java User Group. Reza is proud to be a founding member of the Jakarta EE Ambassadors.","twitter_name":"reza_rahman","avatar_path":"/system/avatars/792/large/reza_passport.jpg?1642707216"}]}],"Cloud Infrastructure":[{"id":6947,"date":"2022-04-13T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Cloud Infrastructure","title":"Java on Kubernetes: What I wish I knew first","track":"Cloud Infrastructure","type":"lecture","abstract":"The Kubernetes ecosystem can be very operator-focussed, and it can be a challenge for developers to distil the information that is relevant for their job.","persons":[{"id":3219,"full_public_name":"Abel Salgado","abstract":"Abel (@abelsromero) works as developer at VMware’s Spring Commercial team, making Kubernetes and Spring integration for APIs nice & easy. That while dealing with personal obsessions with performance, hardware architectures, testing and documentation tools. Outside of work, he is a staff member of Barcelona JUG helping organize JBCNConf in Barcelona, and acts as janitor for the Asciidoctor Maven Plugin.","twitter_name":"abelsromero","avatar_path":"/system/avatars/3219/large/1d6859be425192ab510856e4d568035251e8ccea-medium.png?1631212993"},{"id":2271,"full_public_name":"Alberto C. Ríos","abstract":"Software Engineer interested in building products people love in agile environments with a focus on high-quality tests.","twitter_name":"albertoimpl","avatar_path":"/system/avatars/2271/large/avatar.jpeg?1625123818"}]},{"id":7004,"date":"2022-04-13T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Cloud Infrastructure","title":"Container Usage Patterns","track":"Cloud Infrastructure","type":"lecture","abstract":"Embraced containers yet? If so, that only presents the beginning of the journey. Designing your images to be lean, and your containers configurable requires us to leverage Dockerfiles to their maximum potential. At scale, everything matters—build times, testing, multi-stage builds, conventions around tagging and logging. There is a whole ecosystem of tools around how we can best build our images and containers.\r\n\r\nIn this session we will learn many a trick on how we can leverage Docker's own tooling as well as third-party tools to ensure that our first steps in the container world are the right ones.\r\n\r\n","persons":[{"id":115,"full_public_name":"Raju Gandhi","abstract":"I am a Software Craftsman with over a decade of experience building Web Applications and Enterprise Software and I love to build great software","twitter_name":"looselytyped","avatar_path":"/system/avatars/115/large/me2_400x400.png?1409064068"}]},{"id":6591,"date":"2022-04-13T14:20:00-04:00","start":"14:20","duration":"00:40","room":"Cloud Infrastructure","title":"Prod-like Integration Testing for Cloud-Native Microservices","track":"Cloud Infrastructure","type":"podium","abstract":"In this talk, we will explore Quarkus Dev Services for prod-like integration testing as well as live coding development while developers implement cloud-native microservices for PostgreSQL transactions and Kafka integration automatically with zero configurations.","persons":[{"id":1158,"full_public_name":"Daniel Oh","abstract":"Daniel Oh is a Senior Principal Technical Marketing Manager at Red Hat, a well-known public speaker, open source contributor, published author, and developer advocate. He has more than 20 years of first-hand experience in solving real-world enterprise problems in production environments using cloud-native technologies such as Quarkus, Spring Boot, Node.js, and Kubernetes. He’s also a Cloud Native Computing Foundation (CNCF) ambassador and DevOps Institute ambassador for evangelizing developers and operators in terms of developing cloud-native microservices, designing serverless functions, and deploying them to multi- and hybrid clouds in flexible, easy-to-use, cost-effective, open, and collaborative ways.","twitter_name":"danieloh30","avatar_path":"/system/avatars/1158/large/danieloh.jpeg?1631310503"}]},{"id":6846,"date":"2022-04-13T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Cloud Infrastructure","title":"Configuration as Data, GitOps and multi-cluster: the key to successful service-mesh adoption","track":"Cloud Infrastructure","type":"lecture","abstract":"GitOps is a way to define workflows for declarative configuration using Git and leveraging controllers to reconcile state. If the entire state of a system can be driven from Git, does it matter which controllers exist if the end state eventually converges correctly? It does matter.","persons":[{"id":826,"full_public_name":"Christian Posta","abstract":"Christian Posta (@christianposta) is VP, Global Field CTO at Solo.io. He is well known in the cloud-native community for being an author (Istio in Action, Microservices for Java Developers), blogger, speaker, and open-source contributor to various open-source projects in the service mesh and cloud-native ecosystem.","twitter_name":"christianposta","avatar_path":"/system/avatars/826/large/profile5_(1).jpg?1636986354"}]}],"Architecture":[{"id":6791,"date":"2022-04-13T10:00:00-04:00","start":"10:00","duration":"00:40","room":"Architecture","title":"Zero Trust Architecture","track":"Architecture","type":"lecture","abstract":"Do you know your users, devices, services, data, architecture? Do you have policies to enable accesses? Do you always authorize and authenticate or implicitly trust anyone when accessing your services?  \r\n\r\nCome let us talk about building a resilient and secure organization with Zero trust.","persons":[{"id":1529,"full_public_name":"Sendil Kumar","abstract":"","twitter_name":"sendilkumarn","avatar_path":"/system/avatars/1529/large/sendil.jpeg?1641519219"}]},{"id":6539,"date":"2022-04-13T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Architecture","title":"How does a matching engine work?","track":"Architecture","type":"lecture","abstract":"Electronic exchanges have allowed global markets to become digital. At the heart of an exchange sits a \"matching engine\" application. Being ultimately responsible for connecting buyers and sellers, a matching engine poses difficult technical challenges around latency, high availability, fairness, determinism, auditability, stability, etc. In this presentation we will discuss the journey we traveled to build new matching engines at the Intercontinental Exchange, and how we addressed each of those concerns.","persons":[{"id":1816,"full_public_name":"Juan D Bustamante","abstract":"Juan is a Principal Engineer at the Intercontinental Exchange, responsible for several components of the mission-critical trading system.  \r\n\r\nInfused with the pragmatism of the technology organization at ICE, Juan is a very practical software engineer, always looking for ways to build simpler, easier to understand, easier to maintain apps.  ","twitter_name":"","avatar_path":"/system/avatars/1816/large/jb.jpeg?1570641074"}]},{"id":6540,"date":"2022-04-13T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Architecture","title":"Building a Distributed Datastore in 8 Weeks","track":"Architecture","type":"lecture","abstract":"This past summer, I had the privilege of mentoring 4 university students in a group project. Our mission: to build a distributed datastore over the 8 week summer semester. Starting with a simple CRUD web app, by the end of the summer, the students had built a complex, sophisticated distributed system, with leader election, resilience and health checks. We all - mentor and students - learned a lot of lessons along the way, and not just about distributed systems. This will be an engaging and broad presentation, touching both on the technical challenges of distributed systems, as well as the process of teaching and learning.","persons":[{"id":818,"full_public_name":"Yoel Spotts","abstract":"Yoel Spotts is a Principal Software Engineer at Elastic. Holding degrees in Computer Science and Talmudic Law, he has over 20 years of programming experience. A big fan of the JVM, Yoel has worked in Java, Groovy and Scala. No stranger to DevNexus or public speaking, Yoel attended the very first DevNexus (back before it was called DevNexus) and has presented several times in the past. When not building great software or trying to avoid learning JavaScript, Yoel enjoys hiking and spending time with his family.","twitter_name":"","avatar_path":"/system/avatars/818/large/ys.jpg?1642122988"}]},{"id":7008,"date":"2022-04-13T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Architecture","title":"Software Architecture by Example","track":"Architecture","type":"lecture","abstract":"While many attendees learn from abstract concepts, others prefer to see concepts in action. This session eschews software architecture theory and instead illustrates the process of architecture design using two concrete examples: Silicon Sandwiches and Going, Going, Gone. For each of these problems, Neal shows how:\r\n\r\n1. to determine architecture characteristics\r\n2. to find architecture quanta\r\n3. to scope architecture characteristics\r\n4. to create and iterate on component design\r\narchitecture characteristics & component design leads to architecture style selection\r\n5. to document important architecture decisions\r\n\r\nEach step of the way, the two example problems illuminate the stages of architecture design and the considerations architects must make at each stage.","persons":[{"id":711,"full_public_name":"Neal Ford","abstract":"Neal is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a software company and a community of passionate, purpose-led individuals, delivering technology to address the toughest challenges, all while seeking to revolutionize the IT industry and create positive social change. He speaks at many conferences.\r\n","twitter_name":"neal4d","avatar_path":"/system/avatars/711/large/NF.png?1512951094"}]},{"id":7010,"date":"2022-04-13T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Architecture","title":"Java Design Patterns 2022","track":"Architecture","type":"lecture","abstract":"Since 1994, the original Gang of Four Design Patterns book, “Design Patterns: Elements of Reusable Object-Oriented Software” has helped developers recognize common patterns in development. The book was originally written in C++, but there have been books that translate the original design patterns into their preferred language. One feature of “The Gang of Four Design Patterns” that has particularly stuck with me has been testability for the most part. With the exception of singleton, all patterns are unit testable. Design Patterns are also our common developer language. When a developer says “Let's use the Decorator Pattern” we know what is meant. What's new though is functional programming, we will also discuss how these patterns change in our new modern functional programming world, for example, functional currying in place of the builder pattern.","persons":[{"id":1080,"full_public_name":"Daniel Hinojosa","abstract":"Daniel Hinojosa is a programmer, consultant, instructor, speaker, and author. With over 20 years of experience, he does work for private, educational, and government institutions","twitter_name":"dhinojosa","avatar_path":"/system/avatars/1080/large/kvuYjMde_400x400.jpg?1511203285"}]}],"Agile":[{"id":6790,"date":"2022-04-13T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Agile","title":"Why having your own Mr. Miyagi shouldn’t be luck but a given.","track":"Agile","type":"lecture","abstract":"Mr. Who? Besides one of my childhood heroes, Mr. Miyagi is a fictional karate master from Okinawa, Japan, in the movie series “The Karate Kid”. He was the karate mentor of several people and made them worthy champions. I wanted to be each of those people and then my own karate journey started with my own “sensei\" (mentor). Then I became a lawyer and got a so-called “patroon\" (another mentor). When I took my first steps in my career switch to the IT world, I discovered that mentorship is not a matter of course. What a pity! Fortunately, I managed to find one again. I have experienced the difference of not having and having one, as a difference between day and night.\r\n\r\nI would like to talk about the mentorship’s “what”, “who” and “how”. I would also like to tell you about the importance of mentorship in our field and what it could offer us. In doing so, I want to share my own experiences and opinion about this, and also link this to other examples from practice and preferably also to a piece of available (scientific) research. I think that we as a Java and Developers community, but also as an employer and client, should not want anything else and I would like to tell you why.","persons":[{"id":3363,"full_public_name":"Kelly Jille","abstract":"The lawyer who becomes a Java Software Engineer!","twitter_name":"KellyJille86","avatar_path":"/system/avatars/3363/large/190103_Sogeti_-_Portretfoto_2.jpg?1636918730"}]},{"id":6576,"date":"2022-04-13T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Agile","title":"Measuring the Impact of Software Craft","track":"Agile","type":"lecture","abstract":"At the business level it's hard to effectively measure the quality of software. We start quality initiatives and they don't always work and we're hard press to understand why. Our code coverage went up, our time to market decreased yet we're still finding issues that slow us down. Time To Market is just one aspect of measuring speed.  In this talk tie in delivery techniques to metrics and how business can use these metrics to shape their software craft transformations.","persons":[{"id":1520,"full_public_name":"Ben Scott","abstract":"Ben Scott is a software craft evangelist. He’s led several teams over the years with a big emphasis on changing the delivery mindset to one where quality matters over speed. He has experience in large enterprises, primarily in Fintech but with some exposure to Insuratech. He has also helped startups improve their Time To Market.\r\n\r\nBen now leads the Software Practice for Ippon Technologies, a consulting firm based in Richmond Va with offices in DC and NY City.\r\n","twitter_name":"@bescott1","avatar_path":"/system/avatars/1520/large/profilePic.jpg?1645539126"}]},{"id":6531,"date":"2022-04-13T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Agile","title":"Diagrams as code 2.0","track":"Agile","type":"lecture","abstract":"Learn how to create a coherent collection of software architecture diagrams with the C4 model in conjunction with the free and open source Structurizr DSL.","persons":[{"id":3246,"full_public_name":"Simon Brown","abstract":"Independent Consultant","twitter_name":"simonbrown","avatar_path":"/system/avatars/3246/large/simonbrown.jpg?1634566760"}]},{"id":6580,"date":"2022-04-13T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Agile","title":"Codezillas","track":"Agile","type":"lecture","abstract":"Despite our best efforts, many software projects don’t end with champagne and cake. While some blame a bad technology choice, more often than not, the issues boil down to people problems. Traditional computer science education focuses on algorithms and languages while largely ignoring the human aspect of software and the sociology of organizations. Fear not friends, there are patterns and approaches that can help you win trust quickly, create allies, set expectations and effectively communicate during the ups and downs of project life!","persons":[{"id":3269,"full_public_name":"Whitney Lee","abstract":"Creative and driven, Whitney relatively recently pivoted from an art-related career to one in tech.  She is now a developer advocate at VMware where she puts the fun into cloud FUNdamentals!","twitter_name":"wiggitywhitney","avatar_path":"/system/avatars/3269/large/whitney_Cropped_(1).jpg?1640368558"},{"id":1058,"full_public_name":"Nathaniel Schutta","abstract":"Nathaniel T. Schutta is a software architect focussed on mobile and making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. In an effort to rid the world of bad presentations, Nate coauthored the book Presentation Patterns with Neal Ford and Matthew McCullough.","twitter_name":"ntschutta","avatar_path":"/system/avatars/1058/large/nts_pic_400x400.jpg?1510766283"}]},{"id":7150,"date":"2022-04-13T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Agile","title":"Designing Event-Driven Applications with Apache Flink, Apache Spark and Apache Pulsar","track":"Architecture","type":"lecture","abstract":"This talk is a quick overview of the How, What and WHY of Apache Pulsar, Apache Flink and Apache NiFi.   I will show you how to design event-driven applications that scale the cloud native way.","persons":[{"id":3265,"full_public_name":"Tim Spann","abstract":"Tim Spann is a Developer Advocate for StreamNative. He works with StreamNative Cloud, Apache Pulsar, Apache Flink, Flink SQL, Apache NiFi, MiniFi, Apache MXNet, TensorFlow, Apache Spark, big data, the IoT, machine learning, and deep learning. Tim has over a decade of experience with the IoT, big data, distributed computing, streaming technologies, and Java programming. Previously, he was a Principal DataFlow Field Engineer at Cloudera, a Senior Solutions Architect at AirisData, a Senior Field Engineer at Pivotal and a Team Leader at HPE. He blogs for DZone, where he is the Big Data Zone leader, and runs a popular meetup in Princeton on big data, the IoT, deep learning, streaming, NiFi, the blockchain, and Spark. Tim is a frequent speaker at conferences such as IoT Fusion, Strata, ApacheCon, Data Works Summit Berlin, DataWorks Summit Sydney, and Oracle Code NYC. He holds a BS and MS in computer science.","twitter_name":"paasdev","avatar_path":"/system/avatars/3265/large/ml_tim.jpeg?1648492608"}]}]}},{"index":2,"date":"2022-04-14","day_start":"2022-04-14T06:00:00-04:00","day_end":"2022-04-14T20:00:00-04:00","rooms":{"Unobtanium":[{"id":7088,"date":"2022-04-14T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Unobtanium","title":"The Future is Kube-Native","track":"Unobtanium","type":"lecture","abstract":"We've heard about Cloud and Cloud-Native in the past years, but don't be mistaken: the future is Kube-Native. Kubernetes is an open-source platform that runs everywhere, and ensuring that applications are Kube-Native allows you to reuse your super skills no matter where you deploy.\r\n\r\nJoin us in this session to learn how a common set of best practices regarding patterns and tools can help you solve today's challenging problems in monolithic and microservices architectures.\r\n","persons":[{"id":1389,"full_public_name":"Edson Yanaga","abstract":"Edson Yanaga, Red Hat's Director of Developer Experience, is a Java Champion and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java, Microservices, Cloud Computing, DevOps, and Software Craftsmanship.","twitter_name":"@yanaga","avatar_path":"/system/avatars/1389/large/edson_yanaga.png?1533308310"}]},{"id":6847,"date":"2022-04-14T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Unobtanium","title":"Secure Your Quarkus App!","track":"Unobtanium","type":"lecture","abstract":"So you have quickly built your Quarkus application in no time, but is it secure? Security is usually the thing we implement at the end, even if it's a crucial part of the application.\r\n\r\nThe good news: with Quarkus, adding security and identity management is a breeze. Join me on this 100% live coding session where we explore the different options that Quarkus offers to secure your applications.\r\n\r\nJoin me in this 100% live coding session where we explore the different options that Quarkus offers you to secure your applications.\r\n","persons":[{"id":3366,"full_public_name":"Sébastien Blanc","abstract":"Sébastien Blanc, Red Hat's Director of Developer Experience, is a Passion-Driven Developer with one primary goal: share his passion by giving talks that are pragmatic, fun, and focused on live coding.\r\n\r\n","twitter_name":"sebi2706","avatar_path":"/system/avatars/3366/large/sebi.jpeg?1636984601"}]},{"id":7092,"date":"2022-04-14T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Unobtanium","title":"Cloud Native resiliency patterns from the ground up","track":"Unobtanium","type":"lecture","abstract":"\"Delay is the deadliest form of denial.\" C. Northcote Parkinson. We live in times when an application or service lag of even 2 seconds can be too long. Building a reliable Cloud Native distributed system means preventing failures and minimizing their effects to keep it stable. \r\n\r\nJoin us to explore graceful recovery from unexpected scenarios using live coded examples of the well-known circuit breaker and retry patterns at the application level and complement those in the infrastructure (Kubernetes) with service discovery, load balancing, and load shedding patterns.","persons":[{"id":1879,"full_public_name":"Ana Maria Mihalceanu","abstract":"Ana is a Java Champion, Developer Advocate, co-founder of Bucharest Software Craftsmanship Community, and a constant adopter of challenging technical scenarios involving Java-based frameworks and multiple cloud providers. She is an active supporter of technical communities’ growth through knowledge sharing and enjoys curating content for conferences as a program committee member. ","twitter_name":"@ammbra1508","avatar_path":"/system/avatars/1879/large/amv.jpeg?1570755550"}]},{"id":7089,"date":"2022-04-14T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Unobtanium","title":"Solve your Planning Problems with AI","track":"Unobtanium","type":"lecture","abstract":"Do you have planning or scheduling problems? You're not alone. Luckily, you have an optimized way of solving them. Let's use an open-source engine that supports continuous, non-disruptive, real-time, or over constrained planning: meet OptaPlanner.","persons":[{"id":3358,"full_public_name":"Jason Porter","abstract":"Jason is a software engineer currently working within the Business Process Automation division of Red Hat. He has also worked on Arquillian, Quarkus, and other developer experience projects within Red Hat. He's very interested in the developer experience and helping to improve it in all aspects.","twitter_name":"lightguardjp","avatar_path":"/system/avatars/3358/large/avatar-no-beard.jpg?1636765020"}]},{"id":7096,"date":"2022-04-14T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Unobtanium","title":"Integrating AI/ML into App Development Workflow Made Easy","track":"Unobtanium","type":"lecture","abstract":"Most enterprise developers are familiar with cloud-native journeys with Kubernetes, Microservices, and the Cloud. With the desire to add intelligence to applications, we need to integrate AI/ML into our workflow and even create the machine learning models ourselves.\r\n\r\nJoin us in this session to discuss how you can bring AI/ML development closer to developers and IT professionals. We'll highlight the similarities and differences between AI/ML and application development workflows and show how you can implement both on top of Red Hat OpenShift using the tools and technologies developers already use and love.","persons":[{"id":3429,"full_public_name":"Prasanth Anbalagan","abstract":"Prasanth Anbalagan is a Senior Principal Software Engineer at Red Hat, where he contributes as a subject matter expert on data science workflow, tools, and algorithm implementation.","twitter_name":"prasanthanbalag","avatar_path":"/system/avatars/3429/large/1538939921955.jpeg?1645906637"}]}],"Tools and techniques":[{"id":6479,"date":"2022-04-14T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Tools and techniques","title":"Race between pair programming tools","track":"Tools and techniques","type":"podium","abstract":"During the COVID-19 pandemic, most of us work from home. Pair programming is more difficult when you’re not sitting next to each other in the office. Luckily, there are tools to pair program remotely. In this talk we’ll follow a race between a couple of those tools. May the best tool win!","persons":[{"id":3213,"full_public_name":"Kaya Weers","abstract":"Kaya is a software developer at Ordina who loves innovation and asking 'why?'. She likes to combine creativity and technology to come up with the best solutions. ","twitter_name":"@KayaWeers","avatar_path":"/system/avatars/3213/large/kayaweers_avatar_small.jpg?1649251975"}]},{"id":6476,"date":"2022-04-14T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Tools and techniques","title":"Leverage CompletableFutures to handle async queries.","track":"Tools and techniques","type":"lecture","abstract":"The challenges of developing applications recently have increased. With the popularity of cloud environments, the scalability required by new architectures and the need to support more load efficiently, there has been an increase in attention that we need to pay to concurrency and efficiency.\r\n\r\nOne strategy to achieve that efficiency consists of distributing the modules of your application in several different smaller components running concurrently. But one of the problems that arise from such distribution of running modules comes when you need to send a request (and wait for the response) to several different modules. How do you design that request(s)-response(s) to be as efficient as possible?\r\n\r\nCompletable futures were introduced in Java 8, and they are a powerful mechanism to add concurrency (not parallelism) to your application logic, and it may be handy when dealing with multiple queries to different systems.\r\n\r\nIf you are a developer, you may make your code more performant by using CompletableFutures where it makes sense.\r\n\r\nIf you are a library developer, it may be a good thing to offer an API that returns CompletableFutures so that your users will be able to benefit from it.","persons":[{"id":2709,"full_public_name":"David Gómez García","abstract":"David has been working in Software development for more than 20 years, taking part in projects for different projects in sectors like Banking, Defense, Services & Retail, Maritime and ground transport. Currently is one of the organizers of the Madrid Java User Group and part of the technical committee for Lambda World (a functional programming conference). He was recognized as JavaChampion in January 2020.","twitter_name":"dgomezg","avatar_path":"/system/avatars/2709/large/dgomezg-jc-profile.jpeg?1632908030"}]},{"id":6660,"date":"2022-04-14T13:20:00-04:00","start":"13:20","duration":"00:30","room":"Tools and techniques","title":"Deploy, Release, CI/CD, oh my! ","track":"Tools and techniques","type":"podium","abstract":"While it seems that every week new terms appear to describe DevOps tools, segments, ideas, practices, etc., are they really new? CI/CD, Progressive Delivery, AIOps, GitOps, TreeOps (not real, but who knows, maybe it will be next week?) -  are they all the same, or are they just reimagining last week’s buzz words? In this talk we will break down a few of these terms, what they mean, how they’re used, and why they may matter for you and your teams.","persons":[{"id":3217,"full_public_name":"Jeremy Meiss","abstract":"Jeremy is the Director of DevRel & Community at CircleCI, formerly at Solace, Auth0, and XDA. He is active in the DevRel and DevOps communities, and is a co-creator of DevOpsPartyGames.com. A lover of all things coffee, community, open source, and tech, he is also house-broken, and (generally) plays well with others.","twitter_name":"IAmJerdog","avatar_path":"/system/avatars/3217/large/another_blue.jpg?1645113904"}]},{"id":6848,"date":"2022-04-14T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Tools and techniques","title":"How Do I Build Thee? Let Me Count The Ways!","track":"Tools and techniques","type":"lecture","abstract":"There are many different tools to build container images — Docker, Maven and Gradle plugins, Podman, Buildah, Bazel, Docker-in-Docker, Kaniko, and of course, manually. What are the pros and cons of these tools and how do they actually work? Leave this session with a better understanding of image building and the expertise to confidently choose a build method for your environment.","persons":[{"id":2551,"full_public_name":"Melissa McKay","abstract":"Melissa is a long time developer turned international speaker and is currently a Developer Advocate for JFrog, Inc. Her background and experience as a software engineer spans a slew of technologies and tools used in the development and operation of enterprise products and services. She is a mom, Java Champion, Docker Captain, co-author of the upcoming book DevOps Tools for Java Developers, a huge fan of UNconferences, and is always on the lookout for ways to grow and learn. She has spoken at Kubecon, DockerCon, CodeOne, JFokus, Java Dev Day Mexico, the Great International Developer Summit, and is part of the JCrete and JAlba UNconference teams.","twitter_name":"https://twitter.com/melissajmckay","avatar_path":"/system/avatars/2551/large/20211022_085330_(1).jpg?1636995509"}]},{"id":6517,"date":"2022-04-14T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Tools and techniques","title":"Releasing at the speed of light","track":"Tools and techniques","type":"lecture","abstract":"Automation is the name of the game when it comes to publishing releases. JReleaser is a flexible tool that helps you automate your release process and push it to the next level.","persons":[{"id":2235,"full_public_name":"Ixchel Ruiz ヾ(＾-＾)ノ","abstract":"Ix-chel Ruiz has developed software application & tools since 2000. Her research interests include Java, dynamic languages, client-side technologies and testing. Java Champion, Oracle Developer Champion, hackergarten enthusiast, Open Source advocate, public speaker and mentor.\r\n\r\nThe highest education is that which does not merely give us information but makes our life in harmony with all existence.\r\nRabindranath Tagore","twitter_name":"ixchelruiz","avatar_path":"/system/avatars/2235/large/ir.jpeg?1570642885"},{"id":729,"full_public_name":"Andres Almiray","abstract":"Andres is a Java/Groovy developer and a Java Champion. Founding member of the Griffon framework and Hackergarten community event.","twitter_name":"aalmiray","avatar_path":"/system/avatars/729/large/aalmiray-portrait_3.jpg?1581366279"}]}],"Security":[{"id":6998,"date":"2022-04-14T10:00:00-04:00","start":"10:00","duration":"00:30","room":"Security","title":"Introduction to SLSA framework","track":"Security","type":"lecture","abstract":"Supply chain levels for Software Artifacts (SLSA) is a framework that covers source code to service. With this framework you can measure the levels of software security.","persons":[{"id":3394,"full_public_name":"Veer Muchandi","abstract":"","twitter_name":"veermuchandi","avatar_path":"/system/avatars/3394/large/veer.jpeg?1641519667"}]},{"id":6862,"date":"2022-04-14T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Security","title":"Java and Ransomware - what’s in it for you?","track":"Security","type":"lecture","abstract":"Want to make some money?  A little bitcoin on the side?  In this session we’ll take you through a few of the ways that Ransomware works. ","persons":[{"id":816,"full_public_name":"Steve Poole","abstract":"Steve Poole is a Developer Advocate, DevOps practitioner  and a long time  Java developer, leader and evangelist. He’s been working on Java SDKs and JVMs since Java was less than one year old. ","twitter_name":"spoole167","avatar_path":"/system/avatars/816/large/steve.png?1632196472"}]},{"id":6782,"date":"2022-04-14T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Security","title":"Securing Kubernetes Secrets","track":"Security","type":"lecture","abstract":"Everyone is talking about microservices and serverless architecture and how to deploy them using cluster managers like Kubernetes. But, what about the secrets? The current trend increases the number of secrets required to run our services. This places a new level of maintenance on our security teams. How can we share and manage the secrets(certificates, passwords, SSH, API keys) for our services in this dynamic scenario, where instances are started automatically, where there are multiple instances of the same services for scalability reasons? Are you keeping up?\r\n","persons":[{"id":2581,"full_public_name":"Alex Soto","abstract":"Java Champion, Red Hatter. Speaker, Teacher, CoAuthor of Testing Java Microservice, Quarkus Cookbook, Securing Kubernetes Secrets books.","twitter_name":"@alexsotob","avatar_path":"/system/avatars/2581/large/1517153.jpeg?1599125532"}]},{"id":6867,"date":"2022-04-14T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Security","title":"Getting Started with Spring Authorization Server","track":"Security","type":"lecture","abstract":"The Spring Authorization Server project provides support for OAuth 2.1 Authorization Framework, OpenID Connect Core 1.0 and the numerous extension specifications.\r\n\r\nThe primary goal of this talk is to demonstrate how to securely configure a Spring Authorization Server deployment using identified trust boundaries. The IETF draft, OAuth 2.0 Security Best Current Practice, will be referenced and recommendations will be provided for preventing attacks and implementing mitigations using defense in depth strategies.","persons":[{"id":3373,"full_public_name":"Joe Grandja","abstract":"Joe Grandja is a core committer on the Spring Security team. He has been leading the efforts in building the next generation of OAuth 2 and OpenID Connect support in Spring Security and Spring Authorization Server.","twitter_name":"joe_grandja","avatar_path":"/system/avatars/3373/large/joeg.jpeg?1637010367"}]},{"id":6880,"date":"2022-04-14T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Security","title":"Application Gateway Security: What Developers Really Need to Know","track":"Security","type":"lecture","abstract":"This track provides an in-depth introduction to application gateways and their function in a modern security stack for applications, with an emphasis on the developer’s role in eliminating security vulnerabilities.","persons":[{"id":3276,"full_public_name":"Matthew Close","abstract":"","twitter_name":"","avatar_path":"/system/avatars/3276/large/1610475634962.jpeg?1641519402"}]}],"Practices and other tech":[{"id":6956,"date":"2022-04-14T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Practices and other tech","title":"What's a Pull Request? (Contributing to Open Source) ","track":"Practices and other tech","type":"","abstract":"Perhaps you've asked for a feature for your favorite open source project and been told to submit a pull request. Well, maybe you're thinking, \"What on earth is a pull request!\"  In this topic, we'll discuss common Git workflows and how you can easily contribute by using GitHub to fork a project, make your own changes to it, and offer them back to the community by submitting a pull request.  I’ll also cover how to release your own projects for the community to share.  Then you’ll be the one receiving pull requests!  This talk is for developers who want to help out with their favorite open source project and one-off libraries alike but don’t know where to start.  People who are a little intimidated by GitHub.  Anyone who’s ever mucked around in someone else’s code and found stuff they could improve.\r\n","persons":[{"id":626,"full_public_name":"Brad Wood","abstract":"Brad is a software architect living in Kansas City.  He is an open source enthusiast, developer advocate, and lead developer of the CommandBox CLI project.  He works for Ortus Solutions making open source tools for CFML developers.","twitter_name":"bdw429s","avatar_path":"/system/avatars/626/large/Brad_Wood.jpg?1495654535"}]},{"id":6672,"date":"2022-04-14T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Practices and other tech","title":"Learning Through Tinkering","track":"Practices and other tech","type":"lecture","abstract":"Feeling overwhelmed by the neverending amount of new technologies coming your way? In this talk, we have a look at some strategies on how you can approach this Life Long Learning you signed up for when you entered IT.","persons":[{"id":3327,"full_public_name":"Tom Cools","abstract":"Developer without borders, both geographically and technically. Active as a consultant with a focus on Java technologies.\r\n\r\nNext to that I am a trainer and mentor who loves to share not only knowledge but also passion for our craft. I do this through mentorships (codingcoach.io), guiding students at my alma mater or just helping strangers on Twitter and StackOverflow.","twitter_name":"TCoolsIT","avatar_path":"/system/avatars/3327/large/tomcools-2021-512x.jpg?1636575557"}]},{"id":7087,"date":"2022-04-14T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Practices and other tech","title":"Help Your Boss Help You","track":"Practices and other tech","type":"lecture","abstract":"The conflict between technical professionals and traditional managers is inevitable because each side wants different things. Most employees feel that when conflicts arise with their managers, their only options are either to go along with what the manager wants, or leave. Neither option gets you what you want when you want it. This talk, based on the book of the same name, discusses a third option: how to build a relationship over time that makes your boss want to keep you around and keep you happy. It includes how to push back when your manager makes decisions you don't like, how to provide good enough answers that build a constructive loyalty relationship, how to avoid common mistakes like believing your boss is actually your friend, and more.","persons":[{"id":1078,"full_public_name":"Kenneth Kousen","abstract":"Ken Kousen is a Java Champion, Oracle Groundbreaker Ambassador, and Grails Rock Star, and the author of the books Kotlin Cookbook (O'Reilly), Modern Java Recipes (O'Reilly), Gradle Recipes for Android (O'Reilly), and Making Java Groovy (Manning). He is a regular speaker on the No Fluff, Just Stuff Tour, and teaches training classes in areas related to Java, including Spring, Hibernate/JPA, Groovy, Grails, Gradle, and Android.","twitter_name":"kenkousen","avatar_path":"/system/avatars/1078/large/kousen_sep2019_medium.jpg?1573349579"}]},{"id":6812,"date":"2022-04-14T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Practices and other tech","title":"Buried in Technical Debt?","track":"Practices and other tech","type":"lecture","abstract":"Have you ever taken a shortcut to complete a task, assuring yourself that you would go back and clean it up and do it the right way later when you had the time? In software, this is called “technical debt,” and when it piles up, it can make code hard to read and maintain. Soon enough, the cost to fix these problems can become too high, and convincing your team to take action becomes increasingly difficult. In this talk, we will discuss the different types of technical debt, how to convince other people in the organization of the importance of making regular “minimum payments,” and some creative strategies to keep in mind for software projects with excessive “accrued interest.”","persons":[{"id":3364,"full_public_name":"Chris Stone","abstract":"Chris Stone is a full-stack software engineer with a passion for learning new patterns and languages, solving technical puzzles, and sharing with local software communities. He is a software engineer with experience in team leadership, and he is a proponent of mob programming and test-driven development.","twitter_name":"https://www.twitter.com/chrisstonedev/","avatar_path":"/system/avatars/3364/large/chrisstonedev.jpg?1641530558"}]},{"id":6836,"date":"2022-04-14T15:40:00-04:00","start":"15:40","duration":"00:50","room":"Practices and other tech","title":"Get going with GitOps","track":"Practices and other tech","type":"lecture","abstract":"With the introduction of GitOps workflows into your infrastructure, spinning up exact copies of your application in multiple regions is as easy as git commit and git push. Learn how to extend your GitOps workflow to include policy-as-code and security policies and decisions for these applications can be just as easy. By using Open Policy Agent and Rego to write the policies and security for your application, you can have the same benefits of GitOps for your security policies. ","persons":[{"id":3259,"full_public_name":"Peter ONeill","abstract":"","twitter_name":"peteroneilljr","avatar_path":"/system/avatars/3259/large/peter-headshot-square-small.png?1635142746"}]}],"Keynote Room":[{"id":6827,"date":"2022-04-14T09:00:00-04:00","start":"09:00","duration":"01:00","room":"Keynote Room","title":"Hacking the OSS Supply Chain","track":"Keynote","type":"lecture","abstract":"Developers depend upon an ecosystem of open-source technologies that fuel innovation and decrease time to market. A typical business application is composed of >80% open source code, so what happens when the open source software supply chain gets hacked and thousands of enterprises are left exposed to potentially devastating security exploits. The SolarWinds hack is just the tip of the iceberg on a much larger security concern that spans the industry affecting all programming languages, platforms, and cloud services. In this keynote we will expose security holes and exploits in the open source ecosystem as well as propose a system for securing the software supply chain at a fundamental level.","persons":[{"id":1460,"full_public_name":"Stephen Chin","abstract":"Stephen Chin is VP of Developer Relations at JFrog, chair of the CDF governing board, member of the CNCF governing board, and author of The Definitive Guide to Modern Client Development, Raspberry Pi with Java, Pro JavaFX Platform, and the upcoming DevOps Tools for Java Developers title from O'Reilly. He has keynoted numerous conferences around the world including swampUP, Devoxx, JNation, JavaOne, Joker, and Open Source India. Stephen is an avid motorcyclist who has done evangelism tours in Europe, Japan, and Brazil, interviewing hackers in their natural habitat. When he is not traveling, he enjoys teaching kids how to do embedded and robot programming together with his daughters.","twitter_name":"steveonjava","avatar_path":"/system/avatars/1460/large/2018-steveonjava-portrait.jpg?1574718192"}]},{"id":7121,"date":"2022-04-14T12:20:00-04:00","start":"12:20","duration":"01:00","room":"Keynote Room","title":"Lunch Break II","track":"admin","type":"other","abstract":"Lunch Break II","persons":[]},{"id":7122,"date":"2022-04-14T16:40:00-04:00","start":"16:40","duration":"00:20","room":"Keynote Room","title":"Raffle and conf close","track":"admin","type":"other","abstract":"Raffle and conf close","persons":[]}],"Foyer":[{"id":7116,"date":"2022-04-14T11:00:00-04:00","start":"11:00","duration":"00:20","room":"Foyer","title":"Morning Break 1a","track":"admin","type":"other","abstract":"Morning Break 1a","persons":[]},{"id":7119,"date":"2022-04-14T15:20:00-04:00","start":"15:20","duration":"00:20","room":"Foyer","title":"Afternoon Break 2b","track":"admin","type":"other","abstract":"Afternoon Break 2b","persons":[]},{"id":7124,"date":"2022-04-14T19:30:00-04:00","start":"19:30","duration":"02:00","room":"Foyer","title":"Conference After Party (Midtown Atlanta Location TBD)","track":"admin","type":"other","abstract":"Conference After Party","persons":[]}],"Web and Front-end":[{"id":6802,"date":"2022-04-14T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Web and Front-end","title":"Typescript for the busy Java developer","track":"Web and Front-end","type":"lecture","abstract":"Even if you haven't used Javascript, you have probably heard scary stories about an inconsistent language, with no type system, that is used by almost every single modern web application that runs in your browser. What if I tell you that it is also used for backend services! Oh, the horror! As a Java backend developer, that idea gives me the chills. Typescript to the rescue! Typescript is a modern language developed by Microsoft that's built on top of Javascript, adding additional syntax, tooling and most importantly, a type system! This talk provides an introduction to the language, we'll explore some similarities and differences with Java through code examples!","persons":[{"id":2215,"full_public_name":"Orlando Valdez","abstract":"Orlando has been solving (and creating) problems with the help of technology for more than 15 years. He currently works at Credit Karma, co-leads the Charlotte JUG, occasional speaker, husband and father, retro gamer and in a constant learning state.","twitter_name":"@orlandovaldez_","avatar_path":"/system/avatars/2215/large/DSC_1505_3s.jpg?1565826696"}]},{"id":6913,"date":"2022-04-14T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Web and Front-end","title":"Understanding Alexa","track":"Web and Front-end","type":"lecture","abstract":"This session will unpack how Amazon's Alexa works, how you think about building voice user interfaces, and which best practices you should consider as you build skills.","persons":[{"id":3381,"full_public_name":"Jeff Blankenburg","abstract":"Jeff Blankenburg is the Chief Technical Evangelist for Amazon Alexa.","twitter_name":"@jeffblankenburg","avatar_path":"/system/avatars/3381/large/bzNNtRGZ_400x400.jpeg?1645641606"}]},{"id":6788,"date":"2022-04-14T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Web and Front-end","title":"Making A Strong Case For Accessibility","track":"Web and Front-end","type":"podium","abstract":"Accessibility is often overlooked or bolted on to the end of a project from the experiences in Todd’s career in web development and design. ","persons":[{"id":3353,"full_public_name":"Todd Libby","abstract":"Todd is an Accessibility Engineer for WebstaurantStore, is also a member of the W3C, produces and hosts the Front End Nerdery Podcast, and is a front end developer and backend developer of over twenty years as well. ","twitter_name":"@toddlibby","avatar_path":"/system/avatars/3353/large/ToddLibby_300x300.jpg?1636741472"}]},{"id":6472,"date":"2022-04-14T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Web and Front-end","title":"May JavaFX be with you...always","track":"Web and Front-end","type":"lecture","abstract":"JavaFX is powerful, believe it or not and in this session I will try to share some tips and tricks that might\r\nhelp you creating your own JavaFX based apps. I will cover things like styling a JavaFX app using CSS, let you know\r\nwhen it makes sense to use the JavaFX Canvas node, why you really should learn how to use a vector drawing program.\r\nIn addition you will learn how easy it is to make your JavaFX application not only run on your desktop machine but also\r\non mobile devices or even on the browser...without using a plugin.\r\nSo if you are curious and would like to learn more about JavaFX...listen...and learn...","persons":[{"id":3193,"full_public_name":"Gerrit Grunwald","abstract":"Gerrit loves coding, esp. in Java(FX) and is big fan of open source.","twitter_name":"@hansolo_","avatar_path":"/system/avatars/3193/large/gerrit.jpeg?1643385143"}]},{"id":6570,"date":"2022-04-14T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Web and Front-end","title":"Single Page Apps in a Microservice Architecture","track":"Web and Front-end","type":"lecture","abstract":"Single-page applications (SPAs) don't have to be incompatible with microservice architectures.","persons":[{"id":1651,"full_public_name":"Zachary Klein","abstract":"Web Developer, OSS Contributor, 2GM (Groovy, Grails, Micronaut) Team Member.","twitter_name":"ZacharyAKlein","avatar_path":"/system/avatars/1651/large/zach.jpeg?1641519284"}]}],"Java Platform":[{"id":6941,"date":"2022-04-14T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Java Platform","title":"Getting Caught up with Kotlin","track":"Java Platform","type":"lecture","abstract":"Kotlin is one of the industry's newest darlings.  It's sleek.  It's succinct.  It's seemingly everywhere these days.  It gets crazy amounts of hype but is it worth it?  I say yes, of course, but it's actually easy to find out for yourself!  This talk will go over the basics of the syntax and show scads of examples of how Kotlin can make your life easier.  And it's not just for mobile development!  We'll look, briefly, at a number of preexisting libraries that have nothing to do with mobile dev that you can use today in whatever project you have in mind.  Curious about Kotlin?  Come join the journey and find out more!","persons":[{"id":912,"full_public_name":"Justin Lee","abstract":"Justin Lee is Principal Software Engineer at Red Hat, a Java Champion, a Kotlin fanatic, and has been programming in Java since 1996.  He has worked on virtually every level of the application stack from database drivers all the way to application servers and front end interfaces.  A long time advocate of Java and Kotlin, he has spoken at conferences and user groups all across the US and Europe.  He is an active open source community member contributing when and where he can. He can be found on twitter and github as @evanchooly.","twitter_name":"evanchooly","avatar_path":"/system/avatars/912/large/Profile_-_big.jpg?1637720340"}]},{"id":6527,"date":"2022-04-14T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Java Platform","title":"The Future is Reactive","track":"Java Platform","type":"lecture","abstract":"Spring 5 and Java 9+ have started to embrace reactive programming which means engineers will soon have to understand when and how to use non-blocking code and reactive streams. The future of Java and Spring is becoming more and more reactive programming and this talk will cover the basics of reactive programming with Java 11+, Spring 5, and Reactor Core for engineers who have yet to dive deep into reactive programming.","persons":[{"id":844,"full_public_name":"Cecili Reid","abstract":"Cecili Reid is a Senior Software Engineer at Netflix working in Content Acquisition and Finance Engineering. Outside of work, Cecili uses her engineering skills to learn new languages and technologies to work on side projects and share what she has learned with others through public speaking and development of LinkedIn Learning courses.","twitter_name":"@cecili_reid","avatar_path":"/system/avatars/844/large/creid.jpeg?1570643629"}]},{"id":6503,"date":"2022-04-14T13:20:00-04:00","start":"13:20","duration":"00:50","room":"Java Platform","title":"Migrating from Imperative to Reactive","track":"Java Platform","type":"lecture","abstract":"While Reactive Programming is very different from the usual Imperative way, there’s no denying it fits “the Cloud”, as every bit of resource is used to its fullest. Let’s see how to migrate from the latter to the former using a Spring Boot web app as an example.","persons":[{"id":1023,"full_public_name":"Terry Walters","abstract":"Terry Walters is a Senior Solution Architect at Hazelcast, a Java-based, open-source operational in-memory computing platform. He is a speaker at local user groups.  He enjoys helping others succeed with web scale. His employment includes many industry leaders such as AT&T, Verizon, McKesson, UPS, and the formally known as BEA Systems. Walters holds a bachelor's degree in computer science.","twitter_name":"@terrymwalters","avatar_path":"/system/avatars/1023/large/headshot.png?1647460304"}]},{"id":6900,"date":"2022-04-14T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Java Platform","title":"Take a walk on the Client Side","track":"Java Platform","type":"lecture","abstract":"In this talk, we'll take a walk on the client side: we'll explore how you can use JBang, Quarkus command-mode, client-oriented extensions, and straight-up Java goodness to create badass native command-line apps that can do all the things.","persons":[{"id":1876,"full_public_name":"Erin Schnabel","abstract":"Erin Schnabel (@ebullientworks) is a Java Champion, developer, advocate, and maker of things at Red Hat. She has 20 years under her belt, as a developer, technical leader, architect and evangelist, and she strongly prefers being up to her elbows in code. Erin learns (and teaches) by coding ridiculous things, like \"Monster Combat\", an application that makes monsters fight each other to explore application metrics; “Game On!” (https://gameontext.org), a text adventure game for microservices; and a reactive workshop (https://github.com/IBM/reactive-code-workshop) that munges \"The Jabberwocky\" to gain an understanding of how reactive operators work.","twitter_name":"ebullientworks","avatar_path":"/system/avatars/1876/large/es.jpeg?1570642569"}]},{"id":6712,"date":"2022-04-14T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Java Platform","title":"JOOQ: Data abstractions without distraction","track":"Java Platform","type":"lecture","abstract":"When writing any non-trivial application, database access is a must, and there's a myriad of options for abstracting away the database. For many of those, though, you get abstractions at the cost of transparency. \"Why did JPA generate that query?\" \"Why isn't this join working?\" \"Why isn't the query executing?\" Fortunately, there _is_ a library that gives you full access to the power and flexibility of SQL while also you giving you Java-friendly APIs. Type-safe queries? ✓ Executing stored procedures? ✓ ActiveRecords? ✓ All of this and more is possible using JOOQ. In this session, we'll see how to get started with JOOQ, take a quick survey of its features, and end with a demo application letting JOOQ sell itself.","persons":[{"id":3345,"full_public_name":"Jason Lee","abstract":"I am a Principal Software Engineer at Red Hat working on the WildFly/EAP team.","twitter_name":"jasondlee","avatar_path":"/system/avatars/3345/large/New_Profile_Pic.jpg?1636731256"}]}],"Frameworks":[{"id":6478,"date":"2022-04-14T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Frameworks","title":"Jakarta EE 10 and Beyond","track":"Frameworks","type":"","abstract":"All you need to know about Jakarta EE 10 and what to expect going forward!","persons":[{"id":798,"full_public_name":"Ivar Grimstad","abstract":"Java Champion, JUG Leader, JCP Spec Lead, EC and EG Member, Jakarta EE WG, EE4J PMC, Oracle Developer Champion, Speaker, The guy with the Duke tattoo...","twitter_name":"ivar_grimstad","avatar_path":"/system/avatars/798/large/ivar_jc_982_988.png?1625119757"}]},{"id":6933,"date":"2022-04-14T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Frameworks","title":"Bootiful GraalVM","track":"Frameworks","type":"lecture","abstract":"Hi, Spring fans! Spring Framework 6 and Spring Boot 3 imply a new baseline, bringing the Spring ecosystem in line with the needs of tomorrow's workloads. A huge part of that is the new baselines of Jakarta EE and Java 17 and the new support for GraalVM native images, based on the work of Spring Native. Join me, Spring Developer Advocate Josh Long, and we'll explore the implications of this exciting new technology for your Spring Boot applications and services. ","persons":[{"id":1669,"full_public_name":"Josh Long","abstract":"Josh (@starbuxman) is the Spring Developer Advocate at Pivotal. Josh is a Java Champion, author of 5 books (including O'Reilly's Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry) and numerous best-selling video trainings (including Building Microservices with Spring Boot Livelessons with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring Integration, Spring Cloud, Activiti and Vaadin). \r\n","twitter_name":"starbuxman","avatar_path":"/system/avatars/1669/large/professional-studio-shoot-by-richard-october-2018.jpg?1539382905"}]},{"id":6859,"date":"2022-04-14T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Frameworks","title":"Micronaut and GraalVM Native Image","track":"Frameworks","type":"lecture","abstract":"Create Micronaut applications and use GraalVM Native Image for fast startup and low resource usage","persons":[{"id":3370,"full_public_name":"Burt Beckwith","abstract":"Micronaut Developer at Oracle Labs","twitter_name":"burtbeckwith","avatar_path":"/system/avatars/3370/large/burt.beckwith.jpg?1637002438"}]},{"id":6692,"date":"2022-04-14T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Frameworks","title":"Jakarta EE and MicroProfile Highlights","track":"Frameworks","type":"lecture","abstract":"Learn important features for development of Jakarta EE and MicroProfile applications through a number of examples in action, using a hands on approach. This presentation will showcase a number of Jakarta EE and MicroProfile Specifications which have had more recent changes. The examples will demonstrate a variety of features from Jakarta Server Faces to Jakarta Persistence to MicroProfile Config and MicroProfile Fault Tolerance. These examples will be run in production-like projects that can be used to  construct and run microservices that work together using Payara Micro and Docker. \r\n\r\nAttendees will walk away with a solid understanding of some of the most important features of Jakarta EE and MicroProfile and how they perfectly fit in microservices development.","persons":[{"id":3192,"full_public_name":"Edwin Derks","abstract":"Edwin Derks is a Java Champion and Principal Software Architect with Ordina. He has a passion for gathering and sharing knowledge about anything related to the Java ecosystem and cloud-driven development in general. He is a contributor for MicroProfile and Jakarta EE, and often hosts meetups, writes articles, blogs and speaks at conferences. In his spare time, he can often be found in the gym or having a good time at metal concerts.","twitter_name":"@edwinderks","avatar_path":"/system/avatars/3192/large/edwin.jpg?1641542299"}]},{"id":6794,"date":"2022-04-14T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Frameworks","title":"MicroProfile - The Current and The Future","track":"Frameworks","type":"lecture","abstract":"With the new release of MicroProfile 5.0, MicroProfile will support Jakarta namespace and work with Jakarta EE 9.1. With this foundation, MicroProfile is going to focus on more innovations such as data access, OpenTelemetry, Micrometer in 2022. In this session, Emily is going to bring you up to date with the latest MicroProfile release and then briefly discuss the future roadmap for MicroProfile. Come along to listen in or ask questions.","persons":[{"id":817,"full_public_name":"Emily Jiang","abstract":"Emily Jiang is a Java Champion. She is Liberty Cloud Native Architect and Chief Advocate, STSM in IBM, based at Hursley Lab in the UK. Emily is a senior MicroProfile lead and has been working on MicroProfile since 2016 and leads the specifications of MicroProfile Config, Fault Tolerance and Service Mesh. She is CDI Expert Group member.\r\n\r\nShe has worked on the WebSphere Application Server since 2006 and is heavily involved in Java EE and MicroProfile implementation in Liberty releases. \r\n\r\nShe regularly speaks at conferences, such as Code One, DevNexus, JAX London, Voxxed, Devoxx US, Devoxx Belgium, Devoxx UK, Devoxx France, EclipseCon, etc. Follow her on Twitter @emilyfhjiang and/or connect with her on LinkedIn (https://www.linkedin.com/in/emilyfhjiang)\r\n","twitter_name":"emilyfhjiang","avatar_path":"/system/avatars/817/large/Emily-photo.png?1565795958"}]}],"Core Java":[{"id":7011,"date":"2022-04-14T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Core Java","title":"Java 17's Project Panama 4 Newbies","track":"Core Java","type":"lecture","abstract":"As a Java developer, you may have a need to access native libraries, such as Tensorflow, SqlLite, ffmpeg, OpenGL, but later find that JNI is your default choice. JNI (Java Native Interface) requires native code to be installed. You’ll quickly find that JNI wrapper code is difficult to maintain.\r\nNew to OpenJDK 17 is the Foreign Linker API (JEP 412) as a replacement or alternative for JNI to provide a pure-Java solution and perform comparable to, or better than, JNI.\r\nThe aim of this talk is to help you be proficient at creating Java programs capable of accessing devices and/or native libraries mainly focussing on OpenJDK 17’s Foreign Linker API.\r\n- Intro (what, why, where)\r\n- Requirements\r\n- IDE, environment setup\r\n- Getting started\r\n- Anatomy of a Hello World in C\r\n- What is jextract\r\n- Panama Hello World in Java\r\n- How to allocate memory to work with C primitives, arrays, & C strings.\r\n- How to allocate and mimic pointers, structs, and array of structs.\r\n- What are VarHandles?\r\n- What are MethodHandles?\r\n- Using super powers to access system libraries\r\n- Using super powers to access third party libraries (demos)\r\nDemos may include: OpenGL, Tensorflow, Git, ffmpeg, Python, Rust, Swift, MacOS touchID,\r\nMacOS SpeechSynthesizer.","persons":[{"id":3218,"full_public_name":"Carl Dea","abstract":"Carl Dea is a Sr. developer advocate at AzulSystems inc. He has authored Java books and has been developing software for 20+ years with many clients, from Fortune 500 companies to nonprofit organizations. He has written software ranging from mission-critical applications to e-commerce applications. Carl has been using Java since the very beginning (when Applets were cool) and is a JavaFX enthusiast (fanboy) dating back to when it used to be called F3/JavaFX Script. He greatly loves sharing and advocating Java based technologies.","twitter_name":"carldea","avatar_path":"/system/avatars/3218/large/profile_cdea.png?1643126437"}]},{"id":7012,"date":"2022-04-14T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Core Java","title":"Amber - not just a rare fossil","track":"Core Java","type":"","abstract":"Project Amber was created to add productivity enhancements and features to the Java language. Several features have already been delivered via this project. This talk focuses on features both delivered and planned.\r\n\r\nThis talk will focus on what as delivered via Project Amber, and some features that are on hold that can add exciting new productivity features to the Java language.\r\n\r\nCode examples of each will be included in the presentation that is conducted via an IDE.","persons":[{"id":879,"full_public_name":"Chandra Guntur","abstract":"Chandra Guntur is a Distinguished Engineer in Java Platform Engineering at BNY Mellon. Chandra is a technologist in the financial services industry since 2003 and is programming with Java since 1998. He is one of the representatives for BNY Mellon in the Java Community Process (JCP) Executive Committee. He is a Java Champion and a Java User Group (JUG) Leader, and helps run one of the largest Java user groups, NYJavaSIG (New York Java Special Interest Group). Chandra is also responsible for running the NYJavaSIG Hands-On-Workshops (HOW), conducting code workshops and Code Katas on core Java features. He is a frequent speaker at Java meetups, user groups, and tech. conferences including Oracle CodeOne, Oracle Code NY, QCon New York, Devnexus, DawsCon and GIDS India.","twitter_name":"@CGuntur","avatar_path":"/system/avatars/879/large/ChandraProfile_HighRes.png?1564850042"}]},{"id":6890,"date":"2022-04-14T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Core Java","title":"Beyond JUnit - Pragmatic Ways to Increase Code Quality","track":"Core Java","type":"lecture","abstract":"You and your team are writing and running unit tests - great! Better yet, they pass (most of the time)! But can you do more to ensure the quality of your code? Come to this talk where you will learn some practical new skills to help increase the quality of your code and catch bugs early in the development cycle. This will be a balanced look at different testing styles and tools. At the end of this talk, you will have several new techniques to bring to your codebase that will ultimately make your customers happy. This talk is aimed at Java developers who have some basic testing knowledge and want to move to the next level.","persons":[{"id":1489,"full_public_name":"Todd Ginsberg","abstract":"Todd Ginsberg is a Principal Software Developer at Netspend, a payments company in Austin, TX where he is responsible for prototypes, experiments, and proofs of concept. Todd has been writing in Java since 1995, Kotlin since 2016, and helps organize the Triangle JUG and the Greensboro JUG. He lives in Raleigh, NC with his wife, daughter, and two dogs. When not programming, he enjoys reading, walking/hiking, and doughnuts.","twitter_name":"toddginsberg","avatar_path":"/system/avatars/1489/large/KCDCportraits0119_3KVersion.jpg?1642020298"}]},{"id":6886,"date":"2022-04-14T14:20:00-04:00","start":"14:20","duration":"00:30","room":"Core Java","title":"Pattern Matching for Java","track":"Core Java","type":"lightning_talk","abstract":"Pattern Matching is already known to Java Developers. Over the time, Java language has expanded its pattern matching capabilities from just matching strings to matching object types. Introduction of Records and Sealed Classes in previous Java versions is just part of the story. In this talk, we will discuss the need and usage of Pattern Matching. We will uncover this feature which is going to be most helpful to developers going forward. ","persons":[{"id":2773,"full_public_name":"Neha Sardana","abstract":"Neha Sardana is a Software Developer for Java based applications for over a decade.\r\n\r\nShe is currently Vice President at Morgan Stanley and JUG (Java User Group) Leader for Garden State JUG, New Jersey and NYJavaSIG, New York. She has worked in financial services for almost 10 years in both Europe and the US.\r\n\r\nShe is a technologist and an OSS enthusiast and loves to talk and blog about all things open source.","twitter_name":"@nehasardana09","avatar_path":"/system/avatars/2773/large/Neha-Sardana.jpeg?1624291499"}]}],"Cloud Technology":[{"id":6860,"date":"2022-04-14T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Cloud Technology","title":"Bootiful Edge Services","track":"Cloud Technology","type":"lecture","abstract":"Hi, Spring fans! So much of the difficulty of microservices is not the services themselves, but the clients that connect to them. There are just so many things that can go wrong or cause bumps on the road to production! Clients may not speak the same protocols as the services to which they're connecting. Clients may need to adapt the data coming from services to suit their use cases, tailoring them to the user interface's particular requirements. Join me, Spring Developer Advocate Josh Long (@starbuxman) and we'll look at how to use reactive programming to build better API adapters, how to use Spring GraphQL to build better data integration gateways, and we'll look at Spring Cloud Gateway to build API gateways.\r\n\r\n","persons":[{"id":1669,"full_public_name":"Josh Long","abstract":"Josh (@starbuxman) is the Spring Developer Advocate at Pivotal. Josh is a Java Champion, author of 5 books (including O'Reilly's Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry) and numerous best-selling video trainings (including Building Microservices with Spring Boot Livelessons with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring Integration, Spring Cloud, Activiti and Vaadin). \r\n","twitter_name":"starbuxman","avatar_path":"/system/avatars/1669/large/professional-studio-shoot-by-richard-october-2018.jpg?1539382905"}]},{"id":6765,"date":"2022-04-14T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Cloud Technology","title":"The hidden gems of distributed tracing","track":"Cloud Technology","type":"lecture","abstract":"When building distributed systems, we aim to get a macro view and be able to zoom in when a particular component seems to be at fault for a failure. Luckily, distributed tracing captures the detailed execution of causally-related activities performed by the elements of a distributed system as it processes a given request.\r\n\r\nIf you wonder how different the execution of the requests from the system's expected behavior was, join my session to learn how to recognize trace patterns, determine the bottlenecks when a request is too slow, and deal with oversampling or traffic labeling in production.","persons":[{"id":1879,"full_public_name":"Ana Maria Mihalceanu","abstract":"Ana is a Java Champion, Developer Advocate, co-founder of Bucharest Software Craftsmanship Community, and a constant adopter of challenging technical scenarios involving Java-based frameworks and multiple cloud providers. She is an active supporter of technical communities’ growth through knowledge sharing and enjoys curating content for conferences as a program committee member. ","twitter_name":"@ammbra1508","avatar_path":"/system/avatars/1879/large/amv.jpeg?1570755550"}]},{"id":6697,"date":"2022-04-14T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Cloud Technology","title":"Divide and Conquer: Send Forth the Microservices","track":"Cloud Technology","type":"lecture","abstract":"Most developers have dealt or are dealing with monoliths. What if we could swap the fortress for battle units to improvise, adapt, and overcome their enemies? This session will use live demos to take you from Level 1 Sorcerer to Level 20 with basics of microservice chatter to whole pipeline.","persons":[{"id":1185,"full_public_name":"Jennifer Reif","abstract":"Jennifer Reif is an avid developer and problem-solver. She holds a Master’s degree in Computer Management and Information Systems and has worked with large enterprises to organize and make sense of widespread data assets and leverage them for maximum business value. She has worked with a variety of commercial and open source tools and enjoys learning new technologies, sometimes on a daily basis! Her passion is finding ways to organize chaos and deliver software more effectively.","twitter_name":"@JMHReif","avatar_path":"/system/avatars/1185/large/Bio_pic_presenting_crop.jpg?1543263561"}]},{"id":6870,"date":"2022-04-14T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Cloud Technology","title":"(Mis)Understanding Cloud-Native","track":"Cloud Technology","type":"lecture","abstract":"Cloud is great and cloud-native is really nice. However, we are often met with some misconceptions and terms that are being thrown around. In this session we will try to bust a few myths about cloud-native development and help to develop better and more modern applications.","persons":[{"id":1879,"full_public_name":"Ana Maria Mihalceanu","abstract":"Ana is a Java Champion, Developer Advocate, co-founder of Bucharest Software Craftsmanship Community, and a constant adopter of challenging technical scenarios involving Java-based frameworks and multiple cloud providers. She is an active supporter of technical communities’ growth through knowledge sharing and enjoys curating content for conferences as a program committee member. ","twitter_name":"@ammbra1508","avatar_path":"/system/avatars/1879/large/amv.jpeg?1570755550"},{"id":905,"full_public_name":"Rustam Mehmandarov","abstract":"Passionate computer scientist. A Java Champion and Google Developers Expert (GDE) for Cloud. JavaOne Rockstar. Public speaker. Ex-leader of JavaZone and Norwegian JUG – javaBin.","twitter_name":"@rmehmandarov","avatar_path":"/system/avatars/905/large/rustam.jpg?1597424794"}]},{"id":6884,"date":"2022-04-14T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Cloud Technology","title":"I'm Tracing you!","track":"Cloud Technology","type":"lecture","abstract":"Learn about Distributed Tracing and OpenTelemetry to track your application.","persons":[{"id":2247,"full_public_name":"Roberto Cortez","abstract":"Passionate Developer, Blogger, Youtuber, Speaker, Triber, JUG Leader, Java Champion","twitter_name":"radcortez","avatar_path":"/system/avatars/2247/large/radcortez-high.jpg?1565911635"}]}],"Cloud Infrastructure":[{"id":6523,"date":"2022-04-14T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Cloud Infrastructure","title":"DevOps for Java Shops","track":"Cloud Infrastructure","type":"lecture","abstract":"DevOps is great, if you have the people, processes and tools to support it. In this session I’ll highlight the easiest ways for Java developers to work with their IT organizations and partners to deliver their code to the cloud, including the best ways to reliably make updates and maintain production cloud code. The focus is on real-world examples using Linux command line tools, open source tools including Jenkins, and other free SDKs and tools available on GitHub. ","persons":[{"id":737,"full_public_name":"Brian Benz","abstract":"Brian is a Senior Developer Advocate at Microsoft, helping Java developers to get the most out of Azure. Before Joining Microsoft, he was a solution architect, consultant, developer, author and presenter at IBM, Deloitte, and other companies. Find him on Twitter @bbenz.","twitter_name":"bbenz","avatar_path":"/system/avatars/737/large/Brian_Benz.jpg?1550945203"}]},{"id":6965,"date":"2022-04-14T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Cloud Infrastructure","title":"Spring Cloud Gateway Recipes","track":"Cloud Infrastructure","type":"lecture","abstract":"Spring Cloud Gateway is a developer-centric API gateway. An API gateway is an abstraction over a distributed systems architecture. The API Gateway is a natural place to provide cross-cutting concerns such as security, resiliency, and transformation. In this talk, we will discuss practical use cases that you may encounter. Some recipes we will discuss include: securing gateway with OAuth 2 and Spring Security and relaying tokens to services, rate-limiting using Spring Security and the logged-in user, implementing a backed-for-frontend using a scatter-gather technique and more.","persons":[{"id":1182,"full_public_name":"Spencer Gibb","abstract":"Spencer Gibb is a Software Engineer at VMware where he is the co-founder and lead of the Spring Cloud Core projects. He is a husband, father, and geek.","twitter_name":"spencerbgibb","avatar_path":"/system/avatars/1182/large/Spencer_Gibb_Headshot_-_Square_-_Hi_Res.jpg?1538405673"}]},{"id":6735,"date":"2022-04-14T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Cloud Infrastructure","title":"Brewing the Best of All Worlds","track":"Cloud Infrastructure","type":"lecture","abstract":"In this session, learn how to leverage proven patterns & open source software to rapidly build a robust portfolio of microservices that provide a solid foundation for your dynamic and growing microservice architecture, then learn how to make the cloud do it for you with tools that support and enable those proven patterns.","persons":[{"id":1181,"full_public_name":"Mark Heckler","abstract":"Mark Heckler is a software developer & Principal Cloud Developer Advocate for Java/JVM Languages at Microsoft, conference speaker, Java Champion, and Kotlin Developer Expert focused on developing innovative production-ready software at velocity for cloud and edge computing platforms. He has worked with key players in numerous industries and public sector organizations to develop and deliver critical capabilities on time and on budget. Mark is an open source contributor and author of Spring Boot: Up and Running (https://bit.ly/springbootbook) and can be found on Twitter @mkheck.","twitter_name":"@mkheck","avatar_path":"/system/avatars/1181/large/MarkHeckler2019Jpg.jpg?1599511252"}]},{"id":6969,"date":"2022-04-14T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Cloud Infrastructure","title":"Closing the Developer Experience Gap in the Kubernetes Ecosystem","track":"Cloud Infrastructure","type":"lecture","abstract":"In the fall of 2020, Stephen O'Grady of RedMonk wrote about <a href=\"https://redmonk.com/sogrady/2020/10/06/developer-experience-gap/\">The Developer Experience Gap</a>. He described how on one hand developers have access to \"any infrastructure primitive they could possibly want\" but on the other hand they are left with the problem of getting them to \"play nicely together\". This paradox resonates for any developer building solutions for the cloud today but seems even further amplified in the Kubernetes ecosystem. In this session we will explore some of the powerful open source technologies available to developers within that ecosystem but with a particular focus on closing the developer experience gap.","persons":[{"id":1161,"full_public_name":"Mark Fisher","abstract":"Mark is a Senior Staff Engineer at VMware and the tech lead for application team experiences on Tanzu. He spent more than a decade on the Spring team, where he started the Spring Integration project and contributed to the core Spring Framework and several Spring Cloud projects. Then in 2017 Mark shifted focus to Serverless Functions and Kubernetes as a platform for building an application platform while continuing to apply the principles behind Spring, such as Inversion of Control and Separation of Concerns.","twitter_name":"@m_f_","avatar_path":"/system/avatars/1161/large/mf.jpg?1516131267"}]},{"id":6639,"date":"2022-04-14T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Cloud Infrastructure","title":"Observability: Beyond the three pillars with Spring","track":"Cloud Infrastructure","type":"lecture","abstract":"Is Observability really just logging, metrics, and distributed tracing? Are we done? Mission accomplished? Can we go home for the week even if it is just Tuesday?\r\nYou can often hear about the \"Three Pillars of Observability\" but having access to logs, metrics, and traces does not necessarily mean more observable systems. In this forward-looking presentation, you'll learn what Observability is, what problems the three pillars solve, what problems they generate, and how deep the rabbit hole goes behind them.\r\n","persons":[{"id":2658,"full_public_name":"Jonatan Ivanov","abstract":"Jonatan Ivanov is an enthusiastic Software Engineer, member of the Spring Engineering Team, speaker, author, certified dragon trainer.\r\n\r\nHe has hands-on experience in developing and shipping innovative, production-ready software for industry-leader companies. He likes Distributed Systems, Production, Open Source, Math, Linux, Cloud environments; he is passionate about the Java Ecosystem and the Java Community.\r\n\r\nHe is an Open Source contributor, writes a \"develotters\"-focused blog (https://develotters.com) and sometimes can be found on Twitter(https://twitter.com/jonatan_ivanov).","twitter_name":"@jonatan_ivanov","avatar_path":"/system/avatars/2658/large/IMG_2034_1x1crop_512.jpg?1641534145"}]}],"Architecture":[{"id":6530,"date":"2022-04-14T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Architecture","title":"The lost art of software design","track":"Architecture","type":"lecture","abstract":"“Big design up front is dumb. Doing no design up front is even dumber.” ... so how much is enough?","persons":[{"id":3246,"full_public_name":"Simon Brown","abstract":"Independent Consultant","twitter_name":"simonbrown","avatar_path":"/system/avatars/3246/large/simonbrown.jpg?1634566760"}]},{"id":6581,"date":"2022-04-14T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Architecture","title":"Bridging the Gap Between Ops and Developers with CI/CD","track":"Architecture","type":"lecture","abstract":"Software development has changed dramatically in recent years; no longer can you afford to say, “That’s how we’ve always done it.” Applications are evolving rapidly, which requires you to move fast and fix things. And don’t neglect the cultural shift inherent in any technical change. (Some developers, for instance, reject build-break notifications, going so far as removing themselves from the email list.) If you’re just starting your CI/CD journey, you must ensure everyone understands the benefits, including increased speed-to-market, stable builds, and reduced drama around releases. That way, CI/CD won’t just help you deliver for your customers—it will help you sleep better at night.","persons":[{"id":1058,"full_public_name":"Nathaniel Schutta","abstract":"Nathaniel T. Schutta is a software architect focussed on mobile and making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. In an effort to rid the world of bad presentations, Nate coauthored the book Presentation Patterns with Neal Ford and Matthew McCullough.","twitter_name":"ntschutta","avatar_path":"/system/avatars/1058/large/nts_pic_400x400.jpg?1510766283"}]},{"id":6567,"date":"2022-04-14T13:20:00-04:00","start":"13:20","duration":"01:00","room":"Architecture","title":"Spring Cleaning","track":"Architecture","type":"lecture","abstract":"This talk will demonstrate how to implement aspects of the Clean Architecture in a Spring Boot application. Clean Architecture will be defined, sample code shared, along with ArchUnit rules to reinforce the architecture.","persons":[{"id":1415,"full_public_name":"M. Jeff Wilson","abstract":"M. Jeff Wilson is a avid software developer, published author, certified scrum master and SAFe Program Coach, and lifelong learner. He has worked with teams in the telecommunications, insurance, traffic engineering, retail, and other industries to develop and deliver solutions and improve processes. ","twitter_name":"@mjeffw","avatar_path":"/system/avatars/1415/large/IMG_0076.JPG?1581868404"}]},{"id":7143,"date":"2022-04-14T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Architecture","title":"An Introduction to Apache Pinot","track":"Core Java","type":"lecture","abstract":"Pinot is a real-time, distributed, user-facing analytics database that dramatically reduces the computational cost of analytics workloads. Rather than trying to be yet another cloud data warehouse, it is optimized for showing analytics queries to the users of a system, rather than its internal decision makers.","persons":[{"id":1439,"full_public_name":"Tim Berglund","abstract":"Tim is a teacher, author, and technology leader with StarTree, where he serves as the Vice President of Developer Relations. He is a regular speaker at conferences and a presence on YouTube explaining complex technology topics in an accessible way. He tweets as @tlberglund, blogs every few years at http://timberglund.com, and lives in Littleton, CO, USA. He has three grown children and one grandchild.","twitter_name":"tlberglund","avatar_path":"/system/avatars/1439/large/2020-07-01--head-small.jpg?1647577932"}]},{"id":6898,"date":"2022-04-14T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Architecture","title":"The (Not So Subtle) price of Microservices","track":"Architecture","type":"lecture","abstract":"We know that microservices are good right? (Like Superman), but what if I told you is not a clear-cut of good vs evil, and is more like Batman (with his morally questionable stances)? In this session we dive deep into the hidden (like Uptime percentage, Complecting), and not-so-hidden (Managing Complexity, Network Wire Performance) tradeoffs every time we create a new Microservice. We explores the lessons we learned at Expedia when we combined five microservices into one, and shaved-off 12 seconds of lost latency.\r\n","persons":[{"id":3377,"full_public_name":"Freddy Guime","abstract":"Freddy is a Principal Developer at Expedia. Always dealing with performance and usability he is always curious on how to make the overabundance of data useful for travelers, traders and consumers. Having worked with different technologies before has allowed him to come with solutions to rendering bottleneck problems. A Usability Guru, Freddy understands and bridges the concepts of high-throughput with usability within software.\r\n","twitter_name":"fguime","avatar_path":"/system/avatars/3377/large/1516314157446.jpeg?1641519602"}]}],"Agile":[{"id":6915,"date":"2022-04-14T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Agile","title":"Building Trust with Tech & Product","track":"Agile","type":"lecture","abstract":"If you have been delivering in an agile workflow, you are probably familiar with some variation of a team made up of a product owner, scrum master, and engineers, sometimes with considerable overlap. Regardless of your team’s make-up, there is often a dynamic including a product entity and a technical entity. This talk will address common discomfort zones between these groups and bring light to many different practices that allow product and tech to work together to not only create top notch products, but also have a lot of fun together!","persons":[{"id":3347,"full_public_name":"Erin Geoghan","abstract":"Erin is a full stack software engineer, lead consultant and senior manager at Ippon. Recently she has been a tech lead on a variety of projects, constantly looking for ways to excel both the team's engagement and the quality of a product","twitter_name":"","avatar_path":"/system/avatars/3347/large/erin.jpeg?1641519542"}]},{"id":6611,"date":"2022-04-14T11:20:00-04:00","start":"11:20","duration":"01:00","room":"Agile","title":"Test-Driven Development is a Paradox","track":"Agile","type":"lecture","abstract":"Test-Driven Development (TDD) says the way to get done sooner depends on writing more code, and that you must write tests for code that doesn't exist. This session will show you how it is possible for these \r\ncrazy ideas to actually work. You really can get done sooner (and have higher quality code) by writing more code...","persons":[{"id":233,"full_public_name":"Burk Hufnagel","abstract":"Burk is a long-time programmer and software architect, with experience in multiple languages including Java and JavaScript. He’s presented at multiple conferences including ConnectTech, DevNexus, JavaOne, and Oracle Code One, and contributed to two of the “97 Things” books published by O’Reilly. <br>Burk works as a Solution Architect for Daugherty Business Solutions where he's focused on finding ways to deliver better code in less time, and teaching others how to do the same.","twitter_name":"@BurkHufnagel","avatar_path":"/system/avatars/233/large/Burk_390x490.png?1554384419"}]},{"id":6887,"date":"2022-04-14T13:20:00-04:00","start":"13:20","duration":"00:40","room":"Agile","title":"Minimum CD (Continuous Delivery) - Road from “fake” CD to minimum CD and beyond...","track":"Agile","type":"lecture","abstract":"The book Accelerate states, “Continuous delivery improves both delivery performance and quality, and also helps improve culture and reduce burnout and deployment pain.” Those of us who work this way know this is true and that CD is a powerful tool for organizational improvement. However, this is only true if we are really doing continuous delivery. Many aren’t.\r\nIn this lecture we will be presenting the anti-patterns we’ve seen when teams and organizations use incorrect definitions of CD. We’ll also discuss how beer and frustration together in a virtual bar resulted in several of us self-forming around the problem of helping more people to fix it.\r\n","persons":[{"id":3404,"full_public_name":"Bryan Finster","abstract":"Value Stream Architect for Defense Unicorns. A passionate advocate for and practitioner of continuous delivery who knows from experience that CD improves outcomes for the end-user, the organization, and for the teams implementing it. Deploy more and sleep better.","twitter_name":"@bryanfinster","avatar_path":"/system/avatars/3404/large/profile_1743_.jpeg?1642595968"},{"id":2293,"full_public_name":"Istvan Bathazi","abstract":"Experienced Lead Software Engineer and DevOps Advocate with a demonstrated history of working in the insurance industry. Skilled in Analytical Skills, Enterprise Architecture, JAVA EE, Core JAVA and Software Development. Strong engineering professional graduated from University of South Carolina. ","twitter_name":"@IstvanBathazi","avatar_path":"/system/avatars/2293/large/istvan.jpeg?1641519320"}]},{"id":6482,"date":"2022-04-14T14:20:00-04:00","start":"14:20","duration":"01:00","room":"Agile","title":"Do You Want to Save $50,000 Per Developer Per Year?","track":"Agile","type":"lecture","abstract":"A typical development team spends 30% to 40% of its time fixing bugs; multiple examples at multiple companies demonstrate that Specification by Example/BDD can reduce that to 1% to 2%. If an average developer costs $150,000 per year (salary plus benefits), that is a savings of $50K per developer per year – not to mention the value of delivering code faster with fewer bugs. How much of that do you want?","persons":[{"id":3228,"full_public_name":"Leslie Brooks","abstract":"In his constant drive to test better, faster, and cheaper tomorrow than today, Leslie was an early adopter of Specification by Example/BDD, and has used it to transform three different organizations. He has trained more than 300 Business Analysts, Developers, and Testers in the correct use of SBE, including using it to deliver automated tests while the developers are still writing the code. ","twitter_name":"","avatar_path":"/system/avatars/3228/large/leslie.jpeg?1641519349"}]},{"id":6483,"date":"2022-04-14T15:40:00-04:00","start":"15:40","duration":"01:00","room":"Agile","title":"Hybrid Scrum: location may vary","track":"Agile","type":"lecture","abstract":"As a part time ScrumMaster on a team with over 200 sprints distributed across multiple onsite and working from home locations, I encountered and observed many good practices and anti-patterns for engaging the whole team. Hopefully most teams have mastered fully remote teams by now. However, as office buildings reopen after COVID, many teams are just getting started with having some, but not all, people together. Join me in this session to get some tips and practices to avoid.","persons":[{"id":883,"full_public_name":"Jeanne Boyarsky","abstract":"Jeanne Boyarsky is a Java Champion and published author. She wrote wrote Sybex’s hugely popular Java 8 and Java 11 certification books. She is a Java developer with 17 years experience and volunteers with a FIRST robotics team.  In 2018, she spoke at DevNexus, Oracle Code One and QCon.  Jeanne is a Distinguished Toastmaster which involves giving over 50 public speeches. For more on Jeanne’s professional experience:, see http:/jeanne.boyarsky.com","twitter_name":"jeanneboyarsky","avatar_path":"/system/avatars/883/large/2017-black-and-white.jpeg?1510619579"}]}]}}]}}}