{"schedule":{"conference":{"title":"Devnexus 2018","start":"2018-02-21","end":"2018-02-23","daysCount":3,"timeslot_duration":"00:15","days":[{"index":0,"date":"2018-02-21","day_start":"2018-02-21T07:00:00-05:00","day_end":"2018-02-21T20:00:00-05:00","rooms":{"Core Java":[{"id":1892,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Core Java","title":"Visualising software architecture with the C4 model","track":"workshop","type":"workshop","abstract":"It's very likely that the majority of the software architecture diagrams you've seen are a confused mess of boxes and lines. Following the publication of the Manifesto for Agile Software Development in 2001, teams have abandoned UML, discarded the concept of modelling and instead place a heavy reliance on conversations centered around incoherent whiteboard diagrams or shallow \"Marketecture\" diagrams created with Visio. Moving fast and being agile requires good communication, yet software development teams struggle with this fundamental skill. A good set of software architecture diagrams are priceless for aligning a team around a shared vision and for getting new-joiners productive fast.\r\n\r\nThis hands-on workshop explores the visual communication of software architecture and is based upon a decade of my experiences working with software development teams large and small across the globe. We'll look at what is commonplace today, the importance of creating a shared vocabulary, diagram notation, and the value of creating a lightweight model to describe your software system. The workshop is based upon the \"C4 model\", which I created as a way to help software development teams describe and communicate software architecture, both during up-front design sessions and when retrospectively documenting an existing codebase. It's a way to create maps of your code, at various levels of detail. Static structure, runtime and deployment diagrams are all covered, so you'll be able to tell different stories to different audiences. We'll wrap up the day by looking at the tooling landscape and diagram automation to keep your diagrams in sync with your source code.","persons":[{"id":1041,"full_public_name":"Simon Brown","abstract":"Simon is an independent consultant specialising in software architecture, and the author of\r\n                        <a href=\"https://leanpub.com/b/software-architecture\">\"Software Architecture for Developers\"</a>\r\n                        (a developer-friendly guide to software architecture, technical leadership and the balance with agility).\r\n                        He is also the creator of the <a href=\"https://c4model.com\">C4 software architecture model</a>,\r\n                        which is a simple approach to creating maps of your code. Simon is a regular speaker at international\r\n                        software development conferences and travels the world to help organisations visualise and document their software architecture.","twitter_name":"simonbrown","avatar_path":"/system/avatars/1041/large/simonbrown.jpg?1510592530"}]}],"JavaScript":[{"id":1397,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"01:00","room":"JavaScript","title":"Pragmatic Microservices with Java EE and WildFly Swarm","track":"workshop","type":"workshop","abstract":"In this hands-on lab we will discuss when and how to develop pragmatic microservices using Java EE and WildFly Swarm. The lab takes a step-by-step approach using a simple but representative example starting from a vanilla Java EE monolithic application and ending in Dockerized WildFly Swarm microservices on the cloud with all the trimmings.","persons":[{"id":792,"full_public_name":"Reza Rahman","abstract":"Reza Rahman is a long time consultant now working at CapTech. He has been an official Java technologist at Oracle. He is the author of the popular book EJB 3 in Action. Reza has long been a frequent speaker at Java User Groups and conferences worldwide including JavaOne and Devoxx. He has been the lead for the Java EE track at JavaOne as well as a JavaOne Rock Star Speaker award recipient. Reza is an avid contributor to industry journals like JavaLobby/DZone and TheServerSide. He has been a member of the Java EE, EJB and JMS expert groups over the years. Reza implemented the EJB container for the Resin open source Java EE application server. He helps lead the Philadelphia Java User Group.","twitter_name":"reza_rahman","avatar_path":"/system/avatars/792/large/reza_mini_headshot.jpg?1506188605"}]}],"Microservices":[{"id":1712,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Microservices","title":"Behavior Driven Development with Spock / What’s new with JUnit 5","track":"workshop","type":"workshop","abstract":"In the first part of this workshop you'll dive into Behavior Driven Development with Spock. Working through a sample project, you'll gain experience with several of the core practices that make BDD so valuable to developers, including Domain Driven Design and Specification by Example. By the time you're done, you'll see for yourself how Spock and BDD can help you deliver higher quality code in less time.\r\n\r\nIn the afternoon, you'll get up to speed wth JUnit 5. The difference between JUnit 4 and 5 is far bigger than the difference between 3 and 4. JUnit 5 was released in September so it is high time to learn about next generation JUnit. Come learn about the new features and the new styles of unit testing that JUnit 5 allows.\r\n\r\nYou'll learn about:\r\n   Writing clean code\r\n   Writing good specifications and tests\r\n   User acceptance tests, integration tests, and unit tests\r\n   Pair, and mob, programming\r\n   Life without the debugger","persons":[{"id":883,"full_public_name":"Jeanne Boyarsky","abstract":"Jeanne Boyarsky wrote Sybex’s hugely popular Java 8 OCA and OCP certification books. She is a Java developer with 15 years experience and volunteers with a FIRST robotics team.  In 2017, she spoke at JavaOne.  Jeanne is a Distinguished Toastmaster which involves giving over 50 public speeches. For more on Jeanne’s professional experience:, see http://www.coderanch.com/how-to/java/BioJeanneBoyarsky","twitter_name":"jeanneboyarsky","avatar_path":"/system/avatars/883/large/2017-black-and-white.jpeg?1510619579"},{"id":233,"full_public_name":"Burk Hufnagel","abstract":"Burk is a long-time programmer and software architect, with experience in multiple languages including Java and JavaScript. He’s presented at multiple conferences including ConnectTech, DevNexus and JavaOne, and contributed to two of the “97 Things” books published by O’Reilly. He works as a Technical Architect for Daugherty Business Solutions where he's focused on finding ways to deliver better code in less time, and teaching others how to do the same thing.","twitter_name":"@BurkHufnagel","avatar_path":"/system/avatars/233/large/Burk_390x390.png?1510112445"}]}],"JVM Languages":[{"id":1759,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"JVM Languages","title":"Practical JVM Performance Tuning with jPDM","track":"workshop","type":"workshop","abstract":"The purpose of jPDM, a performance diagnostic model, is to bring structure to the often chaotic activity of performance tuning. After an introduction to jPDM, attendees will be given problems to solve thus providing a deeper understand how to use jPDM","persons":[{"id":938,"full_public_name":"Kirk Pepperdine","abstract":"Kirk is a co-founder of jClarity, a company building the next generation of application diagnostic tooling. He is the author of jPDM, a performance diagnostic model that help people to quickly identify the root cause of performance regressions.","twitter_name":"kcpeppe","avatar_path":"/system/avatars/938/large/kirk-thumb.jpg?1510757491"}]}],"Mobile":[{"id":1862,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Mobile","title":"Workshop: Upgrade to Java 8 and 9","track":"workshop","type":"workshop","abstract":"This workshop will focus on the functional features introduced in Java 8 and the new capabilities added in Java 9. Topics from Java 8 will include both sequential and parallel streams, lambdas, method references, the Optional data type, functional interfaces, static and default methods in interfaces, collectors, and more. Topics from Java 9 will include the new module system using Jigsaw, the jshell REPL, private methods in interfaces, collection factory methods, and additions to the Stream, Optional, and CompletableFuture classes.\r\n\r\nThe examples and exercises will highlight the ways to write idiomatic Java using the new features. All code will be available in a GitHub repository, including Gradle build files and test cases. Coding will use the IntelliJ IDEA editor, but Eclipse support will be discussed.\r\n\r\nParticipants are expected to be comfortable with, though not necessarily experts using, versions of Java prior to Java 8.","persons":[{"id":1078,"full_public_name":"Kenneth Kousen","abstract":"Ken Kousen is a Java Champion and the author of the books Modern Java Recipes (O'Reilly), Gradle Recipes for Android (O'Reilly), and Making Java Groovy (Manning). He is a regular speaker on the No Fluff, Just Stuff Tour, and teaches training classes in areas related to Java, including Spring, Hibernate/JPA, Groovy, Grails, Gradle, and Android.","twitter_name":"kenkousen","avatar_path":null}]}],"Patterns & Design":[{"id":1863,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Patterns & Design","title":"Functional Programming with Java 8 and 9","track":"workshop","type":"workshop","abstract":"With Java supporting lambda expressions, we have nothing to stop us from creating functional style of code for our day to day applications. We are so used to object-oriented programming, but remember the paradigm shift we went through to adapt to that way of programming. It is yet another paradigm shift and most of us wonder how in the world can we write functional style code. Much like how OO was not as much about the syntax as it was about the design, functional programming is about the design, the idioms, and the data structures we would use to program.\r\n\r\nIn this hands-on workshop, we will learn about functional programming using practical examples, create small apps that will make use of this style of programming, and relate to how it differs from the traditional way were used to and the benefits it offers.","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]}],"Performance":[{"id":1867,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Performance","title":"Head-first Reactive with Spring and Reactor","track":"workshop","type":"workshop","abstract":"Spring Boot 2 and Spring Framework 5 have arrived and they deliver on a key promise: Supporting Reactive programming using Reactor 3.1 to model non-blocking flows. \r\n\r\nMore than learning about a new framework, the developer is challenged with a new mindset. In this Workshop, we aim to deliver the survival kit to understand reactive programming trade-off, when to choose it and read/write Reactor flows. In the context of Spring Boot 2, we'll be exploring some of the ecosystem support like web, data and security.","persons":[{"id":1015,"full_public_name":"Ben Hale","abstract":"Ben Hale leads Pivotal's efforts to constantly improve the Java experience on Cloud Foundry. Recently he has been working on the Cloud Foundry Java Buildpack with an eye to making it the best place to run Java applications, in the Cloud or otherwise. In addition, he leads the team that is revamping the Cloud Foundry Java Client, a Java language binding on top of the Cloud Foundry REST APIs.\r\n\r\nPrior to working on Cloud Foundry, Ben worked on large-scale middleware management tools, tc Server, dm Server (OSGi), and Spring. If you go back far enough, he even worked on a network management and monitoring application, but will deny it when asked.","twitter_name":"","avatar_path":"/system/avatars/1015/large/headshot-2.jpg?1510076642"},{"id":812,"full_public_name":"Madhura Bhave","abstract":"Madhura Bhave is a developer at Pivotal on the Spring Boot team. Before joining the Spring Boot team, Madhura worked on the UAA (Authentication and Authorization component for Cloud Foundry).","twitter_name":"madhurabhave23","avatar_path":"/system/avatars/812/large/IMG_0325.JPG?1506539183"},{"id":734,"full_public_name":"Stephane Maldini","abstract":"A multi-tasker eating tech 24/7, Stephane is interested in distributed computing, data science and messaging. He is on a mission to help organisations transform their applications into consumer-grade software. He founded Project Reactor to help developers create reactive, efficient serving architectures on the JVM and beyond.","twitter_name":"smaldini","avatar_path":null}]}],"Security":[{"id":1871,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Security","title":"ANGULAR: FAST & FURIOUS (V5+)","track":"workshop","type":"workshop","abstract":"Angular is a robust platform and many products relay on its foundation. Teams have now learnt about best practices and tooling.\r\nIn this workshop you will learn about the less known areas of Angular so you can take your skills and your team to the next level!","persons":[{"id":480,"full_public_name":"Gerard Sans","abstract":"Community leader. Google Developer Expert\r\n","twitter_name":"@gerardsans","avatar_path":"/system/avatars/480/large/gerardsans.jpg?1510698190"}]}],"Serverless and Cloud":[{"id":1819,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Serverless and Cloud","title":"Spring Boot 2.0 Workshop","track":"workshop","type":"workshop","abstract":"Spring Boot is the next chapter of the Spring Framework; where through this workshop you will develop a foundation for creating enterprise-ready applications by using this technology and all its enterprise ready features, from zero configuration files, faster development to easy deployment.\r\n\r\nNow with the new Spring 5 release with new features like Reactor & WebFlux, it will bring Spring Boot 2.0 into the next level.\r\n","persons":[{"id":995,"full_public_name":"Felipe Gutierrez","abstract":"Over 20 years of IT experience, during which he has developed programs for companies in multiple vertical industries, such as: government, retail, healthcare, education and banking. He has developed Accounting and Administration enterprise systems, device driver construction, development of educational software, antivirus modules, batch processing for legacy system using new technologies, among others. He has extensive experience developing software, using technologies such as Java (J2EE, Groovy, Grails, Hibernate, Spring Framework), C++, .NET Framework (C#, VB .NET, ASP .NET), Delphi, Unix, Linux, Web Services, and PHP. Methodologies used RUP, Agile (Extreme Programming, Crystal, and SCRUM), and Emerging Technologies such as: Adobe Flex, iOS and Android.\r\n\r\nCurrently working for Pivotal as Technical Instructor / Solutions Architect\r\n\r\nBook Author (Apress Publishing)\r\n- Introducing Spring Framework (http://www.apress.com/9781430265320)\r\n- Pro Spring Cloud Data Flow (work in progress – Feb 2018)\r\n- Pro Spring Boot (http://www.apress.com/us/book/9781484214329)\r\n- Spring Boot Messaging (http://www.apress.com/us/book/9781484212257)\r\n- Pro Spring Boot 2nd Edition (work in progress - Jan 2018\r\n\r\n","twitter_name":"@felipeg48","avatar_path":"/system/avatars/995/large/Me.jpg?1509416622"}]}],"Room 15":[{"id":1630,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Room 15","title":"Eclipse Collections Kata: Fun way to learn a collections framework","track":"workshop","type":"workshop","abstract":"In this tutorial session, the audience will learn Eclipse Collections by going through the Eclipse Collections Kata. This kata is set up as a series of unit tests which fail. The participants will make them pass using Eclipse Collections. The instructors will discuss the solutions live and explain the concepts behind the iteration patterns in greater detail.\r\n\r\nIteration patterns with Java 8 streams patterns, basic refactoring techniques and memory, performance comparisons will be covered in the tutorial.\r\n\r\nEclipse Collections (formerly known as GS Collections) is an open-source Java collections framework which supplements JDK collections. It was migrated to Eclipse foundation in October 2015. Eclipse collections has both object and primitive containers; rich APIs available for eager and lazy iteration patterns; mutable and immutable collections; and additional container types not available in the JDK, such as Bag and Multimap. \r\n\r\nFor more information on Eclipse Collections visit: http://www.eclipse.org/collections/","persons":[{"id":1005,"full_public_name":"Donald Raab","abstract":"Donald Raab works in the Application Platform and Services team at BNY Mellon in the Jersey City Innovation Center. Donald is a member of the Java Specification Request (JSR) 335 Expert Group and has presented at JavaOne, Devoxx US, EclipseCon, GIDS and the JVM Language Summit. He created the Eclipse Collections Java library which was originally open sourced as GS Collections in 2012 and migrated to the Eclipse Foundation in 2015.","twitter_name":"@TheDonRaab","avatar_path":"/system/avatars/1005/large/PZjOBoO9_400x400.jpeg?1510755909"},{"id":884,"full_public_name":"Nikhil Nanivadekar","abstract":"Nikhil Nanivadekar is a Vice President in Private Wealth Management in the Technology division of Goldman Sachs. Nikhil is the project lead and committer for Eclipse Collections and has presented at JavaOne, DevoxxUS and Java User Group meetups. He is passionate about robotics has conducted robotics workshops at JCrete4Kids, JavaOne4Kids and Devoxx4Kids. Nikhil graduated in 2012 from University of Utah with a Masters in Mechanical Engineering with specialization in Robotics and Controls. Nikhil was inducted in the Oracle Developer Champions program in 2017.","twitter_name":"nikhilnanivade","avatar_path":null}]}],"Sidney Marcus":[{"id":2088,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Sidney Marcus","title":"Grails 3 and React Workshop","track":"workshop","type":"","abstract":"Historically, Grails applications that contain a browser-based front end have most often utilized server-side HTML generation built with Groovy Server Pages (GSP).  This approach makes sense for a lot of applications but not for all.  Modern web apps are often built as “Single Page Apps” (SPA) made up of a rich front end implemented in Javascript and stateless backend REST services for which Grails is perfectly suited.  To leverage the benefits of an approach like that Grails provides first-rate support for building SPAs with Grails 3 and part of that support comes in the way of Grails 3 Profiles specifically designed to jumpstart the development of web applications utilizing that type of architecture. This workshop will explore many details related to building a Single Page Application using React and Grails 3.  Topics include the following:\r\n•Introduction To Grails 3\r\n•Introduction To React\r\n•The React Profile For Grails 3\r\n•REST Services\r\n•JSON Views\r\n•Spring Security REST\r\n•Tying It All Together\r\n\r\nThe workshop will include roughly 50% lecture and demonstrations and 50% hands-on lab work building a real application utilizing React on the front end, Grails 3 RESTservices on the backend and Spring Security to provide role-based authentication and authorization for securing access to various capabilities in the application.","persons":[{"id":1154,"full_public_name":"Jeff Brown","abstract":"Jeff Brown, Grails co-founder, has been doing JVM application development for as long as the JVM has existed and has spent most of the last decade focused specifically on work related to the Grails framework. \r\n\r\nJeff co-authored The Definitive Guide To Grails Second Edition, and The Definitive Guide To Grails 2, with Grails founder and OCI Grails Development Lead, Graeme Rocher. Jeff is a regular public speaker on Grails, Groovy and other JVM-related technologies.","twitter_name":"@jeffscottbrown","avatar_path":"/system/avatars/1154/large/jeff.png?1513694318"}]}],"Nighthacking":[],"Frameworks":[{"id":1945,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Frameworks","title":"Apache Spark Workshop","track":"workshop","type":"workshop","abstract":"<p>\r\nIn this full-day workshop, we will introduce you to Apache Spark from the ground up.  Spark has a Scala, Java, and Python API. This workshop will use Scala for its static typed structure but also it's conciseness and less noise.\r\n</p>","persons":[{"id":1080,"full_public_name":"Daniel Hinojosa","abstract":"Daniel Hinojosa is a programmer, consultant, instructor, speaker, and author. With over 20 years of experience, he does work for private, educational, and government institutions","twitter_name":"dhinojosa","avatar_path":"/system/avatars/1080/large/kvuYjMde_400x400.jpg?1511203285"}]}],"Agile":[{"id":1911,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Agile","title":"Developer To Architect - Full day workshop","track":"workshop","type":"workshop","abstract":"Becoming a software architect is a longed-for career upgrade for many software developers. While the job title suggests a work day focused on technical decision-making, the reality is quite different. In this workshop, software architect Nathaniel Schutta constructs a real world job description in which communication trumps coding.\r\n\r\nDiscover the skill sets needed to juggle multiple priorities, meetings, and time demands\r\nLearn why your best team leadership tool is not a hammer, but a shared cup of coffee\r\nHear the best ways to give and take criticism\r\nUnderstand the necessity of writing effective email and formal architecture documents\r\nGet tips for delivering confident career-building presentations to any audience\r\nReview essential techniques for stakeholder management and relationship building\r\nExplore the critical needs for architecture reviews and an effective process for conducting them\r\nThrough lecture and small group exercises, Nathaniel will help you understand what it means to be a successful architect. Working through various problems, attendees will have opportunities to think through architectural decisions and patterns, discuss the importance of non functional requirements and why architects cannot afford to practice resume driven design.","persons":[{"id":1058,"full_public_name":"Nathaniel Schutta","abstract":"Nathaniel T. Schutta is a software architect focussed on mobile and making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. In an effort to rid the world of bad presentations, Nate coauthored the book Presentation Patterns with Neal Ford and Matthew McCullough.","twitter_name":"ntschutta","avatar_path":"/system/avatars/1058/large/nts_pic_400x400.jpg?1510766283"}]}],"Architecture":[{"id":1348,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Architecture","title":"Java Microservices Patterns & Practices with Kubernetes/OpenShift and Istio","track":"workshop","type":"workshop","abstract":"Already familiar with the Kubernetes and OpenShift concepts and features? Then you're ready for the next step! Now you need to learn how Kubernetes and a Service Mesh (Istio) can provide you out-of-box and transparently features like service discovery, load balancing, tracing, and circuit breaking. Without having to add a single line of code or @Annotation!\r\n\r\nCome to this workshop to build your own small cluster of Java Microservices with Spring Boot and Eclipse Vert.x on top of Kubernetes/OpenShift and Istio. Then you will be able to unleash your developer powers on your project without having to worry too much with your infrastructure details anymore!","persons":[{"id":848,"full_public_name":"Rafael Benevides","abstract":"Rafael Benevides is Director of Developer Experience at Red Hat. With many years of experience in several fields of the IT industry, he helps developers and companies all over the world to be more effective in software development. Rafael considers himself a problem solver who has a big love for sharing. He is a member of Apache DeltaSpike PMC - a Duke’s Choice Award winner project, and a speaker in conferences like JavaOne, Devoxx, TDC, DevNexus and many others.","twitter_name":"@rafabene","avatar_path":"/system/avatars/848/large/rafaesf.jpg?1506798287"},{"id":836,"full_public_name":"Burr Sutter","abstract":"A lifelong developer advocate, community organizer, and technology evangelist, Burr Sutter is a featured speaker at technology events around the globe—from Bangalore to Brussels and Berlin to Beijing (and most parts in between)—he is currently Red Hat’s Director of Developer Experience. A Java Champion since 2005 and former president of the Atlanta Java User Group, Burr founded the DevNexus conference—now the second largest Java event in the U.S.—with the aim of making access to the world’s leading developers affordable to the developer community. When not speaking abroad, Burr is also the passionate creator and orchestrator of highly-interactive live demo keynotes at Red Hat Summit, the company’s premier annual event.","twitter_name":"burrsutter","avatar_path":"/system/avatars/836/large/080717_BURRSUTTER_HEADSHOT_6INX6IN_300DPI.JPG?1506781615"},{"id":915,"full_public_name":"Edson Yanaga","abstract":"Edson Yanaga, Red Hat's Director of Developer Experience, is a Java Champion and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java, Microservices, Cloud Computing, DevOps, and Software Craftsmanship. ","twitter_name":"yanaga","avatar_path":"/system/avatars/915/large/edson_yanaga.jpg?1507757067"}]}],"Core Cloud":[{"id":1858,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Core Cloud","title":"Upgrade your developer superpowers with Containers, Kubernetes, and OpenShift","track":"workshop","type":"workshop","abstract":"Wish you could learn how to build, develop and run containers successfully into production? Your wish was granted! Attend this workshop and you'll learn how to do all of this and much more on top of the Kubernetes/OpenShift platform.\r\n\r\nYou'll have hands-on exercises that will walk you through from building, deploying, scaling, and even performing A/B testing on your applications with Kubernetes/OpenShift. And don't forget state: you'll be able to deploy a stateful application with a database and polyglot backend services.\r\n\r\nWhat about having your own Kubernetes/OpenShift development environment on your notebook? We'll have it up and running on this workshop with the Minishift/CDK environment. And do you want to feel the taste of the future of software development environments? You'll have access to OpenShift.io, the true from idea to production cloud-development environment. We have it covered: planning, repositories, IDE, testing, deploying, and running without leaving your browser.","persons":[{"id":1052,"full_public_name":"Jorge Morales","abstract":"OpenShift Developer advocate","twitter_name":"UnPOUcoDe","avatar_path":"/system/avatars/1052/large/Avatar-150x150.jpeg?1510677584"},{"id":898,"full_public_name":"Steven Pousty","abstract":"Steve is Director of Developer Advocacy for Red Hat Middleware (aka Java Stuff). He has spoken a lot of place and is even a JavaOne Rockstar. His talks are information rich, usually with demos, and informal. ","twitter_name":"TheSteve0","avatar_path":"/system/avatars/898/large/NewGoodPhoto.jpg?1507659098"},{"id":719,"full_public_name":"Veer Muchandi","abstract":"Veer Muchandi is a Principal Architect and Container/PaaS evangelist with RedHat. Specializes in Containerization, Microservices, PaaS and DevOps. Spreading awesomeness of OpenShift, an enterprise ready Kubernetes Platform to run your container workloads. Well known blogger, teacher, and speaker. Veer also runs OpenShift-Kubernetes meet up group in Atlanta.","twitter_name":"@VeerMuchandi","avatar_path":"/system/avatars/719/large/Photo.jpg?1505238438"}]}],"Web":[{"id":1861,"date":"2018-02-21T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Web","title":"Building Evolutionary Architectures","track":"workshop","type":"workshop","abstract":"The software development ecosystem is constantly changing, providing a constant stream of new tools, frameworks, techniques, and paradigms. Over the past few years, incremental developments in core engineering practices for software development have created the foundations for rethinking how architecture changes over time, along with ways to protect important architectural characteristics as it evolves. This practical workshop ties those parts together with a new way to think about architecture and time.","persons":[{"id":711,"full_public_name":"Neal Ford","abstract":"Neal is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a software company and a community of passionate, purpose-led individuals, delivering technology to address the toughest challenges, all while seeking to revolutionize the IT industry and create positive social change. He speaks at many conferences.\r\n","twitter_name":"neal4d","avatar_path":"/system/avatars/711/large/NF.png?1512951094"}]}]}},{"index":1,"date":"2018-02-22","day_start":"2018-02-22T07:00:00-05:00","day_end":"2018-02-22T20:00:00-05:00","rooms":{"Core Java":[{"id":1895,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Core Java","title":"Let's Get Lazy: Exploring the Real Power of Streams","track":"Java","type":"lecture","abstract":"Efficiency is achieved not just by running things faster, but by avoiding things that shouldn't be done in the first place. Lazy evaluations are a core feature of many functional programming languages. Your code can benefit from lazy evaluations with lambda expressions and, more so, with the power of Streams. In this presentation, we'll start with a discussion of lazy evaluations, with short examples from Haskell and Scala. Then we'll dive into Java to see how we can achieve similar benefits using lambdas and the Stream API.\r\n","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]},{"id":1705,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Core Java","title":"Moving Java Forward Faster","track":"Java","type":"lecture","abstract":"The Java SE Platform and the JDK are moving to a rapid, six-month release cadence, with the next release in March 2018.  We’ll review the motivations for this change and discuss some of its consequences.  We'll then take a look ahead at the pipeline of features currently in development in various projects in the OpenJDK Community including Amber, Panama, Valhalla, and Loom.\r\n","persons":[{"id":916,"full_public_name":"Mark Reinhold","abstract":"Mark Reinhold is Chief Architect of the Java Platform Group at Oracle.  His past contributions to the platform include character-stream readers and writers, reference objects, shutdown hooks, the NIO high-performance I/O APIs, library generification, service loaders, and the Jigsaw module system.  Mark has had key leadership roles in every Java SE and JDK release since version 1.2, in 1998.  He currently leads the JDK Project in the OpenJDK Community, where he also serves on the Governing Board.  Mark holds a Ph.D. in computer science from the Massachusetts Institute of Technology.","twitter_name":"mreinhold","avatar_path":"/system/avatars/916/large/mr.jpg?1507762886"}]},{"id":1903,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Core Java","title":"Migrating to Java 9 Modules","track":"Java","type":"lecture","abstract":"In this talk we look at examples of migrating real code, based on  Spring/Hibernate, to Java 9 modules.","persons":[{"id":1043,"full_public_name":"Sander Mak","abstract":"Sander is a Fellow at Luminis and author of the O'Reilly book <a href=\"https://javamodularity.com\">Java 9 Modularity</a>.","twitter_name":"@Sander_Mak","avatar_path":"/system/avatars/1043/large/sander_mak_sq_small.jpg?1510606834"}]},{"id":1897,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Core Java","title":"CompletableFuture: The Promises of Java","track":"Java","type":"lecture","abstract":"At the core of asynchronous programming facility in Java is CompletableFuture. It provides two channels, one for data and one for error handling. Using a nice series of transformations we can work with data or deal with errors quite elegantly. In this presentation we will learn about the key problem CompletableFuture solves, how and when to use it, and also take a look at some problems that can be easily solved using it.\r\n","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]},{"id":1704,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Core Java","title":"Modules in Action","track":"Java","type":"lecture","abstract":"A practical introduction, with live coding, to the Jigsaw module system in Java 9.","persons":[{"id":916,"full_public_name":"Mark Reinhold","abstract":"Mark Reinhold is Chief Architect of the Java Platform Group at Oracle.  His past contributions to the platform include character-stream readers and writers, reference objects, shutdown hooks, the NIO high-performance I/O APIs, library generification, service loaders, and the Jigsaw module system.  Mark has had key leadership roles in every Java SE and JDK release since version 1.2, in 1998.  He currently leads the JDK Project in the OpenJDK Community, where he also serves on the Governing Board.  Mark holds a Ph.D. in computer science from the Massachusetts Institute of Technology.","twitter_name":"mreinhold","avatar_path":"/system/avatars/916/large/mr.jpg?1507762886"}]},{"id":1617,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"Core Java","title":"The Hitchhiker’s Guide to Java Class Reloading","track":"Java","type":"lecture","abstract":"This session takes a look at the options available for Java class reloading. We are going to take a look at 3 technical solutions to the problem -- HotSwap, classloaders, and Java agent based approach -- what are the benefits and shortcomings.","persons":[{"id":881,"full_public_name":"Anton Arhipov","abstract":"Anton is a Developer Advocate at JetBrains. Professional interests include programming languages, middleware and developer tooling. He tweets as @antonarhipov, speaks at Java conferences, and occasionally writes articles for RebelLabs at http://rebellabs.org","twitter_name":"@antonarhipov","avatar_path":"/system/avatars/881/large/anton-220x220.jpg?1510741272"}]}],"JavaScript":[{"id":1327,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"JavaScript","title":"Techniques for Taming the Asynchronous Nature of Node.js","track":"JavaScript","type":"lecture","abstract":"In this session, attendees will learn how to tame the asynchronous nature of Node.js using several tools and techniques including, named functions, Promises, the Async library and more.","persons":[{"id":742,"full_public_name":"Dan Mcghan","abstract":"Dan McGhan is an Oracle Developer Advocate with a focus on JavaScript and HTML5. He started his programming career as a back-end Oracle Database developer specializing in SQL and PL/SQL. Before long, he began working with front-end technologies to create web applications where he quickly developed a passion for JavaScript. These days he enjoys sharing his passion for JavaScript, Node.js, and Oracle Database via his blog at https://jsao.io.","twitter_name":"dmcghan","avatar_path":"/system/avatars/742/large/dm-17.jpg?1511234883"}]},{"id":2104,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"JavaScript","title":"Bending time with Schedulers and RxJS 5","track":"JavaScript","type":"lecture","abstract":"Observables have been very popular because of their many qualities: asynchronous processing, composition, performance, powerful operators. But usually there's a less covered feature that lies beneath. That is: Schedulers. In this talk we are going to cover Schedulers in depth, going from the basic APIs to more obscure features to bend time to our will!","persons":[{"id":480,"full_public_name":"Gerard Sans","abstract":"Community leader. Google Developer Expert\r\n","twitter_name":"@gerardsans","avatar_path":"/system/avatars/480/large/gerardsans.jpg?1510698190"}]},{"id":1500,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"JavaScript","title":"What's New in TypeScript? ","track":"JavaScript","type":"lecture","abstract":"TypeScript, an open source project, is used to build several key frameworks like AngularJS. Doris will go through how TypeScript enables you to leverage features from the current and future of JavaScript while increasing the productivity of JavaScript development. This session will cover some of the latest features of TypeScript 2.x, support for Angular, React/JSX and Node, the state of the art type system capabilities, and how it all comes together to make development more fun with TypeScript.","persons":[{"id":236,"full_public_name":"Dr. Doris Chen","abstract":"Dr. Doris Chen is a Senior Technology Evangelist at Microsoft, specialized in web technologies (web performance tuning, mobile web, HTML5, JavaScript, TypeScript and Java).  \r\nDoris has over 18 years of experience in the software industry working in several open source web tier technologies, Java platform, .NET and distributed computing technologies. She speaks at numerous international conferences and user groups including O’Reilly OSCON, Fluent, Dev Nexus, PHP, HTML5 Dev Conference, WebVisions,  JavaOne, SD Forum, and worldwide User Groups. Doris works very closely to create and foster the open source community around Java, NetBeans, Glassfish, and related technologies. Before joining Microsoft, Doris Chen was a Technology Evangelist at Sun Microsystems.\r\nDoris received her Ph.D. from the University of California at Los Angeles (UCLA) in computer engineering, specializing in medical informatics.\r\n","twitter_name":"@doristchen","avatar_path":"/system/avatars/236/large/DC.png?1512950439"}]},{"id":2066,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"00:30","room":"JavaScript","title":"Apple Machine Learning","track":"Mobile","type":"lecture","abstract":"CoreML is Apple's new framework for hardware accelerated, local machine learning. We will discuss creating a model, converting it to the CoreML format and deploying it into an iOS application. ","persons":[{"id":1150,"full_public_name":"Alex Nachlas","abstract":"Alex Nachlas is a software engineer and project lead at stable|kernel. He completed his undergraduate studies in mathematics and computer science at MIT and his masters of information and data science degree at UC Berkeley. He enjoys theoretical computer science, ice hockey and running.","twitter_name":"","avatar_path":"/system/avatars/1150/large/SK.Headshots.2015-12.jpg?1513695413"}]},{"id":1930,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"JavaScript","title":"Introduction into Google’s Dart Language","track":"JavaScript","type":"lecture","abstract":"Dart is Google’s application programming language that’s easy to learn, easy to scale, and deployable everywhere. Google depends on Dart to make very large apps for its customers and internal teams. Let’s look at the benefits and features of this elegant language that is allowing developers around the world building scalable and secure applications. We’ll also learn how to get started with building a server with our Dart server-side framework called Aqueduct.","persons":[{"id":385,"full_public_name":"Marcus Smith","abstract":"Marcus Smith is a Myrtle Beach native who graduated from Furman University. Following college, he spent 3 years in Japan where he taught English and met his wife of 2 years. He came to stable|kernel after working for BMW as a software engineer and running his own software development company called Frozen Fire Studios, though he’s been programming since he was 11. Marcus enjoys traveling, learning new languages, and taking walks.","twitter_name":"@antsifyoudo","avatar_path":"/system/avatars/385/large/marcus-smith.jpg?1510933125"},{"id":1042,"full_public_name":"Erik Rahtjen","abstract":"Erik Rahtjen is a software engineer from Atlanta, GA. After graduating from Emory University, he became the lead software engineer for Longstreet Solutions before joining the stable|kernel team. He spends most of his time working on mobile apps for both iOS and Android and for fun he reads sci-fi and cooks elaborate meals.","twitter_name":"","avatar_path":"/system/avatars/1042/large/Untitled-1.png?1510934112"}]},{"id":1391,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"JavaScript","title":"You don't know Angular","track":"JavaScript","type":"lecture","abstract":"Angular is an incredibly powerful framework with many nuances and quirks. So often as programmers we can create the same mistakes over and over again in our code without ever know there might be a better way. ","persons":[{"id":73,"full_public_name":"Josh Jensen","abstract":"Currently a freelance mobile application consultant, Josh brings over 14 years of design, architecture, development and passion to his projects and presentations. In the almost 6 years he has been in the mobile space, he has brought hundreds of applications to market for companies ranging from Fortune 500 to startup, as well as contributing to many open source projects. End to end application structure, including mobile and server application architecture, are just a few of the tools Josh has collected over the years and he is passionate about sharing them with others.","twitter_name":"joshj","avatar_path":"/system/avatars/73/large/profile_picture.jpg?1485266081"}]}],"Microservices":[{"id":1915,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Microservices","title":"Deep Dive into Dockerfiles","track":"Microservices","type":"lecture","abstract":"In this session we will dive deeper into Dockerfiles. We will explore the DSL that Dockerfiles provide to allow for the automation of image creation.\r\n\r\nDockerfiles provide a means to automate the creation of images, and consequently the containers within which our applications run. The Dockerfile, though minimal, provides us with everything we need to package our software, and enable it to run. In this session we will dive deep into the Docker DSL, and explore the many commands that it provides, and along the way explore some differences between similar commands, and some gotchas.","persons":[{"id":115,"full_public_name":"Raju Gandhi","abstract":"I am a Software Craftsman with over a decade of experience building Web Applications and Enterprise Software and I love to build great software","twitter_name":"looselytyped","avatar_path":"/system/avatars/115/large/me2_400x400.png?1409064068"}]},{"id":1475,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Microservices","title":"The next evolution of microservices patterns with Istio Mesh","track":"Microservices","type":"lecture","abstract":"With microservices architectures, we’re making more network calls and need to do more integration to get our system to work; this creates more ways for our applications to break and cause failures to propagate much faster. We need a way to call our microservices and be resilient to distributed systems failures — as a first-class implementation. Netflix OSS, Stubby, Finalge, et al were the first-generation of implementations to solve these problems. We'll see in this talk how Istio service mesh is the next evolution of solutions to these problems. ","persons":[{"id":826,"full_public_name":"Christian Posta","abstract":"Christian Posta (@christianposta) is a Chief Architect of cloud applications at Red Hat and well known in the community for being an author (Microservices for Java Developers, O’Reilly 2016), frequent blogger, speaker, open-source enthusiast and committer on various open-source projects. Christian has spent time at web-scale companies and now helps companies create and deploy large-scale, resilient, distributed architectures - many of what we now call Microservices. He enjoys mentoring, training and leading teams to be successful with distributed systems concepts, microservices, devops, and cloud-native application design.","twitter_name":"christianposta","avatar_path":"/system/avatars/826/large/profile.jpg?1506706006"}]},{"id":1497,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Microservices","title":"Building a Microservices Application with JHipster 4 and Docker in 30 Minutes","track":"Microservices","type":"lecture","abstract":"Is it possible to set up a microservices application with a separate functioning front-end in 30 minutes? With JHipster 4 it is! And what you get is fully functional with a service registry that provides scalability and load balancing. Using provided Docker Compose configurations, the entire stack can be run locally without installing anything but Docker. JHipster also includes full monitoring using the ELK stack. ","persons":[{"id":577,"full_public_name":"Dennis Sharpe","abstract":"Dennis Sharpe is a software architect with over 20 years experience leading, designing, and coding software applications. He has experience in a variety of different industries including healthcare, federal government, loyalty, marketing, utilities, telecommunications, and financial. He has experience speaking at several conferences and events including DevNexus, DevFest and Java User Groups. He also has experience training and providing technical leadership for hackathons and coding dojos.","twitter_name":"@SharpeDennis","avatar_path":"/system/avatars/577/large/profile-suit.jpeg?1500734835"}]},{"id":1409,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Microservices","title":"Microprofile - New and Noteworthy","track":"Microservices","type":"lecture","abstract":"When the Microprofile initiative was started in 2016, it only took about three months before version 1.0 was launched. From day one, there were four different implementations from four different vendors available.\r\n\r\nOne year later, Microprofile 1.1 is here!\r\n\r\nWhereas version 1.0 was a subset of Java EE specifications, version 1.1 brings something new to the table. The new kid on the block is <i>MicroProfile Config</i>.\r\n\r\nIn this fast-paced, demo-heavy session, MicroProfile will be introduced and demonstrated using the available implementations in live coding demos. All implementations will be explored and compared in a vendor neutral way.\r\n\r\nWe will also take a look at the potential candidates for future versions. This will include technologies such as:\r\n\r\n<ul>\r\n   <li>Fault Tolerance</li>\r\n   <li>Security</li>\r\n   <li>Health Checks</li>\r\n</ul>","persons":[{"id":798,"full_public_name":"Ivar Grimstad","abstract":"Ivar Grimstad is a Java Champion, JUG Leader and software architect focusing on Enterprise Java. He is participating in the Java Community Process as a member of the Executive Committee, Spec Lead for JSR 371 (MVC 1.0) and Expert Group Member for JSR 375 (Java EE Security API). Ivar is a member of the Eclipse Enterprise for Java (EE4J) PMC and involved in Eclipse MicroProfile. He is also a member of the NetBeans Dream Team.\r\n\r\nIvar is a frequent speaker at international developer conferences.","twitter_name":"ivar_grimstad","avatar_path":"/system/avatars/798/large/ivar_jc_982_988.png?1510598115"}]},{"id":1426,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Microservices","title":"Making Microservices Micro with Istio Service Mesh","track":"Microservices","type":"lecture","abstract":"In this talk, Ray will introduce Istio, an open source service mesh framework created by Google, IBM, and Lyft. We'll see how the service mesh work, the technology behind it, and how it addresses several common microservices cross-cutting concerns.","persons":[{"id":806,"full_public_name":"Ray Tsang","abstract":"Ray is currently a Developer Advocate at Google focused on Google Cloud Platform and Java developer experience. Follow Ray on Twitter @saturnism (https://twitter.com/saturnism)","twitter_name":"saturnism","avatar_path":"/system/avatars/806/large/profile.jpeg?1517295479"}]},{"id":1371,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"Microservices","title":"Functional Microservices with Java 8 and Java EE","track":"Microservices","type":"lecture","abstract":"From good and bad field-experiences of refactoring architectural monoliths to microservices, this presentation describes the who's, why's and how's this could be achieved without rewriting the entire applications by using existing Java EE code bases. Combining the experience with demo implementations with Payara Micro and microprofile.io.","persons":[{"id":771,"full_public_name":"Víctor Orozco","abstract":"Víctor Orozco holds a master in Computer Science by Universidade Federal de Santa Maria (Brazil) awarded with a scholarship from the Organization of American States. JUG Leader of Guatemala Java Users group (the biggest IT user group in Central America) , Duke’s Choice Award 2016 winner and instructor on Edx micromasters. \"By day\" he works as Java trainer and consultant for Nabenik with clients from the financial, government and banking sector, and is also a member of the computer science department at Universidad Rafael Landivar.","twitter_name":"tuxtor","avatar_path":"/system/avatars/771/large/cvalt.png?1505638934"}]}],"JVM Languages":[{"id":1952,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"JVM Languages","title":"Scala for Java Developers","track":"JVM Languages","type":"lecture","abstract":"Scala for Java Developers is a full live code and fast-paced presentation and this is all about the Scala language.\r\n","persons":[{"id":1080,"full_public_name":"Daniel Hinojosa","abstract":"Daniel Hinojosa is a programmer, consultant, instructor, speaker, and author. With over 20 years of experience, he does work for private, educational, and government institutions","twitter_name":"dhinojosa","avatar_path":"/system/avatars/1080/large/kvuYjMde_400x400.jpg?1511203285"}]},{"id":1450,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"JVM Languages","title":"Akka Streams; a match in heaven for Reactive Systems","track":"JVM Languages","type":"lecture","abstract":"This presentation will describe the important concepts of Reactive Systems, the Actor Model, and Reactive Streams. The combination of these empowers developers to build systems that have the traits of being reactive: message-driven, resilient, elastic, and responsive.  ","persons":[{"id":786,"full_public_name":"Henrik Engstrom","abstract":"Senior Software Engineer at Lightbend","twitter_name":"h3nk3","avatar_path":null}]},{"id":1346,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"JVM Languages","title":"Reactive Mythbusters with Reactor","track":"JVM Languages","type":"lecture","abstract":"In the style of the infamous TV show, let's have a look at several pragmatic concerns around reactive programming. For science! (and glory)","persons":[{"id":764,"full_public_name":"Simon Baslé","abstract":"Simon is a software development aficionado, especially interested in reactive programming, software design aspects (OOP, design patterns, software architecture), what lies beyond code (continuous integration, (D)VCS, best practices)... He is currently working as a Software Engineer on project Reactor for Pivotal, remotely from France.","twitter_name":"simonbasle","avatar_path":"/system/avatars/764/large/simonbaslereactor.png?1505235433"}]},{"id":1932,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"JVM Languages","title":"Gradle Fundamentals","track":"JVM Languages","type":"lecture","abstract":"The Gradle build tool is one of the most successful projects in the Groovy ecosystem because it addresses a difficult problem – every major build is a custom build. Gradle builds are written in Groovy, so the full power of the language is available if you need it. Gradle supports Maven project structure and repositories and uses Ivy dependency management without being bound by their normal constraints. With major systems like Grails, Hibernate, and the Spring Framework moving to Gradle, this is a technology worth taking the time to understand.\r\n\r\nThis talk will cover the basics of Gradle both through simple examples and by examining the build files for major open source projects.","persons":[{"id":1078,"full_public_name":"Kenneth Kousen","abstract":"Ken Kousen is a Java Champion and the author of the books Modern Java Recipes (O'Reilly), Gradle Recipes for Android (O'Reilly), and Making Java Groovy (Manning). He is a regular speaker on the No Fluff, Just Stuff Tour, and teaches training classes in areas related to Java, including Spring, Hibernate/JPA, Groovy, Grails, Gradle, and Android.","twitter_name":"kenkousen","avatar_path":null}]},{"id":1914,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"JVM Languages","title":"Why Clojure?","track":"JVM Languages","type":"lecture","abstract":"You may have heard of Clojure and are wondering what the hype is all about, or may even even have played with it, but you still don't see what the fuss is all about. Either way, if you are curious about Clojure, then this is the talk for you.\r\n\r\nIn this session we will explore some facets of Clojure the language - we will attempt to see what sets us apart from other languages on the JVM, and perhaps give you a few more reasons to both explore, and hopefully consider Clojure for your next home, or work project.","persons":[{"id":115,"full_public_name":"Raju Gandhi","abstract":"I am a Software Craftsman with over a decade of experience building Web Applications and Enterprise Software and I love to build great software","twitter_name":"looselytyped","avatar_path":"/system/avatars/115/large/me2_400x400.png?1409064068"}]},{"id":1947,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"JVM Languages","title":"Busy Java Developer's Guide to Being a JVM Polyglot","track":"JVM Languages","type":"lecture","abstract":"In recent years, the term 'polyglot'--meaning 'many languages', or 'being fluent in many languages'--has come to the world of programming. Neal Ford first coined the term 'polyglot programming' as one who uses multiple languages collectively as a way to build systems. And the JVM is a perfect platform on which to do this: not only do we see several languages (Groovy, Scala) becoming JVM markets in their own right, but a whole host of new languages keep appearing on the JVM, opening up new opportunities. In this talk, we'll go over several of the different languages running on top of the JVM, going over a little bit of their history, their goals, their features, what makes them interesting, and how a Java developer might consider using them. Some will be ports of other languages, some will be influenced by other languages, but all are guaranteed to run on the JVM and thus be relevant to a Java developer who--despite the changes that came in 8 and are coming in 9--is interested in using more than Java but still remaining relevant to his or her day job.","persons":[{"id":773,"full_public_name":"Ted Neward","abstract":"Computational philosopher: techno-jargon for I am a big geek. Currently Director of Developer Relations at Smartsheet.","twitter_name":"@tedneward","avatar_path":"/system/avatars/773/large/javapolis_400x400.png?1511207937"}]}],"Mobile":[{"id":1447,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Mobile","title":"Going Web Native","track":"Mobile","type":"podium","abstract":"In this talk, we'll take a look at the evolving Web platform and how it's becoming possible to build applications that rival native apps in usability and functionality, while still maintaining the best parts of Web – low friction and simple sharing. ","persons":[{"id":531,"full_public_name":"Marcus Hellberg","abstract":"Marcus Hellberg is a developer advocate at Vaadin. He works with modern web technologies like Web Components and Progressive Web Applications. His background is in embedded systems but has worked on everything web related for the past 11+ years. ","twitter_name":"marcushellberg","avatar_path":"/system/avatars/531/large/MarcusHellberg-square.jpeg?1492464669"}]},{"id":1423,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Mobile","title":"Swift - Beyond Beginner","track":"Mobile","type":"podium","abstract":"It’s easy to know “just enough” Swift to get by for making an iOS app, but don’t miss out on the great long-term benefits of diving deeper into the language. Let’s discuss proper design techniques and language idioms that will make your code clean, maintainable, and just plain awesome.","persons":[{"id":75,"full_public_name":"Patrick Seda","abstract":"Patrick is CTO of Colligo Vox, a Mobile solutions consulting company in Atlanta. With 30 years of professional experience, he orchestrates and implements successful mobile initiatives ranging from Big Enterprise to children’s educational games. Along with his focus of delivering bullet-proof, awesomely kickass solutions, he educates the development community via meetups and the techMatters.fm podcast.","twitter_name":"pxtrick","avatar_path":"/system/avatars/75/large/patrickTM_490.png?1506458619"}]},{"id":1865,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Mobile","title":"Kotlin-Class Destroyer","track":"Mobile","type":"lecture","abstract":"In Java, almost everything has to be a class or within a class. In Kotlin, there are several mechanisms for writing code without explicitly introducing classes. The talk will show examples using functions as first-class citizens, higher-order functions, operators, extensions, and property delegation.","persons":[{"id":425,"full_public_name":"Bolot Kerimbaev","abstract":"Android and iOS Sensei at Big Nerd Ranch","twitter_name":"bolot","avatar_path":"/system/avatars/425/large/bolot_headshot_800.png?1470087835"}]},{"id":2051,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Mobile","title":"What's New in Android O?","track":"Mobile","type":"lecture","abstract":"Android O was announced this past spring at Google IO 2017. Drop in to hear a rundown of all the new and exciting features that you as a developer can take advantage of in the new O release. From the new AutoFill of forms to PiP, Picture in Picture, to API change goodness. Of course more updates around Notifications! Can we say OpenJDK? That alone is huge! You will also get the latest on Android IDE and build tools.","persons":[{"id":99,"full_public_name":"Douglas Knudsen","abstract":"As a Platform Technical Advisor and Lead, Douglas brings over fifteen years of building highly visible solutions in the enterprise and consumer spaces spanning financial institutions such as Nasdaq to educational stalwarts like Pearson to technology giants like RIM. Douglas is currently focused at enabling teams to deliver mobile solutions on the Android platform and advising on technical challenges faced.  In his off hours, you can find Douglas speaking at local user groups on technology in the Atlanta area when not teaching young kids fun Mathematics and Science topics.","twitter_name":"douglasknudsen","avatar_path":"/system/avatars/99/large/doug_small_400x400.jpg?1468858447"}]},{"id":1295,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Mobile","title":"Rapid React Native","track":"Mobile","type":"lecture","abstract":"Building react native apps seem great!  Is it a fad?  Is it actually easy?  The best way to find out is a quick tour of how to build a react native app.  Revisit the feeling of rapid application development!","persons":[{"id":471,"full_public_name":"Gant Laborde","abstract":"Inspirational technology strategist.  Tinkerer at heart, but with a passion to ship a quality product at the end.  Love leadership and teaching has driven me to many conferences worldwide.","twitter_name":"gantlaborde","avatar_path":"/system/avatars/471/large/gant-face.jpg?1484858603"}]},{"id":1594,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"Mobile","title":"Enterprise Mobile App Hybrid Development ","track":"Mobile","type":"lecture","abstract":"This talk goes behind the scenes of an enterprise-level MyAccount Mobile App for a wireless company that was developed using the hybrid approach. It gives a high-level technical overview of the convoluted ecosystem that is made up of a mix of new and legacy components.  It then dives into the details of Apache Cordova which \"wraps\" the regular web app and transforms it into the mobile app.  It will also highlight and demonstrate the deployment and testing aspects during the integration cycle, and will show the steps of how to use the Android debugger, adb, to perform device-level debugging to solve an SSL certificate issue.","persons":[{"id":762,"full_public_name":"windust","abstract":"","twitter_name":"fguime","avatar_path":null},{"id":855,"full_public_name":"Mary Grygleski","abstract":"A passionate software technologist who appreciates good craftsmanship and desires to be a contributor to making people's lives better through technology.","twitter_name":"@mgrygles","avatar_path":null}]}],"Patterns & Design":[{"id":1430,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Patterns & Design","title":"Generate code that doesn't suck","track":"Patterns & Design","type":"lecture","abstract":"We all hate generated code, sometimes the need for it outweighs the pains. I’ll discuss some of the common pitfalls of why we hate it and how to avoid those issues. This talk takes a look at how you can generate code using a Swagger/OpenAPI spec that looks like something you would want to use.","persons":[{"id":807,"full_public_name":"Brian Demers","abstract":"Brian Demers is a PMC member for the Apache Shiro project. Brian spends much of his day contributing to Shiro in the form of writing code, tutorials, blogs, and answering questions.  He first started working with Shiro (then JSecurity) while working on Sonatype’s Nexus.  Along with typical software development Brian also has a passion for fast builds an automation.","twitter_name":"BrianDemers","avatar_path":"/system/avatars/807/large/gravatar.jpeg?1506473474"}]},{"id":1492,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Patterns & Design","title":"Intermediate Git","track":"Patterns & Design","type":"lecture","abstract":"Git is key to many developers' workflows. But understanding the mental model behind Git requires some work and its commands are not always intuitively-named. In other words, Git can be hard to learn. To address this, this class will cover merge vs rebase, uses of rebase, reflog, reset and cherry-pick, and a few tips and tricks. ","persons":[{"id":763,"full_public_name":"Amanda Olsen","abstract":"UI Engineer with a desire to know everything (turns out this is impossible), an appreciation of clearly-written instructions, a love for JavaScript, a love for visuals and their role in our understanding, a deep joy in aesthetics, and a mild addiction to explaining things.","twitter_name":"AmandaLaine_UX","avatar_path":"/system/avatars/763/large/olsenPic.JPG?1510951615"}]},{"id":1515,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Patterns & Design","title":"Multi-platform Enterprise Messaging with RabbitMQ","track":"Patterns & Design","type":"lecture","abstract":"To introduce attendees to the basics of messaging queues, their goals and applications from CFML.  Messaging enables software applications to connect and scale. Thus, providing applications to connect to each other as components of a larger application, or to user devices and data. Messaging is asynchronous, and can decouple your software concerns with ease.  However, messaging is much more than the traditional publish/subscribe patterns but also the ability to create work queues, routing and much more.\r\n","persons":[{"id":845,"full_public_name":"Luis Majano","abstract":"Luis Majano is a Computer Engineer born in El Salvador and is the president of Ortus Solutions (www.ortussolutions.com), a consulting firm specializing in web development, architecture and professional open source support and services.  His background includes over 17 years of software development experience, architecture and system design. \r\n\r\nHe is the creator of the ColdBox MVC Platform, TestBox BDD, ContentBox Modular CMS and many more open source projects.  He is an Adobe Community Professional and lives in Texas with his beautiful wife Veronica, baby girl Alexia and baby boy Lucas! \r\n\r\n","twitter_name":"lmajano","avatar_path":"/system/avatars/845/large/Screen_Shot_2017-09-30_at_12.18.23_PM.png?1506792095"}]},{"id":1857,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Patterns & Design","title":"When developer must become designer","track":"Patterns & Design","type":"lecture","abstract":"As a developer with limited resources, experience, and time, how can you embrace your inner UX designer? What is UX and why should you care? Is there really a difference between UX and UI? Which design tools should you use?\r\n\r\nIn this session I’ll provide you a UX checklist to take you from developer to designer/developer.","persons":[{"id":467,"full_public_name":"Angel Banks","abstract":"Angel Banks specializes in UX strategy and design for enterprise, finance, healthcare, and biotech applications. She has a background in front-end development, project management, and product management. Active in the Atlanta tech community, she is Director of Women Who Code Atlanta, Curriculum Director of Girl Develop It Atlanta, and co-organizer of ngAtlanta and We RISE tech conferences. ","twitter_name":"angelmbanks","avatar_path":"/system/avatars/467/large/angel_bio.jpg?1484333139"}]},{"id":1884,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Patterns & Design","title":"Bootiful Testing","track":"Patterns & Design","type":"lecture","abstract":"How would you feel if you knew that any pat of the code was at most a few minutes away from being shippable and delivered into production? How would you feel if you knew that any part of the code is a few ctrl+z's away from being shippable and delivered into production? Emboldened and confident? Test driven development (TDD) gives you that. TDD allows you to proceed with confidence that you're building the right thing. It provides you with imminent-horizons that you can meet and measure. TDD gives developers the confidence to go faster, secure in the knowledge that what they break they will fix and be able to improve. In this talk, join Spring Developer Advocate Josh Long (@starbuxman) as he looks at how to test Spring applications and services. We'll look at how to test basic components, mocks, how to take advantage of test slices, and how to test web applications. We'll also look at how to ensure that API producers and API consumers work well together using consumer driven contract testing (CDCT) without sacrificing the testing pyramid for end-to-end integration tests.\r\n\r\n","persons":[{"id":1030,"full_public_name":"joshlong","abstract":"Josh (@starbuxman) is the Spring Developer Advocate at Pivotal. Josh is a Java Champion, author of 5 books (including O'Reilly's Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry) and numerous best-selling video trainings (including Building Microservices with Spring Boot Livelessons with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring Integration, Spring Cloud, Activiti and Vaadin). \r\n","twitter_name":"starbuxman","avatar_path":"/system/avatars/1030/large/josh.png?1510325739"}]},{"id":1370,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"Patterns & Design","title":"Beautiful SDK Design in Java for APIs","track":"Patterns & Design","type":"lecture","abstract":"Often times Java SDKs for APIs look more like the API they represent than idiomatic Java.\r\n<p/>\r\nThis talk examines how great SDKs are built using design patterns.\r\n<p/>\r\nIt covers: enforced separation of Java api and implementation, use of generics, a caching layer and hiding network traffic.","persons":[{"id":772,"full_public_name":"Micah Silverman","abstract":"Developer, Maker, Tinkerer, Movie, TV and Gaming Nerd","twitter_name":"afitnerd","avatar_path":"/system/avatars/772/large/__Projects_StormPath_JavaRoadStorm2016_images_fjr1300.jpg?1505750595"}]}],"Performance":[{"id":1505,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Performance","title":"Asynchronous API with CompletableFuture: Performance Tips and Tricks ","track":"Performance","type":"","abstract":"Since Java 8, CompletableFuture has enabled asynchronous, future-based programming in Java and is one of the most powerful features suitable for creating asynchronous APIs. This presentation, based on real project experience, goes beyond the CompletableFuture public API. It reveals internal details and shows who stands to benefit from it for better performance.","persons":[{"id":837,"full_public_name":"Sergey Kuksenko","abstract":"Sergey Kuksenko is a Java Performance Engineer at Oracle working on a variety of Java and JVM performance enhancements. He joined Oracle in 2010 and OpenJDK/OracleJVM is the third JVM in his experience. His begun working as Java Engineer in 1996 and as Java Performance Enginner in 2005. He has had a passion for exploring how Java works on modern hardware. ","twitter_name":"@kuksenk0","avatar_path":"/system/avatars/837/large/skuksenko.jpg?1510787796"}]},{"id":1760,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Performance","title":"Tuning G1GC","track":"Performance","type":"lecture","abstract":"G1GC is now the default collector in Java 9. In this session we will explore how the collector functions and what can be done to tune it to better suite your applications demands.","persons":[{"id":938,"full_public_name":"Kirk Pepperdine","abstract":"Kirk is a co-founder of jClarity, a company building the next generation of application diagnostic tooling. He is the author of jPDM, a performance diagnostic model that help people to quickly identify the root cause of performance regressions.","twitter_name":"kcpeppe","avatar_path":"/system/avatars/938/large/kirk-thumb.jpg?1510757491"}]},{"id":1480,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Performance","title":"Performance Pipeline and Java Performance Tools","track":"Performance","type":"lecture","abstract":"This session describes the performance pipeline, a concept of mapping performance-related work and activities toward the stages of a software delivery pipeline. It demos a range of performance tools you can use throughout the application lifecycle.","persons":[{"id":827,"full_public_name":"Simon Maple","abstract":"Simon is the Director of Developer Relations at ZeroTurnaround, a Java Champion since 2014, JavaOne Rockstar speaker in 2014, Duke’s Choice award winner, Virtual JUG founder and organiser, London Java Community co-leader and RebelLabs author.","twitter_name":"sjmaple","avatar_path":"/system/avatars/827/large/Simon-Speaker.jpg?1506706949"}]},{"id":1629,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Performance","title":"Collections.compare(JDK, Eclipse, Guava, Apache...)","track":"Performance","type":"lecture","abstract":"Collections are a staple in any programming language: the need to collect, sort, or iterate over values is needed by nearly all developers. The Java language introduced the Collections framework long ago. It has plenty to offer, but many find it lacking: the number of collection libraries as active open source projects demonstrates the need for something else. This session does a holistic comparison of the most-common collections (pun intended!) frameworks, what they have to offer, and what you should consider for your next project. It also shows common programmer use cases; how each library handles them; and the impact on memory, processing power, and ease of use/coding. Come and let us help you choose the right bag for your tricks!","persons":[{"id":1005,"full_public_name":"Donald Raab","abstract":"Donald Raab works in the Application Platform and Services team at BNY Mellon in the Jersey City Innovation Center. Donald is a member of the Java Specification Request (JSR) 335 Expert Group and has presented at JavaOne, Devoxx US, EclipseCon, GIDS and the JVM Language Summit. He created the Eclipse Collections Java library which was originally open sourced as GS Collections in 2012 and migrated to the Eclipse Foundation in 2015.","twitter_name":"@TheDonRaab","avatar_path":"/system/avatars/1005/large/PZjOBoO9_400x400.jpeg?1510755909"},{"id":884,"full_public_name":"Nikhil Nanivadekar","abstract":"Nikhil Nanivadekar is a Vice President in Private Wealth Management in the Technology division of Goldman Sachs. Nikhil is the project lead and committer for Eclipse Collections and has presented at JavaOne, DevoxxUS and Java User Group meetups. He is passionate about robotics has conducted robotics workshops at JCrete4Kids, JavaOne4Kids and Devoxx4Kids. Nikhil graduated in 2012 from University of Utah with a Masters in Mechanical Engineering with specialization in Robotics and Controls. Nikhil was inducted in the Oracle Developer Champions program in 2017.","twitter_name":"nikhilnanivade","avatar_path":null}]},{"id":1675,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Performance","title":"Graal VM: High-Performance Polyglot Runtime","track":"Performance","type":"","abstract":"We present how the Graal project enhances the Java ecosystem with an integrated, polyglot, high-performance execution environment for dynamic, static, and native languages. Graal supports Java, Scala, Kotlin, Groovy, and other JVM-based languages. At the same time, it can run the dynamic scripting languages JavaScript including node.js, Ruby, R, and Python. Furthermore, it integrates C, C++, and other LLVM-based native languages into the same runtime environment. Graal can either run embedded in the Java HotSpot VM or as a standalone alternative with low footprint and fast startup for embedded or serverless computing environments. This talk covers the architecture of Graal and gives live demonstrations of its unique capabilities.\r\n","persons":[{"id":1174,"full_public_name":"Oleg Šelajev","abstract":"Lead Developer Advocate for Graal at OracleLabs","twitter_name":"shelajev","avatar_path":"/system/avatars/1174/large/oleg-devoxx-face.jpg?1518181811"}]},{"id":1609,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"Performance","title":"Garbage collection in Java 9","track":"Performance","type":"lecture","abstract":"An overview of the JVM memory model in Java 9 as well as a discussion of all JVM options and flags to tweak the JVM GC and memory.","persons":[{"id":879,"full_public_name":"Chandra Guntur","abstract":"Java geek. Spring Boot and Cloud enthusiast. Organizer, presenter at NYJavaSIG and co-chair of the NYJavaSIG Hands-On-Workshop (HOW). Love coding in Smalltalk, getting to love Java over the past 20+ years.","twitter_name":"@CGuntur","avatar_path":"/system/avatars/879/large/chandra_portrait.png?1510811166"}]}],"Security":[{"id":1293,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Security","title":"Adaptive Threat Modeling","track":"Security","type":"lecture","abstract":"Security should always be built with an understanding of who might be attacking and how capable they are. Typical threat modeling exercises are done with a static group of threat actors applied in “best guess” scenarios. While this is helpful in the beginning, the real data eventually tells the accurate story. The truth is that your threat landscape is constantly shifting and your threat model should dynamically adapt to it. This adaptation allows teams to continuously examine controls and ensure they are adequate to counter the current threat actors. It helps create a quantitative risk driven approach to security and should be a part of every security teams tools.","persons":[{"id":713,"full_public_name":"Aaron Bedra","abstract":"Aaron Bedra is the founder of Modeled Thinking, where he works at the intersection of software, security, and business. He has served as a Chief Security Officer, Chief Technology Officer, and Principal Engineer/Architect. He has worked professionally on programming languages, most notably Clojure and ClojureScript. Aaron is the creator of Repsheet, an open source threat intelligence toolkit. He is the co-author of Programming Clojure, 2nd and 3rd Edition and a contributor to Functional Programming: A PragPub Anthology.","twitter_name":"abedra","avatar_path":"/system/avatars/713/large/generic.jpeg?1504454641"}]},{"id":1448,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Security","title":"The Anatomy of Java Vulnerabilities","track":"Security","type":"lecture","abstract":"In this talk we’ll cover all aspects of Java Vulnerabilities. We’ll explain why Java has this dubious reputation, what’s being done to address the issues and what you have to do to reduce your exposure. You’ll learn about Java vulnerabilities in general: how they are reported, managed and fixed as well as learning about the specifics of attack vectors and just what a ‘vulnerability’ actually is. ","persons":[{"id":816,"full_public_name":"Steve Poole","abstract":"Steve Poole is a Developer Advocate, DevOps practitioner  and a long time IBM Java developer, leader and evangelist. He’s been working on Java SDKs and JVMs since Java was less than one year old. ","twitter_name":"spoole167","avatar_path":null}]},{"id":2090,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Security","title":"Attackers have the first mover advantage. Let's close that gap.","track":"Security","type":"lecture","abstract":"Bad hygiene is a bigger problem that you think -- Equifax is not alone\r\n\r\n46,557 organizations downloaded a vulnerable versions of Struts in the past 12 months.  These components were downloaded 912,359 times.  1000 organizations downloaded vulnerable Struts versions more than 100 times.\r\n\r\nThe most critical vulnerability announcements with Struts2 were discovered in 2013 and 2017.  In the past 12 months, over 3,053 organizations downloaded the CVE-2017-xxxx vulnerable Struts components; over 100,000 downloads were recorded.  These are the same vulnerable components used to break into Equifax.\r\n\r\nThe only way to counter the inevitable bugs and vulnerabilities is to ensure you are able to respond and remediate quickly. Come find out how to do that.","persons":[{"id":1163,"full_public_name":"Brian Fox","abstract":"Co-founder and CTO at Sonatype, Brian Fox is a member of the Apache Software Foundation and former Chair of the Apache Maven project. As a direct contributor to the Maven ecosystem, including the maven-dependency-plugin and maven-enforcer-plugin, he has over 20 years of experience driving the vision behind, as well as developing and leading the development of software for organizations ranging from startups to large enterprises. Brian is a frequent speaker at national and regional events including Java User Groups and other development related conferences.","twitter_name":"brian_fox","avatar_path":"/system/avatars/1163/large/fox-2016-1-sq-200.jpg?1516304578"}]},{"id":1349,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Security","title":"Container Security","track":"Security","type":"lecture","abstract":"Container Strategy is on every enterprise's agenda. While we are thinking of deploying your workloads as containers, we should also understand that \"Containers don't contain\". \r\nIn this session you will learn the challenges with container security and how you can secure your applications. You will learn why HostOS plays a key role in securing your containers, the role a container platform would play, ensuring container security while building them etc.\r\n","persons":[{"id":719,"full_public_name":"Veer Muchandi","abstract":"Veer Muchandi is a Principal Architect and Container/PaaS evangelist with RedHat. Specializes in Containerization, Microservices, PaaS and DevOps. Spreading awesomeness of OpenShift, an enterprise ready Kubernetes Platform to run your container workloads. Well known blogger, teacher, and speaker. Veer also runs OpenShift-Kubernetes meet up group in Atlanta.","twitter_name":"@VeerMuchandi","avatar_path":"/system/avatars/719/large/Photo.jpg?1505238438"}]},{"id":1534,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Security","title":"How FIDO U2F Security Keys Work","track":"Security","type":"lecture","abstract":"Whether you're an independent app developer, or an IT manager for a lagre enterprise, effective user authentication is a critical part of securing your data and infrastructure.  Passwords are not enough any more, multi-factor auth is a must.  This talk will take a deep dive into how FIDO U2F security keys work, and how they defend against phishing attacks.","persons":[{"id":849,"full_public_name":"Jen Tong","abstract":"Jen is a Security Advocate on Google Cloud Platform. In this role she helps developers and IT professionals stay out of trouble while getting the most out of cloud computing. If she’s away from her laptop, she’s probably skating around a roller derby track, or hanging from aerial silk.","twitter_name":"MimmingCodes","avatar_path":"/system/avatars/849/large/jtong-2016-3000px.jpg?1506801838"}]},{"id":1551,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"Security","title":"Spring Security 5.0: The Reactive Parts","track":"Security","type":"","abstract":"The continued growth of Internet of Things (IoT) and mobile has forced applications to scale in unprecedented ways. The desire to easily scale an application has also moved many applications onto Infrastructure as a Service (IaaS) which charges for every single resource. Reactive applications have become popular because they can scale with less resources.\r\n\r\nSwitching from threaded to reactive programming can be daunting. This complexity is compounded when you need to secure your application in a world where every day brings the next big security breach. If you are committed to a reactive architecture but are blocked on how to secure it, then this talk is for you.\r\n\r\nIn this talk Rob will demonstrate how to use the new reactive support in Spring Security 5. We will start with a simple application and incrementally secure it. Along the way we will learn answers to frequently asked questions, how to leverage the full power of Spring Security, and how to properly architect security in our reactive application.\r\n","persons":[{"id":796,"full_public_name":"Rob Winch","abstract":"Rob Winch is employed by Pivotal as the project lead of security related projects within Spring. He is also a committer on the core Spring Framework and co-author of the Spring Security 3.1 book. In the past he has worked in the health care industry, bioinformatics research, high performance computing, and as a web consultant. When he is not sitting in front of a computer he enjoys playing the guitar.","twitter_name":"rob_winch","avatar_path":"/system/avatars/796/large/profile.jpg?1510604717"}]}],"Serverless and Cloud":[{"id":1753,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Serverless and Cloud","title":"Microservices? Serverless is the answer!","track":"Serverless and Cloud","type":"lecture","abstract":"Event Driven Architectures (EDA) are becoming popular and serverless architectures seem like the next implementation technique for this system architecture. In this talk we will compare the serverless and microservices implementations of an event driven system along multiple cross functional requirements.","persons":[{"id":951,"full_public_name":"Karun Japhet","abstract":"Karun Japhet is a tech lead, developer, and quality advocate at ThoughtWorks. Over the past nine years, he has worked on realizing value for his clients through the creation of highly scaleable applications and integration of large enterprise applications.","twitter_name":"javatarz","avatar_path":"/system/avatars/951/large/IMG_8145.jpg?1508369810"}]},{"id":1943,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Serverless and Cloud","title":"Spring Skills: Building voice applications with Spring and Alexa","track":"Serverless and Cloud","type":"lecture","abstract":"Learn to build voice UIs for your Spring applications.","persons":[{"id":1083,"full_public_name":"Craig Walls","abstract":"Spring Developer and a author of Spring in Action.","twitter_name":"habuma","avatar_path":"/system/avatars/1083/large/247032_10150611073575580_4897903_n.jpg?1511136831"}]},{"id":1374,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Serverless and Cloud","title":"Serverless Architecture Patterns and Best Practices","track":"Serverless and Cloud","type":"lecture","abstract":"Serverless computing allows you to build and run applications without the need for provisioning or managing servers. AWS Lambda has changed how developers build and run their applications or services. But what are the best practices for tasks such as deployment, monitoring, and debugging in a serverless world? In this session, we’ll dive into best practices that serverless developers can use for application lifecycle management, CI/CD, monitoring, and diagnostics. We’ll talk about how you can build CI/CD pipelines that automatically build, test, and deploy your serverless applications using AWS CodePipeline, AWS CodeBuild, and AWS CloudFormation. We’ll also cover the built-in capabilities of Lambda and API Gateway for creating multiple versions, stages, and environments of your functions and APIs. Finally, we’ll cover monitoring and diagnostics of your Lambda functions with Amazon CloudWatch and AWS X-Ray.","persons":[{"id":776,"full_public_name":"Arun Gupta","abstract":"Arun Gupta is a Principal Open Source Technologist at Amazon Web Services. He has built and led developer communities for 12+ years at Sun, Oracle, Red Hat and Couchbase. He has deep expertise in leading cross-functional teams to develop and execute strategy, planning and execution of content, marketing campaigns, and programs. Prior to that he led engineering teams at Sun and is a founding member of the Java EE team.\r\n\r\nHe has extensive speaking experience in more than 40 countries on myriad topics and is a JavaOne Rock Star for four years in a row. Gupta also founded the Devoxx4Kids chapter in the US and continues to promote technology education among children. A prolific blogger, author of several books, an avid runner, a globe trotter, a Docker Captain, a Java Champion, a JUG leader, NetBeans Dream Team member, he is easily accessible at @arungupta.","twitter_name":"arungupta","avatar_path":"/system/avatars/776/large/evangelist-arun-gupta.png?1505838620"}]},{"id":1556,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Serverless and Cloud","title":"Java in Serverless Land","track":"Serverless and Cloud","type":"lecture","abstract":"Serverless and FaaS are rapidly establishing themselves as fundamental cloud services. It's a radically simple model for deployment and management of code in the cloud.\r\n\r\nAs we willingly, happily sacrifice control over infrastructure and deployment, what else have we given up? The basics of FaaS seem pretty straightforward, but I think we need new knowledge, tools and techniques to make our FaaS apps really shine.","persons":[{"id":857,"full_public_name":"Matthew Gilliard","abstract":"Matthew is a (somewhat) functional programmer who enjoys all kinds of language nerdery as well as whisky.\r\n\r\nHe currently works on open-source code at Oracle, helping to make Java in the cloud be as good as it can.  If not there, you might find him at a local meetup, teaching kids to code, or away from computers hiking and running in Southwest England.\r\n\r\nPast lives include OpenStacking, teaching English to highschoolers and a whole lot of Clojure and Java.","twitter_name":"mjgilliard","avatar_path":"/system/avatars/857/large/gilliard.jpg?1511361462"}]},{"id":1555,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Serverless and Cloud","title":"Building a Serverless State Service for the Cloud with Java 9","track":"Serverless and Cloud","type":"lecture","abstract":"While application architectures are evolving to become stateless, application state and state management are naturally emerging as a service in themselves. This session outlines the development, operation, and maintenance of an application state service for the cloud with Java 9, using a serverless strategy. The presentation investigates some of the challenges of designing an infinite-capacity, infinite-processing platform capable of reliably running everything from the smallest application to a globally distributed enterprise-class infrastructure for the mobile and IoT domains. ","persons":[{"id":856,"full_public_name":"Ed Burns","abstract":"Ed Burns is a Consulting Member of the Technical Staff at Oracle America, Inc. and has worked on a wide variety of client and server side web technologies since 1994, including NCSA Mosaic, Mozilla, the Sun Java Plugin, Jakarta Tomcat and, most extensively, JavaServer Faces, on which he is the co-spec lead. Ed is also the co-spec lead for the Servlet specification. Ed is an experienced international conference speaker, with consistently high attendence numbers and ratings at JavaOne (Rockstar award winner 2016), Devoxx, DevNexus, JAOO, JAX, W-JAX, No Fluff Just Stuff, JA-SIG, The Ajax Experience, and Java and Linux User Groups. He has published four books with McGraw-Hill, JavaServerFaces: The Complete Reference (2006), Secrets of the Rockstar Programmers: Riding the IT crest (2008) JavaServer Faces 2.0: The Complete Reference (2010) and Hudson Continuous Integration In Practice (2013).\r\n\r\nEd is a frequent speaker at international industry conferences, having presented many times at Oracle's JavaOne conference, given keynote addresses at the W-JAX and JAX conferences in Germany, the Globalcode Developer's Conference in Sao Paulo, Brazil, the JSF Days and CONFESS Conferences in Vienna, Austria, the DOAG Conference in Nuremberg, Germany, and also has spoken at numerous Java User Group meetings and the No Fluff Just Stuff Java Symposium. ","twitter_name":"edburns","avatar_path":"/system/avatars/856/large/edburns-201311.jpg?1506843332"}]},{"id":2054,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"Serverless and Cloud","title":"A Look Back at Enterprise Integration Patterns and Their Use into Today's Serverless Computing","track":"Serverless and Cloud","type":"lecture","abstract":"Functions, and the so called serverless computing have freed deveopers from worring about infrastructure, and even upper platform layers, as well some steps in the software development lifecycle. But once you have functions deployed, how do they interact with each other? How message navigates between them? Maybe, just maybe, it's time to look back again at EIPs - Enterprise Integration Patterns, and their use in this new way of deploying code to the Cloud. This talk will cover primarily the use of one of the key EIP frameworks - Apache Camel - and top patterns applicable to Serverless Computing using Functions services by Cloud vendors as part of the demonstrations. ","persons":[{"id":1147,"full_public_name":"Bruno Borges","abstract":"From Brazil to the world! Bruno Borges has over 16+ years of experience as an enterprise application developer, doing most of his code in Java, Javascript, and SQL. Since 2012 is Oracle’s Principal Product Manager responsible of Developer Relations Strategy for Oracle Cloud, Java, Databases, governance of open source projects on GitHub, and all things application development with Oracle technologies. You can find him on Twitter @brunoborges. To know more about the Oracle Developer Community, follow @oracledevs.\r\n\r\nBruno Borges has over 16+ years of experience as a developer and conference speaker, and since 2012 is Oracle’s Principal Product Manager responsible for Developer Engagement on Oracle Cloud Platform, Java, and related technologies for application development. You can find him on Twitter @brunoborges.","twitter_name":"brunoborges","avatar_path":"/system/avatars/1147/large/18905_10153002948318877_4986522001590787689_n.jpg?1513106255"}]}],"Room 15":[],"Sidney Marcus":[{"id":1875,"date":"2018-02-22T09:00:00-05:00","start":"09:00","duration":"01:00","room":"Sidney Marcus","title":"Designing and Visualizing Deep Space Manned Missions","track":"Keynote or 2nd Stage","type":"lecture","abstract":"Humanity is entering a new age of space exploration focusing beyond Earth orbit. Deep space mission design organizations such as NASA face new mission goals with complex custom computing and visualization requirements. Modern technology platforms such as JavaFX and Java 8 enable these intricate workflows.  The complexities of trajectory design within deep space regimes will be discussed.  Examples range from missions to liquid-rich worlds such as Europa and Enceladus, but also humanity's return to the Moon via excursion missions to the planned Deep Space Gateway. \r\nScience orbits in these vicinities involve significant computational challenges due to complex gravitational effects.  Demonstrations will include the Deep Space Trajectory Explorer (DSTE), software designed completely in JavaFX and Java 8 providing rapid parallel search and filtration capabilities. Custom hardware-accelerated visualizations are used to visually identify trajectory solutions that exploit these dense gravity fields. The DSTE immerses the user within the design space, letting the data be the interface to the user.  Data visualizations will feature a mix of custom multilayered 2D plots and interactive 3D tools.\r\n","persons":[{"id":984,"full_public_name":"Diane Davis","abstract":"Dr. Diane Davis is an astrodynamicist and principal systems engineer with NASA and USAF aerospace industry leader a.i. solutions. She designs spacecraft orbits with the Future Capabilities Team at Johnson Space Center in Houston, TX, and previously navigated spacecraft to Mars and comets at the Jet Propulsion Laboratory. She is the lead researcher for the Deep Space Trajectory Explorer, a JavaFX - based, Duke's Choice Award winning design and visualization software for interplanetary orbit analysis.","twitter_name":"@dianecraigdavis","avatar_path":"/system/avatars/984/large/DavisProfile.jpg?1510718790"},{"id":1018,"full_public_name":"Sean M Phillips","abstract":"Sean Phillips is a Principal Software Engineer with NASA and USAF Aerospace industry leader a.i. solutions. Sean's specialties are data analysis and visualization using Java and JavaFX along with rich-client programming with the NetBeans Platform. Sean has created the Deep Space Trajectory Explorer, software for mission planning to deep space targets. Currently he serves as the lead software engineer for the NASA James Webb Space Telescope Flight Dynamics Ground System","twitter_name":"@seanmiphillips","avatar_path":"/system/avatars/1018/large/SeanMPhillips_Avatar.jpg?1510110519"}]}],"Nighthacking":[{"id":1382,"date":"2018-02-22T12:00:00-05:00","start":"12:00","duration":"01:00","room":"Nighthacking","title":"PANEL SESSION WITH JAVA EXPERTS ","track":"Keynote or 2nd Stage","type":"lecture","abstract":"This session includes advice on how developers can manage their careers and create opportunities for further advancement by participating in collaborative activities such as open-source development projects and participation the Java Community Process and adoption efforts.\r\n\r\nIn this session you will learn practical advice derived from our collective years of experience working with the Java Community. How developers can manage their careers and create opportunities for further advancement by participating in collaborative activities such as open-source development projects. You will also learn more about how Java is evolved and how you can participate in that evolution as an individual, as a representative of your employer, or as a member of a nonprofit organization such as a Java user group.\r\n\r\nLearn how enhance your career opportunities by making the future Java…and you’ll have fun too!","persons":[{"id":783,"full_public_name":"Heather VanCura","abstract":"Heather VanCura is Chair and Director of the JCP Program at Oracle, and is a leader of the global community driven adoption through the user group programs. Heather drives the efforts to transform the JCP program and broaden participation and diversity in the community. She is passionate about Java, women in technology and developer communities, serving as an international speaker and community organizer of developer hack days around the world. Heather enjoys speaking at conferences, such as OSCON,FOSDEM, Devnexus,  Devoxx, JFokus, and the JavaOne Conferences. She resides in the San Francisco Bay Area, California USA and enjoys trying new sports and fitness activities in her free time.\r\n\r\n","twitter_name":"heathervc","avatar_path":"/system/avatars/783/large/2016_07_10_HeatherVanCura-176-Edit.jpg?1511208772"}]},{"id":1922,"date":"2018-02-22T18:00:00-05:00","start":"18:00","duration":"01:00","room":"Nighthacking","title":"Conference Reception with the Nullpointers 2.0","track":"Keynote or 2nd Stage","type":"lecture","abstract":"Come hear Java developers play live music during the conference reception!","persons":[]}],"Frameworks":[{"id":1557,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Frameworks","title":"Build reilient microservice with Eclipse MicroProfile","track":"Frameworks","type":"lecture","abstract":"How to build configurable, resilient, monitorable Java Microservices? Eclipse MicroProfile (https://microprofile.io/) is the answer. Eclipse MicroProfile has rapidly become a rich set of technologies essential for writing configurable, fault tolerant, secure and production-ready Java Microservices. This session will give you a quick overview on the capabilities available in MicroProfile 1.2, followed by a live demo of configurable and fault tolerant microservice coding example, running on Open Liberty (https://openliberty.io/).","persons":[{"id":817,"full_public_name":"Emily Jiang","abstract":"Emily Jiang is MicroProfile Development Lead and CDI Architect for IBM. Based at IBM's Hursley laboratory in the UK, she has worked on WebSphere Application Server since 2006 and heavily involved in JavaEE 7 support in WebSphere Application Server releases. She is an active member of MicroProfile, OSGi Enterprise Expert Group and CDI Expert Group. Emily led the effort to define MicroProfile Config and Fault Tolerance programming model in MicroProfile.io. Emily is currently a Config JSR(JSR382) co-Spec lead.","twitter_name":"emilyfhjiang","avatar_path":"/system/avatars/817/large/AAEAAQAAAAAAAANRAAAAJGE5NGQ1Njc4LWNlZjgtNDdjNi1hMWUyLTcxNjEyNWZhMjQ2Zg.jpg?1510599151"}]},{"id":1707,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Frameworks","title":"Welcome to JUnit 5","track":"Frameworks","type":"lecture","abstract":"After more than a decade of waiting JUnit 5 is here! So beyond adding poop emojis to the names of my unit tests, what does JUnit 5 offer? This presentation will cover the new features coming in JUnit 5 and how to migrate your test suite to using the new version of the popular test framework.","persons":[{"id":765,"full_public_name":"Billy Korando","abstract":"Billy Korando is a software consultant with Keyhole Software. Billy has over ten years of experience in software development and has worked in the exciting industries like finance, healthcare, insurance, and shipping.","twitter_name":"@BillyKorando","avatar_path":"/system/avatars/765/large/16f4tPFd_400x400_(1).jpg?1515880568"}]},{"id":1403,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Frameworks","title":"Java EE 8 and the Open Future of Java EE - What You Need to Know!","track":"Frameworks","type":"lecture","abstract":"This session covers the details of what is in Java EE 8, the microservices features being enabled in Java EE through the MicroProfile effort as well as the Java EE open future outside the walls of Oracle in the Eclipse Foundation.","persons":[{"id":792,"full_public_name":"Reza Rahman","abstract":"Reza Rahman is a long time consultant now working at CapTech. He has been an official Java technologist at Oracle. He is the author of the popular book EJB 3 in Action. Reza has long been a frequent speaker at Java User Groups and conferences worldwide including JavaOne and Devoxx. He has been the lead for the Java EE track at JavaOne as well as a JavaOne Rock Star Speaker award recipient. Reza is an avid contributor to industry journals like JavaLobby/DZone and TheServerSide. He has been a member of the Java EE, EJB and JMS expert groups over the years. Reza implemented the EJB container for the Resin open source Java EE application server. He helps lead the Philadelphia Java User Group.","twitter_name":"reza_rahman","avatar_path":"/system/avatars/792/large/reza_mini_headshot.jpg?1506188605"}]},{"id":2056,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Frameworks","title":"Deconstructing and Evolving REST Security","track":"Frameworks","type":"lecture","abstract":"The learning curve for security is severe and unforgiving. Specifications promise infinite flexibility, habitually give old concepts new names, are riddled with extensions, and almost seem designed to deliberately confuse. For a back-end REST developer, choking all this down for the first time is mission impossible. With an aggressive distaste for fancy terminology, this session delves into OAuth 2.0 as it pertains to REST and shows how it falls into two camps: stateful and stateless.  We then detail a competing Amazon-style approach called HTTP Signatures, ideal for B2B scenarios and similar to what is use to secure all Amazon AWS API calls.  Each approach will be explored analyzing the architectural differences, with a heavy focus on the wire, showing actual HTTP messages and enough detail to have you thinking, “I could write this myself.”\r\n\r\nAs a bonus at the end, we’ll peak into a new IETF Internet Draft launched this year that combines JWT and HTTP Signatures into the perfect two-factor system that could provide a one-stop shop for business as well as mobile REST scenarios.  Come to this session if you want to go from novice to expert with a bit of humor, a big picture perspective and wire-level detail.","persons":[{"id":1149,"full_public_name":"David Blevins","abstract":"Founder of Tomitribe, veteran of Open Source Java EE in both implementing and defining JavaEE specifications for over 10 years with a strong drive to see JavaEE simple, testable and as light as Java SE. Co-Founder of OpenEJB (1999), Geronimo (2003), TomEE (2011). Member of the Java EE 7 and EJB 3.2 Expert Groups, past member of the Java EE 6, EJB 3.1, and EJB 3.0 Expert Groups. Contributing author to Component-Based Software Engineering: Putting the Pieces Together from Addison Wesley.","twitter_name":"dblevins","avatar_path":null}]},{"id":1553,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Frameworks","title":"Integration Test Coverage with JaCoCo","track":"Frameworks","type":"lecture","abstract":"Ever wondered what the test coverage is for your integration tests?  Why should you even care about it if you're already looking at unit test coverage? In this talk we'll cover why you'd want to look at this metric, and how to get started. Examples will include setting up a test server inside of docker, using the JaCoCo agent on a server, and aggregating results.","persons":[{"id":838,"full_public_name":"Janine Patterson","abstract":"Janine started with Core Java in the financial field, with a main focus on high performance, low garbage collection, and binary data interchange formats like Fix/Fast. Since then she's moved on to microservices architecture and cloud platforms. As a CJUG board member, she runs their Office Hours sessions, similar to coffee and code. She has also taught sessions at Hak4Kidz, and GOTO Junior.","twitter_name":"jtigp","avatar_path":"/system/avatars/838/large/Janine_Avatar_-_1.png?1511399810"}]},{"id":1292,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"Frameworks","title":"Full-stack Reactive Java with Project Reactor & Spring Boot 2","track":"Frameworks","type":"lecture","abstract":"Want to know more about reactive programming & especially reactive Java? Learn about the reactive streams initiative, Project Reactor, and how Spring 5 & Spring Boot 2 integrate a fully reactive model throughout the entire stack. LIVE CODING & testing take attendees past the theoretical and into real understanding.","persons":[{"id":712,"full_public_name":"Mark Heckler","abstract":"Mark Heckler is a Pivotal Principal Technologist & Spring Developer Advocate, conference speaker, published author, & Java Champion focusing upon developing innovative production-ready software at velocity for the Cloud and IoT applications. He has worked with key players in the manufacturing, retail, medical, scientific, telecom, and financial industries and various public sector organizations to develop and deliver critical capabilities on time and on budget. Mark is an open source contributor and author/curator of a developer-focused blog (https://www.thehecklers.com) and an occasionally interesting Twitter account (@mkheck).","twitter_name":"@mkheck","avatar_path":"/system/avatars/712/large/MarkAndHisTARDIS.JPG?1504387244"}]}],"Agile":[{"id":1944,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Agile","title":"Why Isn’t Clean Coding Working for My Team?","track":"Agile","type":"lecture","abstract":"Teams fail to achieve the full benefit of the \"clean code\" approach when they focus on the code and neglect the Agile process. The full title of Uncle Bob's \"Clean Code\" book is \"Clean Code: A Handbook of Agile Software Craftsmanship\".  This talk presents an depth look at necessary relationship between Clean Code software craftsmanship and the Agile methodology, identifies common scenarios and situations where teams may fall short of recognizing and respecting that relationship, and provides practical recommendations for achieving a fully integrated process of Agile Software Craftsmanship.","persons":[{"id":1071,"full_public_name":"Rob Curry","abstract":"I am a Java, Agile, and Clean Code advocate that is not afraid of databases, RESTful web services, or warm, gooey cookies.  I enjoy working with Agile teams to deliver reliable, useful services and applications to our end users and customers.","twitter_name":"","avatar_path":null}]},{"id":1308,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Agile","title":"Stop complaining and start learning!","track":"Agile","type":"lecture","abstract":"Retrospectives are the core of agility. And yet they are the agile ceremony that is most frequently skipped. Many teams like the idea of the retrospective but find them boring, or worse ineffective. But it doesn't have to be this way. Good retrospectives <i>are</i> possible. And institutionalizing good retrospective hygiene at your company <i>is</i> possible. Join this talk to find out how.","persons":[{"id":725,"full_public_name":"David Horowitz","abstract":"David Horowitz is co-founder and CEO of Retrium. Retrium is the world’s first and only enterprise-ready platform for Agile retrospectives. Prior to co-founding Retrium, David spent nearly a decade between The World Bank and International Finance Corporation as a software developer turned Agile coach. While there, he experienced firsthand the importance — and difficulty — of effective retrospectives at scale.\r\n\r\nIn addition to Bachelor’s degrees in Computer Science and Economics from The University of Maryland, David has a Master’s degree in Technology Management from The University of Pennsylvania and The Wharton School of Business. In 2013, he successfully founded and exited a movie search engine business.\r\n\r\nDavid is married to his college sweetheart and is the father of three little ones.","twitter_name":"ds_horowitz","avatar_path":"/system/avatars/725/large/IMG_3443.jpg?1504637019"}]},{"id":1578,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Agile","title":"How to Hire Good Programmers","track":"Agile","type":"lecture","abstract":"Few things will ruin a great team faster than a bad hire so how do you recognize a talented software developer in a 30-minute interview? The traditional method of hiring programmers is to hire based on what they know. I will argue that you should instead hire a programmer based on what they can learn.","persons":[{"id":332,"full_public_name":"Jennifer Bland","abstract":"Jennifer Bland is a Senior Software Developer for Hearst Autos, specializing in MEAN stack development. She has more than ten years of development experience working for companies like CNN, Coca-Cola and Apple Computer. Jennifer is the author of the book “Developing e-Business Applications Using Lotus Domino on the AS/400\", published by IBM.\r\n\r\nShe runs the website codeprep.io which provides interview questions to assist programmers in preparation for job interviews. Her personal website is jenniferbland.com.\r\n\r\nJennifer holds a B.A. in History from Furman University and an MBA from San Jose State University.\r\n","twitter_name":"ratracegrad","avatar_path":"/system/avatars/332/large/Jennifer-Bland-headshot.jpg?1494079160"}]},{"id":1659,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Agile","title":"Fostering the Third Way - Your DevOps Dojo","track":"Agile","type":"lecture","abstract":"Using ‘The Third Way’ from Gene Kim’s ‘The Phoenix Project’, Dojos are ways for teams to invest in continual learning. In this session, we explain why and how Dojos help teams bond around product, foster rapid experimentation, and reframe small failures as learning.","persons":[{"id":897,"full_public_name":"Joel Tosi","abstract":"Just a dude helping organizations improve their product delivery ","twitter_name":"joeltosi","avatar_path":null}]},{"id":1568,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Agile","title":"Modern software craftsmanship","track":"Agile","type":"lecture","abstract":"Software craftsmanship began as a belief that our industry would work brilliantly if it was modelled on the medieval craft guilds of Europe. This metaphor proved popular enough that a community grew around it. As the community has grown, the meaning of software craftsmanship has evolved into something new. In this talk I'll look at the ways in which software craftsmanship has evolved and what it means to be a software crafter today.","persons":[{"id":863,"full_public_name":"Daniel Irvine","abstract":"I am a software consultant based in London, UK, currently working for 8th Light. I’m a member of the software craft community, and a founder and organizer of Queer Code London. As well as writing software, I enjoy mentoring others and promoting diversity & inclusion within the tech industry. I’m an occasional blogger and public speaker.","twitter_name":"d_ir","avatar_path":"/system/avatars/863/large/daniel-irvine-e2df3c6c.jpg?1506894054"}]},{"id":1510,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"Agile","title":"Where Do Ideas Come From?","track":"Agile","type":"lecture","abstract":"This session investigates where new ideas come from, how to nurture and cultivate them, and ultimately communicate them to the world at large.","persons":[{"id":711,"full_public_name":"Neal Ford","abstract":"Neal is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a software company and a community of passionate, purpose-led individuals, delivering technology to address the toughest challenges, all while seeking to revolutionize the IT industry and create positive social change. He speaks at many conferences.\r\n","twitter_name":"neal4d","avatar_path":"/system/avatars/711/large/NF.png?1512951094"}]}],"Architecture":[{"id":1899,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Architecture","title":"Software architecture for developers","track":"Architecture","type":"lecture","abstract":"The software development industry has made huge leaps in recent years; with agile, lean, software craftsmanship, evolutionary design and microservices being just a few of the buzzwords we throw around. Despite this, software development teams are often more chaotic than they are self-organising, with the resulting code being more of a mess than was perhaps anticipated. Successful software projects aren't just about good code though, and sometimes you need to step away from the IDE for a few moments to see the bigger picture. This session is about that bigger picture and is aimed at software developers who want to learn more about software architecture, technical leadership and the balance with agility. This talk will debunk some of the common myths as we look at five things every developer should know about software architecture; a guide to software architecture on modern software projects that's pragmatic rather than academic and lightweight rather than \"enterprisey\".","persons":[{"id":1041,"full_public_name":"Simon Brown","abstract":"Simon is an independent consultant specialising in software architecture, and the author of\r\n                        <a href=\"https://leanpub.com/b/software-architecture\">\"Software Architecture for Developers\"</a>\r\n                        (a developer-friendly guide to software architecture, technical leadership and the balance with agility).\r\n                        He is also the creator of the <a href=\"https://c4model.com\">C4 software architecture model</a>,\r\n                        which is a simple approach to creating maps of your code. Simon is a regular speaker at international\r\n                        software development conferences and travels the world to help organisations visualise and document their software architecture.","twitter_name":"simonbrown","avatar_path":"/system/avatars/1041/large/simonbrown.jpg?1510592530"}]},{"id":1297,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Architecture","title":"Crossing The Streams: Rethinking Stream Processing with KStreams and KSQL","track":"Architecture","type":"lecture","abstract":"All things change constantly!\r\nAnd dealing with constantly changing data at low latency is pretty hard.\r\nIt doesn't need to be that way. \r\nApache Kafka, the _de facto_ standard open-source distributed stream processing system.\r\nMany of us know Kafka's architectural and pub/sub API particulars.\r\nBut that doesn't mean we're equipped to build the kind of real-time streaming data systems that the next generation of business requirements are doing to demand.\r\nWe need to get on board with streams!","persons":[{"id":656,"full_public_name":"Vik Gamov","abstract":"Viktor Gamov is a Solution Architect at Confluent, the company behind the popular Apache Kafka streaming platform. ","twitter_name":"gamussa","avatar_path":"/system/avatars/656/large/FCBF0EE3-EDF1-453A-9A40-BEA9284711DF.jpg?1506700500"}]},{"id":1440,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Architecture","title":"Practical architecture: in-memory systems patterns - WD-40 between data and apps","track":"Architecture","type":"lecture","abstract":"Discover concrete architectural patterns to use in-memory systems (like Infinispan, Redis etc) where it makes a difference. They are versatile tools that can be used in a myriad of ways but unlike duct tape and WD-40, it’s not intuitive when and how to use them.","persons":[{"id":809,"full_public_name":"Emmanuel Bernard","abstract":"Open Source software engineer: Hibernate team and more. Chief Architect on Data at Red Hat. @lescastcodeurs founder. Java Champion etc.","twitter_name":"emmanuelbernard","avatar_path":"/system/avatars/809/large/201310EmmanuelBernardSquare.jpg?1511965961"}]},{"id":1921,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Architecture","title":"Sifting Technologies - Separating the Wheat From the Chaff","track":"Architecture","type":"","abstract":"Sifting Technologies - Separating the Wheat From the Chaff","persons":[{"id":1058,"full_public_name":"Nathaniel Schutta","abstract":"Nathaniel T. Schutta is a software architect focussed on mobile and making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. In an effort to rid the world of bad presentations, Nate coauthored the book Presentation Patterns with Neal Ford and Matthew McCullough.","twitter_name":"ntschutta","avatar_path":"/system/avatars/1058/large/nts_pic_400x400.jpg?1510766283"}]},{"id":1907,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Architecture","title":"Pragmatic Architecture","track":"Architecture","type":"lecture","abstract":"Ever wondered what a software architect is? Or what a software architecture is? Ever wondered what a software architect does? Even if you are one? In this session, we'll explore what software architecture is, what a software architect does, and why it seems nobody seems to \"get\" what software is like.","persons":[{"id":773,"full_public_name":"Ted Neward","abstract":"Computational philosopher: techno-jargon for I am a big geek. Currently Director of Developer Relations at Smartsheet.","twitter_name":"@tedneward","avatar_path":"/system/avatars/773/large/javapolis_400x400.png?1511207937"}]},{"id":1355,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"Architecture","title":"Architect as Thought Leader","track":"Architecture","type":"lecture","abstract":"Job requirements for Software Architects rarely include thought leadership, but it's a skill you'll need at some point and in this session you'll learn some practical methods to achieve success at it.","persons":[{"id":233,"full_public_name":"Burk Hufnagel","abstract":"Burk is a long-time programmer and software architect, with experience in multiple languages including Java and JavaScript. He’s presented at multiple conferences including ConnectTech, DevNexus and JavaOne, and contributed to two of the “97 Things” books published by O’Reilly. He works as a Technical Architect for Daugherty Business Solutions where he's focused on finding ways to deliver better code in less time, and teaching others how to do the same thing.","twitter_name":"@BurkHufnagel","avatar_path":"/system/avatars/233/large/Burk_390x390.png?1510112445"}]}],"Core Cloud":[{"id":1661,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Core Cloud","title":"Converging Big Data And Web Applications","track":"Core Cloud","type":"lecture","abstract":"Come see how advances in technology have allowed us to break apart the silos of data analysis (aka Big Data) and web development. Demos abound in this fun presentation. ","persons":[{"id":898,"full_public_name":"Steven Pousty","abstract":"Steve is Director of Developer Advocacy for Red Hat Middleware (aka Java Stuff). He has spoken a lot of place and is even a JavaOne Rockstar. His talks are information rich, usually with demos, and informal. ","twitter_name":"TheSteve0","avatar_path":"/system/avatars/898/large/NewGoodPhoto.jpg?1507659098"}]},{"id":1732,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Core Cloud","title":"Continuous Delivery for Data Pipelines","track":"Core Cloud","type":"podium","abstract":"Continuously delivery is central to every software-driven organization. If you're doing this today or you'd like to learn or extend the practice to \"data-centric applications\", you will find this demo-driven talk supplementing your current methods and as well as provide useful context for future developments. \r\n\r\nIn this talk, we will review Spring Cloud Data Flow and Spring Cloud Skipper and how they come together to solve data integration and the continuous delivery challenges respectively. The day-to-day developer workflow including development, testing, CI, and the overall orchestration on cloud platforms (e.g., Cloud Foundry, Kubernetes) will be demonstrated.","persons":[{"id":936,"full_public_name":"Sabby Anandan","abstract":"Sabby Anandan, Product Manager at Pivotal. Sabby is focused on building products that eliminate the barriers between application development, cloud, and big data. Sabby has a Bachelor's in Electrical and Electronics from the University of Madras and a Master's in Information Technology and Management from the Carnegie Mellon University.","twitter_name":"sabbyanandan","avatar_path":null}]},{"id":1528,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Core Cloud","title":"12 Factors to Cloud success","track":"Core Cloud","type":"lecture","abstract":"Challenged by the highly automated, virtualized and scalable infrastructure that Cloud enables? We now have a whole new set of restrictions and capabilities that demands we shift the way we architect our applications. Luckily enough, we already have a set of best practices given to us by brave cloud pioneers. Some of these best practices are collated as the “12 Factor Apps” (12factor.net). And how can you apply these practices in this new containerized world?\r\n\r\nDive with us into the 12-factor methodology and check how each one of the factors can be applied and even empowered by Linux container technologies such as Docker and Kubernetes. We don’t judge, so we’ll demo everything in a language and platform-agnostic way. Regardless of your choices, you’ll never think about your application architecture the same way again.","persons":[{"id":848,"full_public_name":"Rafael Benevides","abstract":"Rafael Benevides is Director of Developer Experience at Red Hat. With many years of experience in several fields of the IT industry, he helps developers and companies all over the world to be more effective in software development. Rafael considers himself a problem solver who has a big love for sharing. He is a member of Apache DeltaSpike PMC - a Duke’s Choice Award winner project, and a speaker in conferences like JavaOne, Devoxx, TDC, DevNexus and many others.","twitter_name":"@rafabene","avatar_path":"/system/avatars/848/large/rafaesf.jpg?1506798287"}]},{"id":1508,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Core Cloud","title":"8 Steps to Become Awesome with Kubernetes","track":"Core Cloud","type":"lecture","abstract":"Everybody seems to be rocking with Kubernetes. Even your favorite open source repositories at GitHub are running on top of it. Don’t be the last developer to board this bullet train. Come to this session to learn eight simple and practical steps that will take you from Kubernetes novice to expert. Setup? Check. Deployment? Check. Developer tooling? Check. Cloud-native features? Check. Practical advice on running Java workloads in a container? Check. Immerse yourself in the most productive 75 minutes of your week, or regret it later when you’re learning these steps the hard way.","persons":[{"id":836,"full_public_name":"Burr Sutter","abstract":"A lifelong developer advocate, community organizer, and technology evangelist, Burr Sutter is a featured speaker at technology events around the globe—from Bangalore to Brussels and Berlin to Beijing (and most parts in between)—he is currently Red Hat’s Director of Developer Experience. A Java Champion since 2005 and former president of the Atlanta Java User Group, Burr founded the DevNexus conference—now the second largest Java event in the U.S.—with the aim of making access to the world’s leading developers affordable to the developer community. When not speaking abroad, Burr is also the passionate creator and orchestrator of highly-interactive live demo keynotes at Red Hat Summit, the company’s premier annual event.","twitter_name":"burrsutter","avatar_path":"/system/avatars/836/large/080717_BURRSUTTER_HEADSHOT_6INX6IN_300DPI.JPG?1506781615"}]},{"id":1620,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Core Cloud","title":"Cloud Native Java EE","track":"Core Cloud","type":"lecture","abstract":"Java EE and cloud native technology — this doesn’t really\r\nsound like a good fit. Or does it? Is it possible to develop scalable,\r\nresilient, cloud native, twelve-factor Java Enterprise applications? And\r\nif so, how much integration and “plumbing” is needed?","persons":[{"id":882,"full_public_name":"Sebastian Daschner","abstract":"Sebastian Daschner is a self-employed Java consultant, author and trainer and is enthusiastic about programming and Java (EE). He is the author of the book ‘Architecting Modern Java EE Applications’. Sebastian is participating in the JCP, helping forming the future standards of Java EE, serving in the JAX-RS, JSON-P and Config Expert Groups and collaborating on various open source projects. For his contributions in the Java community and ecosystem he was recognized as a Java Champion, Oracle Developer Champion and double 2016 JavaOne Rockstar. Besides Java, Sebastian is also a heavy user of Linux and container technologies like Docker. He evangelizes computer science practices on https://blog.sebastian-daschner.com, his newsletter, and on Twitter via @DaschnerS. When not working with Java, he also loves to travel the world — either by plane or motorbike.","twitter_name":"@DaschnerS","avatar_path":"/system/avatars/882/large/sebastian2.jpg?1507495851"}]},{"id":1625,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:00","room":"Core Cloud","title":"Getting started with Spark","track":"Core Cloud","type":"lecture","abstract":"Data analytics and machine learning have become mainstream in recent years. With the amount of data available, distributed computing has become a necessity. Apache Spark is one of the forerunners in the distributed computing domain. In this session, you’ll learn about the background and basic concepts of Apache Spark. You’ll also see, live, how to build a reference implementation in an IDE. The minimal-slide session, designed to be interactive, is recommended for developers who want to start experimenting with Spark.","persons":[{"id":884,"full_public_name":"Nikhil Nanivadekar","abstract":"Nikhil Nanivadekar is a Vice President in Private Wealth Management in the Technology division of Goldman Sachs. Nikhil is the project lead and committer for Eclipse Collections and has presented at JavaOne, DevoxxUS and Java User Group meetups. He is passionate about robotics has conducted robotics workshops at JCrete4Kids, JavaOne4Kids and Devoxx4Kids. Nikhil graduated in 2012 from University of Utah with a Masters in Mechanical Engineering with specialization in Robotics and Controls. Nikhil was inducted in the Oracle Developer Champions program in 2017.","twitter_name":"nikhilnanivade","avatar_path":null}]}],"Web":[{"id":1484,"date":"2018-02-22T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Web","title":"Test Automation with Selenium WebDriver, Java, and JUnit","track":"Web","type":"lecture","abstract":"With support for every major browser (including mobile browsers) and bindings for many languages, there is no doubt that Selenium WebDriver is the most popular open source browser automation tool. Combined with the latest version of JUnit and smart techniques like the Page Object pattern, you can build a foundation for quality integration, functional and regression testing. You can even execute tests in the cloud against different browser / OS combinations. Come to this session to learn how you can get the most out of Selenium WebDriver.","persons":[{"id":160,"full_public_name":"Kito Mann","abstract":"Kito D. Mann is the Principal Consultant at Virtua, Inc., specializing in enterprise application architecture, training, development, and mentoring with JavaServer Faces, HTML5, portlets, Liferay, and Java EE technologies. He is also the editor-in-chief of JSFCentral.com (www.jsfcentral.com), co-host of the Enterprise Java Newscast (http://www.enterprisejavanews.com), host of the JSF Podcast interview series (http://www.jsfcentral.com/resources/jsfcentralpodcasts/), and the author of JavaServer Faces in Action (Manning). Mann has participated in several Java Community Process expert groups (including CDI, JSF and Portlets) and is also an internationally recognized speaker. He holds a BA in Computer Science from Johns Hopkins University.","twitter_name":"kito99","avatar_path":"/system/avatars/160/large/kito-mann-small.jpg?1438802820"}]},{"id":1281,"date":"2018-02-22T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Web","title":"StencilJS and Universal Components","track":"Web","type":"lecture","abstract":"Building a component library is hard, but building for multiple frameworks is even harder. Thankfully StencilJS Solves this. Building on top of Web Components, StencilJS provides a platform for building simple, cross-framework components for everyone.","persons":[{"id":439,"full_public_name":"Michael Hartington","abstract":"A developer for the Ionic Framework, avid craft beer lover, and stumbling musician. ","twitter_name":"mhartington","avatar_path":"/system/avatars/439/large/mike-headshot-14.png?1481752576"}]},{"id":1476,"date":"2018-02-22T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Web","title":"Parallel Universe: Java Developer’s Guide to Front-End Development","track":"Web","type":"lecture","abstract":"You’ve been comfortable building back-end services in Java or using a Java web framework, but now you must build an application using a JavaScript framework like Angular, React, Polymer, Ember, Backbone, or a home-grown mismatch of jQuery and custom code. Suddenly you have entered an alternative universe with foreign terms like “bower”, “node”, “npm”, “webpack”, “AMD”,  “CommonJS”, “ES6”, “ES2015”, “TypeScript”, “Babel”, “gulp”, “grunt”, “shim”, “polyfill”, and more. What do they all mean, and how are they related to each other? More importantly, how do they compare to what we know and love in the Java universe? Join us as we explore another universe.","persons":[{"id":160,"full_public_name":"Kito Mann","abstract":"Kito D. Mann is the Principal Consultant at Virtua, Inc., specializing in enterprise application architecture, training, development, and mentoring with JavaServer Faces, HTML5, portlets, Liferay, and Java EE technologies. He is also the editor-in-chief of JSFCentral.com (www.jsfcentral.com), co-host of the Enterprise Java Newscast (http://www.enterprisejavanews.com), host of the JSF Podcast interview series (http://www.jsfcentral.com/resources/jsfcentralpodcasts/), and the author of JavaServer Faces in Action (Manning). Mann has participated in several Java Community Process expert groups (including CDI, JSF and Portlets) and is also an internationally recognized speaker. He holds a BA in Computer Science from Johns Hopkins University.","twitter_name":"kito99","avatar_path":"/system/avatars/160/large/kito-mann-small.jpg?1438802820"}]},{"id":1755,"date":"2018-02-22T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Web","title":"Micro SPA Architecture","track":"Web","type":"lecture","abstract":"","persons":[{"id":952,"full_public_name":"Jessica Kennedy","abstract":"Jessica is a senior software engineer at Inmar, inc. Specializing in front end architecture, specifically around css, she brings over 10 years of full stack experience to the table. Her current role involves working as part of a polyglot team of engineers working full-stack within an ever-evolving ecosystem of technologies.","twitter_name":"mistersender","avatar_path":"/system/avatars/952/large/Kennedy_Jessica_sm.jpg?1513015256"}]},{"id":1457,"date":"2018-02-22T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Web","title":"Getting Reactive with Spring Framework 5","track":"Web","type":"lecture","abstract":"Spring Framework 5.0 provides a choice of two web stacks. One is the existing, Servlet API based, Spring MVC, and the other is the new, non-blocking, reactive API based Spring WebFlux. \r\n\r\nIn this session we will review the range of choices, understand the architecture and execution models for each stack, and discuss how to make choices. The presentation includes slides and demo code.","persons":[{"id":822,"full_public_name":"Rossen Stoyanchev","abstract":"Rossen Stoyanchevis a Spring Framework committer. He was involved in the development of both Spring MVC and Spring WebFlux.","twitter_name":"rstoya05","avatar_path":"/system/avatars/822/large/rossen-blog-large.jpg?1512665194"}]},{"id":1717,"date":"2018-02-22T17:00:00-05:00","start":"17:00","duration":"01:15","room":"Web","title":"Building Progressive Web Apps with React","track":"Web","type":"lecture","abstract":"Progressive web apps are a middle ground between a web app and a native app. They are lightweight apps designed to conform to any device, work offline, and feel like a native app. Come learn how to use your existing React knowledge to build the next generation of web applications.","persons":[{"id":928,"full_public_name":"Jonathan Mills","abstract":"Jon is a Pluralsight author, Microsoft MVP, and international speaker focusing on JavaScript both in the browser and on the server.  ","twitter_name":"jonathanfmills","avatar_path":"/system/avatars/928/large/headshot.jpg?1507834298"}]}]}},{"index":2,"date":"2018-02-23","day_start":"2018-02-23T07:00:00-05:00","day_end":"2018-02-23T20:00:00-05:00","rooms":{"Core Java":[{"id":1667,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Core Java","title":"Learn Java 8: Lambdas and Functional Programming","track":"Java","type":"lecture","abstract":"This session walks through tons of examples in live coding. You will learn everything you need to know about lambdas and functional programming in Java 8. I'm the supplier. You’re the consumer (and you will get the joke after the session).","persons":[{"id":901,"full_public_name":"Henri Tremblay","abstract":"Henri Tremblay is Java Champion. He leads EasyMock and Objenesis and contributes to Ehcache open source projects. When he was young, he made popular class mocking, invented partial mocking and was coding with pragmatism.","twitter_name":"henri_tremblay","avatar_path":"/system/avatars/901/large/profil1.png?1507666487"}]},{"id":1574,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Core Java","title":"Java Puzzlers NG S03 — What? Where those came from?!","track":"Java","type":"lecture","abstract":"You know what to expect by now: funny and puzzling questions about Java 8 and Java 9, JFrog t-shirts are airborne, the usual combo of learning and fun ahead!\r\n","persons":[{"id":864,"full_public_name":"Baruch Sadogursky","abstract":"Developer Advocate at JFrog","twitter_name":"@jbaruch","avatar_path":"/system/avatars/864/large/drawn.gif?1506898847"}]},{"id":1902,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Core Java","title":"Designing for Modularity with Java 9","track":"Java","type":"lecture","abstract":"Design maintainable and extensible applications using the Java module system.","persons":[{"id":1043,"full_public_name":"Sander Mak","abstract":"Sander is a Fellow at Luminis and author of the O'Reilly book <a href=\"https://javamodularity.com\">Java 9 Modularity</a>.","twitter_name":"@Sander_Mak","avatar_path":"/system/avatars/1043/large/sander_mak_sq_small.jpg?1510606834"}]},{"id":1479,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Core Java","title":"The Good Cop/Bad Cop Guide to Java 9","track":"Java","type":"lecture","abstract":"In this session, our speakers take turns playing good cop/bad cop on each Java 9 feature. We let the audience decide which features are important to you, after explaining the pros and cons of each feature. ","persons":[{"id":827,"full_public_name":"Simon Maple","abstract":"Simon is the Director of Developer Relations at ZeroTurnaround, a Java Champion since 2014, JavaOne Rockstar speaker in 2014, Duke’s Choice award winner, Virtual JUG founder and organiser, London Java Community co-leader and RebelLabs author.","twitter_name":"sjmaple","avatar_path":"/system/avatars/827/large/Simon-Speaker.jpg?1506706949"}]},{"id":1449,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Core Java","title":"Java in the 21st Century: are you thinking far enough ahead?","track":"Java","type":"lecture","abstract":"Discussions abound about the ‘future of Java’ though most of them are actually focused on the here and now.  In this session  learn about IBM's view of the real future of Java. Whether it’s driven by AI or Quantum Computers tomorrow will demand new approaches and new thinking. Are you ready?\r\n","persons":[{"id":816,"full_public_name":"Steve Poole","abstract":"Steve Poole is a Developer Advocate, DevOps practitioner  and a long time IBM Java developer, leader and evangelist. He’s been working on Java SDKs and JVMs since Java was less than one year old. ","twitter_name":"spoole167","avatar_path":null}]}],"JavaScript":[{"id":1282,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"JavaScript","title":"Don't Over-React - just use Vue!","track":"JavaScript","type":"lecture","abstract":"An introduction to Vue and why it should be your new best friend.","persons":[{"id":329,"full_public_name":"Raymond Camden","abstract":"Raymond Camden is a developer advocate for IBM. His work focuses on LoopBack, serverless, hybrid mobile development, Node.js, HTML5, and web standards in general. He's a published author and presents at conferences and user groups on a variety of topics. Raymond can be reached at his blog (www.raymondcamden.com), @raymondcamden on Twitter, or via email at raymondcamden@gmail.com.\r\n","twitter_name":"raymondcamden","avatar_path":"/system/avatars/329/large/ray3_2017.jpg?1507836294"}]},{"id":1716,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"JavaScript","title":"A Skeptics guide to functional style javascript","track":"JavaScript","type":"lecture","abstract":"Modern JavaScript seems to be split between the object oriented devs of Angular and the more functional style devs of the redux world. Many OO devs struggle with seeing the value in the functional style and all of the paradigms that go with it. This talk will work to explain those paradigms.","persons":[{"id":928,"full_public_name":"Jonathan Mills","abstract":"Jon is a Pluralsight author, Microsoft MVP, and international speaker focusing on JavaScript both in the browser and on the server.  ","twitter_name":"jonathanfmills","avatar_path":"/system/avatars/928/large/headshot.jpg?1507834298"}]},{"id":1545,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"JavaScript","title":"Write Better JavaScript with Unit Testing","track":"JavaScript","type":"lecture","abstract":"The nature of JavaScript makes unit testing critically important. Yet many developers who move to JavaScript seem to gradually lose their discipline and stop. This session will show you how easy it is to unit test your JavaScript and why it should be a part of every project.","persons":[{"id":852,"full_public_name":"James Bender","abstract":"James is an independent consultant who spends his day's building application with React, Angular, Node and ASP.NET. His new book \"Developing SPAs: Working with Visual Studio, Angular and ASP.NET Web API\" will be out in 2017. James's Twitter ID is JamesBender","twitter_name":"James Bender","avatar_path":"/system/avatars/852/large/me.jpg?1506811197"}]},{"id":1579,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"JavaScript","title":"Building Real World Node.JS Microservices","track":"JavaScript","type":"lecture","abstract":"“Microservces are small services with independent lifecycles that work together” -Sam Newman. In this talk I'll be presenting some core principles I think represent what makes microservices work well using Node.JS and Docker.  We’ll explore best practices, code, and tooling to get the job done right. I'd say that beginners will get a sense of what microservices are and what makes different, whereas more experienced practitioners will get an insight into practical advice into how to implement them. ","persons":[{"id":686,"full_public_name":"James Truitt","abstract":"James Truitt an agile software developer and technologist. He’s has 17+ years of experience creating software for the TV Broadcasting field. His focus and passion is learning and sharing all things dealing with the cloud. When he’s not behind a computer you’ll find him in the stands cheering on him kids in a local basketball arena.","twitter_name":"@auburnjames","avatar_path":"/system/avatars/686/large/Headshot_2.jpg?1502995389"}]},{"id":1581,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"JavaScript","title":"Choosing a JavaScript Framework","track":"JavaScript","type":"lecture","abstract":"Over the last couple of years, JavaScript has become on the of the most popular programming languages. As a result, there has been a large number of JavaScript frameworks and libraries that have been created. I will walk you through a simple todo application using Angular, React and Vue.","persons":[{"id":332,"full_public_name":"Jennifer Bland","abstract":"Jennifer Bland is a Senior Software Developer for Hearst Autos, specializing in MEAN stack development. She has more than ten years of development experience working for companies like CNN, Coca-Cola and Apple Computer. Jennifer is the author of the book “Developing e-Business Applications Using Lotus Domino on the AS/400\", published by IBM.\r\n\r\nShe runs the website codeprep.io which provides interview questions to assist programmers in preparation for job interviews. Her personal website is jenniferbland.com.\r\n\r\nJennifer holds a B.A. in History from Furman University and an MBA from San Jose State University.\r\n","twitter_name":"ratracegrad","avatar_path":"/system/avatars/332/large/Jennifer-Bland-headshot.jpg?1494079160"}]}],"Microservices":[{"id":1565,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Microservices","title":"Eventing with Apache Kafka","track":"Microservices","type":"lecture","abstract":"When building our microservice platform we wondered how services should consume data without opening the gates of hell by doing endless chains of API calls. We realized one fact: Having data is better than needing data. Therefore we decided to allow services to keep data redundant. Letting 40 teams work as autonomous as possible we introduced “eventing” and Apache Kafka to reduce dependencies when answering requests. This talk shows the principles and basics about asynchronous communication with Apache Kafka along with code samples. We’ll show you how simple producers and consumers can be written, how domain events are passed around between services and the most common pitfalls to be avoided for developers. ","persons":[{"id":1084,"full_public_name":"Sebastian Gauder","abstract":"","twitter_name":"@rattakresch","avatar_path":"/system/avatars/1084/large/sgauder.jpg?1511194016"},{"id":860,"full_public_name":"Ansgar Brauner","abstract":"Ansgar Brauner is working at REWE Digital as Software Architect, taking care of the bounded context Fulfillment. After working at Zalando he started at REWE Digital to help one of Europe’s biggest food retailers building the leading food eCommerce platform in Europe. Beside enabling 8 teams to work autonomously he helps the product owners to not neglect the technical view. Ansgar leads the Java User Group Dortmund and likes playing around with Microcontrollers.","twitter_name":"@a_brauner","avatar_path":"/system/avatars/860/large/IMG_20160924_150259763_HDR_kl.jpg?1510757527"}]},{"id":1342,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Microservices","title":"Docker Management and Orchestration","track":"Microservices","type":"lecture","abstract":"Docker is the de facto tool for creating containerized applications, but leveraging containers in production isn't always straightforward. There are many options from simple hosts to complex orchestration tools. Learn how to create Docker images, load them to a custom registry and deploy them at scale with a simple example application written in Go and JavaScript. See examples of cloud deployments implemented with Azure Container Instances, Web Apps for Containers, and Azure Kubernetes Services.","persons":[{"id":757,"full_public_name":"Jeremy Likness","abstract":"Jeremy Likness is a Cloud Developer Advocate for Azure at Microsoft. Jeremy has spent two decades building enterprise software with a focus on line of business web applications. He is the author of several highly acclaimed technical books including Designing Silverlight Business Applications and Programming the Windows Runtime by Example. He has given hundreds of technical presentations during his career as a professional developer that spans two decades. In his free time Jeremy likes to CrossFit, hike, and maintain a 100% plant-based diet.","twitter_name":"@JeremyLikness","avatar_path":"/system/avatars/757/large/profile1_sm.jpg?1511190405"}]},{"id":1731,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Microservices","title":"_Gracefully_ Transitioning a Monolith to Microservices","track":"Microservices","type":"lecture","abstract":"Many of us are rearchitecting monoliths to microservices; we'll describe our approach to doing so <u>gracefully</u> and <u>gradually</u>.","persons":[{"id":1168,"full_public_name":"Avanti Nagalia","abstract":"Avanti Nagalia is a Director of Software Engineering for the warehousing product at Manhattan Associates. Architecture and design are a passion followed closely by travel and flying. ","twitter_name":"","avatar_path":"/system/avatars/1168/large/20160830_101234-01.jpg?1516981887"},{"id":935,"full_public_name":"evanda remington","abstract":"developer, manager, farmer, family man, roboticist, baker","twitter_name":"evandaremington","avatar_path":"/system/avatars/935/large/02406cd.jpg?1510846863"}]},{"id":1598,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Microservices","title":"Introducing Spring Cloud Gateway","track":"Microservices","type":"lecture","abstract":"What is an API Gateway and how can your microservices architecture benefit by using one? What are the types API\r\n Gateways? What characteristics define each type of API Gateway? Join Spring Cloud co-lead Spencer Gibb for dis\r\ncussion and demonstration of the next generation of API Gateway, Spring Cloud Gateway and about its architectur\r\ne and developer experience. Learn about route matching and filtering and how it is different than the previous \r\nZuul 1 experience. Features of Spring Cloud Gateway include, support for websockets, reactive developer experie\r\nnce and rate limiting, to name a few.","persons":[{"id":868,"full_public_name":"Spencer Gibb","abstract":"Spencer Gibb is a Principal Software Engineer for Pivotal, Inc.\r\n\r\nHis interests include distributed systems, jvm languages, web services frameworks, message-driven architectures\r\n and making software development simpler.  He loves to create software to solve a pain point, such as creating \r\na tool to automate workstation setup in his free time.\r\n\r\nAt Pivotal he is the co-founder and co-lead of the Spring Cloud Core projects.\r\n\r\nHis industry experience has taken him from early e-commerce platforms to government and non-profit organization\r\ns to business intelligence startups.  He has extensive java experience and experience in other languages such a\r\ns scala and python.  His database experience runs from Oracle and MySQL to Riak and Cassandra.\r\n\r\nHis blog is located at https://spencer.gibb.us","twitter_name":"spencerbgibb","avatar_path":"/system/avatars/868/large/Spencer_Gibb_Headshot_-_Square_-_Hi_Res.jpg?1510856281"}]},{"id":1549,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Microservices","title":"Microservice Networking in Anger","track":"Microservices","type":"lecture","abstract":"You’ve smashed your monolith into a thousand pieces.  You’ve mastered eliminating tight coupling, large dependency trees, and long build times.  Your next challenge?  Dealing with your network to make it all work again.  This session will cover all the things you never thought you had to know about networking. Whether you’re deploying to docker containers in the cloud or to your own datacenter this session will have something you’ll be able to put to work immediately.  FIN","persons":[{"id":850,"full_public_name":"Bob Paulin","abstract":"Bob Paulin is an independent consultant and speaker that has been developing open source software for the past 10 years. Bob has presented at large international conferences such as ApacheCon, JavaOne and Devnexus. He frequently shares his knowledge and opinions on the Java Pub House and Jave Off Heap podcasts. Bob is actively involved in the Chicago developer community as the Chicago Java User Group CFO and Chicago GOTO Jr presenter/organizer. Bob is a passionate member of the ASF and donates his time to Apache Felix and Apache Tika as a committer and PMC respectively. When not coding, Bob enjoys coaching football, robotics, and spending time with his wife and 3 kids. ","twitter_name":"bobpaulin","avatar_path":null}]}],"JVM Languages":[{"id":1301,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"JVM Languages","title":"Bulletproofing your foot for Kotlin","track":"JVM Languages","type":"podium","abstract":"Kotlin is the hot new language for the JVM, and a shiny new toy for many developers. Come and learn what it has to offer, its benefits and advantages over Java, and how to avoid shooting yourself in the foot when you start using it.","persons":[{"id":716,"full_public_name":"Enrique Zamudio","abstract":"Enrique has been creating software professionally for more than 20 years, specializing in backend systems and host to host interfaces. He was named Java Champion in 2015 and is part of the Ceylon core team. Lately he's been involved in cryptocurrency-related technologies.","twitter_name":"chochosmx","avatar_path":"/system/avatars/716/large/yo2.jpg?1510074133"}]},{"id":2064,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"JVM Languages","title":"GORM Data Services","track":"JVM Languages","type":"lecture","abstract":"GORM is the powerful ORM tool that has been developed as part of the Grails web framework. GORM fully leverages the capabilities of Groovy to provide a rich set of capabilities which greatly simplify interacting with databases from any JVM application, not just Groovy and Grails applications as recent versions of GORM are very easy to use independent of Grails.","persons":[{"id":1154,"full_public_name":"Jeff Brown","abstract":"Jeff Brown, Grails co-founder, has been doing JVM application development for as long as the JVM has existed and has spent most of the last decade focused specifically on work related to the Grails framework. \r\n\r\nJeff co-authored The Definitive Guide To Grails Second Edition, and The Definitive Guide To Grails 2, with Grails founder and OCI Grails Development Lead, Graeme Rocher. Jeff is a regular public speaker on Grails, Groovy and other JVM-related technologies.","twitter_name":"@jeffscottbrown","avatar_path":"/system/avatars/1154/large/jeff.png?1513694318"}]},{"id":1887,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"JVM Languages","title":"Bootiful Kotlin","track":"JVM Languages","type":"lecture","abstract":"\r\nSpring Boot, the convention-over-configuration centric framework from the Spring team at Pivotal, marries Spring's flexibility with conventional, common sense defaults to make application development on the JVM not just fly, but pleasant! Spring Boot aims to make address the common functional and non-functional requirements that gate quickly moving to production. The framework is as clean as it gets, wouldn't it be nice if the language matched its elegance?\r\n\r\nKotlin, the productivity-focused language from our friends at JetBrains, takes up the slack to make the experience leaner, cleaner and even more pleasant!\r\n\r\nThe Spring and Kotlin teams have worked hard to make sure that Kotlin and Spring Boot are a first-class experience for all developers trying to get to production, faster and safer. Come for the Spring and stay for the Bootiful Kotlin.","persons":[{"id":1030,"full_public_name":"joshlong","abstract":"Josh (@starbuxman) is the Spring Developer Advocate at Pivotal. Josh is a Java Champion, author of 5 books (including O'Reilly's Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry) and numerous best-selling video trainings (including Building Microservices with Spring Boot Livelessons with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring Integration, Spring Cloud, Activiti and Vaadin). \r\n","twitter_name":"starbuxman","avatar_path":"/system/avatars/1030/large/josh.png?1510325739"}]},{"id":1701,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"JVM Languages","title":"Kotlin in Action","track":"JVM Languages","type":"lecture","abstract":"Kotlin comes to us from Jetbrains the same people that make the IntelliJ IDEA IDE. Designed to run on the JVM and interop cleanly with exisiting Java classes, Kotlin provides a number of upgrades from standard Java development. More than just another language tour with and ceaseless parade of tidbits and nuggets, this talk is a walkthrough of actively developed projects. We'll look at various language features in the context of actual code rather than contrived examples designed to make the language shine.","persons":[{"id":912,"full_public_name":"Justin Lee","abstract":"Justin Lee, a Java Champion, has been programming in Java since 1996.  He has worked on virtually every level of the application stack from database drivers all the way to application servers and front end interfaces.  A long time advocate of Java, he has spoken at conferences and user groups all across the US and Europe.  He is an active open source community member contributing when and where he can. He recently relocated to Stockholm, Sweden with his family and can be found on twitter and github as @evanchooly.","twitter_name":"evanchooly","avatar_path":"/system/avatars/912/large/JustinProfile.jpg?1507749276"}]},{"id":1338,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"JVM Languages","title":"Creating actor pipelines with Akka in Scala","track":"JVM Languages","type":"lecture","abstract":"Throughout this talk, we will be looking into creating reactive pipelines using Akka in Scala. We will be looking at concepts such as futures, actors, routing. If we have time, we will bring in akka-camel and show how introducing tools such as RabbitMQ can push our designs into enterprise messaging. By the end of this session, you should be ready to begin implementing your own pipelines.","persons":[{"id":149,"full_public_name":"Josh Backfield","abstract":"Software engineer who lives on the edge of technology. Constantly looking for new technologies and concepts to apply to everyday programming. Yearns to help disseminate knowledge to others to improve the Computer Science landscape.","twitter_name":"@jbackfield","avatar_path":"/system/avatars/149/large/2yIuWys__400x400.jpg?1492361151"}]}],"Mobile":[{"id":1332,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Mobile","title":"A NoSQL Option to Persisting Data in your Mobile Apps","track":"Mobile","type":"lecture","abstract":"This talk will examine NoSQL as an alternative to locally persisting data on mobile platforms. We will provide an overview of the various flavors of NoSQL, focusing on the  Document model. I will introduce Couchbase Lite, an open source, cross-platform NoSQL embedded data store for your mobile apps. We will compare and contrast it with existing embedded storage solutions. We will discuss how you can integrate this in your mobile apps and walk through examples describing the CRUD and Query interface.","persons":[{"id":750,"full_public_name":"Priya Rajagopal","abstract":"Priya Rajagopal has been professionally developing software for over 18 years and is a Developer Advocate at Couchbase. She is an active member of the mobile development community where she frequently talks on mobile development related topics, does technical consulting / mentoring and organizes the Mobile Monday, Ann Arbor user group. While her current interests lie with mobile development, she has previously worked on a range of technologies and is a co-inventor on 22 US patents. ","twitter_name":"rajagp","avatar_path":null}]},{"id":1747,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Mobile","title":"Goin’ Mobile: Developing Apps for IOS and Android with Java and JavaFX","track":"Mobile","type":"lecture","abstract":"Mobile applications are becoming increasingly important for businesses. In this talk we describe how you can leverage your Java and JavaFX skills to create mobile applications and deploy them on both iOS and Android platforms. With a plug-in from Gluon and your favorite IDE, you get a framework that gives you Write Once, Run Anywhere technology and a way to communicate with cloud data securely.","persons":[{"id":941,"full_public_name":"Gail Anderson","abstract":"Gail Anderson is a Java Champion and a member of the NetBeans Dream Team. She is the Director of Research and founding member of the Anderson Software Group, a leading provider of training courses in Java 8 & 9, JavaFX, and other programming languages.\r\n\r\n","twitter_name":"@gail_asgteach","avatar_path":"/system/avatars/941/large/GailAnderson.jpg?1510721023"},{"id":940,"full_public_name":"Paul Anderson","abstract":"Paul L. Anderson is a Java Champion and a member of the NetBeans Dream Team. He is President and founding member of the Anderson Software Group, a leading provider of training courses in Java 8 & 9, JavaFX, and other programming languages. ","twitter_name":"@paul_asgteach","avatar_path":"/system/avatars/940/large/PaulAnderson.jpg?1510720434"}]},{"id":1635,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Mobile","title":"Top 10 Key Performance Techniques for Web and Hybrid Mobile Apps","track":"Mobile","type":"lecture","abstract":"It is an easy task to develop, and deploy your hybrid mobile apps to your favorite stores, and get it ready for your client. But what about your application performance, is it fine tweaked for your customer devices.","persons":[{"id":886,"full_public_name":"Mohamed Taman","abstract":"Enterprise Architect / Innovation & R&D Sr. Manager @efinance, Java Champion, IoT / Mobile/ Web / Big Data / Cloud / Blockchain (HashGraph) / DevOps Architect, JCP, Duke Award winner 3 times, International Speaker, Books & Videos Author","twitter_name":"@_tamanm","avatar_path":"/system/avatars/886/large/TamanM.jpg?1507547778"}]},{"id":1288,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Mobile","title":"A More Secure World for Android Apps","track":"Mobile","type":"lecture","abstract":"In the world of development, security is sometimes a subject that does not receive the importance it should have. This talk has as objective touch some points for make Android Apps more secure. ","persons":[{"id":709,"full_public_name":"Mercedes Wyss","abstract":"Community Leader, Auth0 Ambassador, Women in Tech, Speaker, Geek and Passionate About Life.","twitter_name":"itrjwyss","avatar_path":"/system/avatars/709/large/DSC_0199.JPG?1511894458"}]},{"id":2109,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Mobile","title":"Exploring React/Redux-like Architectures in Android","track":"Mobile","type":"lecture","abstract":"Navigating the pitfalls that often accompany Android development such as Scopes and Lifecycles, Activity vs Fragment vs “Smart” View, Orientation Changes, Async Calls, and Navigation can make really complicated and difficult-to-test code. React and Redux are technologies that are prevalent in the web world and have benefits such as a Single Source of truth, Predictable and testable behavior, Rewind/Fast Forward debugging, and Pure functions and objects, and in this talk, we'll talk about how to gain these benefits in Android applications.\r\n\r\n","persons":[{"id":341,"full_public_name":"Stephen Schwahn","abstract":"Stephen is a Georgia Tech Alumnus, Chief Technical Officer at Plutonium Apps, and Software Engineer at Greenlight Financial. His hobbies include mountain biking, hiking, backpacking, and anything marching band.","twitter_name":"Dogstopper","avatar_path":"/system/avatars/341/large/IMG_5144.JPG?1469975052"}]}],"Patterns & Design":[{"id":1453,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Patterns & Design","title":"GraphQL and REST: frenemies forever?","track":"Patterns & Design","type":"lecture","abstract":"For the past decade, the REST pattern has dominated the web services scene. In the past couple of years, a new contender has emerged : GraphQL. What is GraphQL? How does it differ from REST? Must we choose between one and the other? Only a proper understanding of both technologies and patterns can help answer these questions.","persons":[{"id":818,"full_public_name":"Yoel Spotts","abstract":"Yoel Spotts is a software engineer at Experience, based in Atlanta. Holding degrees in Computer Science and Talmudic Law, he has almost 20 years of programming experience. A huge fan of the JVM, Yoel has worked in Java, Groovy and Scala. No stranger to DevNexus or public speaking, Yoel attended the very first DevNexus (back before it was called DevNexus) and has presented several times in the past. When not building great software or trying to avoid category theory, Yoel enjoys hiking and spending time with his family.","twitter_name":"","avatar_path":"/system/avatars/818/large/Experience_032.jpg?1511108826"}]},{"id":1993,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Patterns & Design","title":"Intellectual Property Fundamentals for the Technologist","track":"Patterns & Design","type":"lecture","abstract":"Technologists need to be aware of the basics of intellectual property law and the broad effects it has on decisions you make every day. Become familiar with key principles so that you can make better informed decisions for your software development team.","persons":[{"id":1117,"full_public_name":"Jeff Strauss","abstract":"Jeff is both a software consultant and an attorney. With his unique experiences that combine technology and law, he maintains a passion for solving problems with inspired solutions, improving life through technology. A dedicated member of the developer community, Jeff travels internationally to speak on both technical and business-oriented topics. He is co-owner of Arana Software and a Microsoft MVP, was a lead organizer of Dev Up Conference for seven years, and now enjoys serving on the board of directors for the Kansas City Developer Conference.","twitter_name":"jeffreystrauss","avatar_path":"/system/avatars/1117/large/DevoxxBE_2_500px_Square.png?1512581226"}]},{"id":1844,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Patterns & Design","title":"Design for Adoption","track":"Patterns & Design","type":"lecture","abstract":"Without end-user adoption, the best products in the world will fail. Use concepts of story design to adjust your development practices so that product adoption is as much a part of the project as is the code.","persons":[{"id":570,"full_public_name":"Katie Stroud","abstract":"Katie Stroud is the master story crafter for product adoption and corporate culture.","twitter_name":"KatieStroudPro","avatar_path":"/system/avatars/570/large/KS2015_300x300.png?1509568580"}]},{"id":1372,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Patterns & Design","title":"Developing Java Streaming Applications","track":"Patterns & Design","type":"lecture","abstract":"Apache Storm, http://storm.apache.org, is a free and open source distributed realtime computation system. Storm makes it easy to reliably process unbounded streams of data, doing for realtime processing what Hadoop did for batch processing. During this presentation a Java based streaming application will be built from scratch!","persons":[{"id":774,"full_public_name":"Lester Martin","abstract":"Lester Martin is a seasoned developer with 20+ years experience in a variety of languages and frameworks.  He has a deep interest in Big Data components written in Java and is currently a Hadoop consultant & trainer at Hortonworks.","twitter_name":"LesterMartinATL","avatar_path":"/system/avatars/774/large/SelfieInGermany.jpg?1511375825"}]},{"id":1275,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Patterns & Design","title":"How Do I Get Started in Open Source?","track":"Patterns & Design","type":"lecture","abstract":"Have you had this situation occur, you've taken a class or on-line course to advance your career\r\nand want to use this new skill, but can't apply it at where you work.   \r\nOr your are trying to get your first job but, get blocked because you have no real world\r\nexperience with this new skill.  There is a way you can get this experience to build that in depth knowledge\r\nthat can be added to a resume. Contribute to a Open Source Project.  \r\n\r\nThis presentation will discuss and demonstrate the tools and techniques that you will need \r\nto contribute to an open source project. As well as what to expect when you start contributing. \r\nWe will also show you the first steps you can take on selecting what to work on, when you get started.\r\n\r\n","persons":[{"id":761,"full_public_name":"Roy Clarkson","abstract":"","twitter_name":"royclarkson","avatar_path":null},{"id":699,"full_public_name":"Glenn Renfro","abstract":"As a Pivotal engineer, Glenn Renfro is a core committer for Spring Cloud Task, Spring Batch and Spring Cloud Data Flow. He has 14 years experience in designing, building and delivering enterprise level applications in Java and 21 years total of software development experience.","twitter_name":"cppwfs","avatar_path":"/system/avatars/699/large/glenn.jpeg?1504215166"}]}],"Performance":[{"id":1882,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Performance","title":"Riding the Jet Streams","track":"Performance","type":"lecture","abstract":"Java 8 introduced the Stream API as a modern, functional, and very powerful tool for processing collections of data. One of the main benefits of the Stream API is that it hides the details of iteration over the underlying data set, allowing for parallel processing within a single JVM, using a fork/join framework.","persons":[{"id":1023,"full_public_name":"Terry Walters","abstract":"Terry Walters is a Senior Solution Architect at Hazelcast, a Java-based, open-source operational in-memory computing platform. He is a speaker at local user groups.  He enjoys helping others succeed with web scale. His employment includes many industry leaders such as AT&T, Verizon, McKesson, UPS, and the formally known as BEA Systems. Walters holds a bachelor's degree in computer science.","twitter_name":"@terrymwalters","avatar_path":"/system/avatars/1023/large/TW.png?1512950238"}]},{"id":1610,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Performance","title":"Java 9 performance","track":"Performance","type":"lecture","abstract":"There's so much more to Java 9 than modules and a REPL.  If you take a peek under the hood, you will discover that there is in fact an awful lot to be excited about, especially in the realm of performance. Major improvements to Strings, great new concurrency features, ahead-of-time compilation, compiler control, and nifty low-level ways for library writers to manipulate variables and weave up new code at run-time, make it hard for your applications <em>not</em> to run run faster in Java 9.  In this talk we will take an in-depth look at some of these features, and take them for a spin using JMH.","persons":[{"id":878,"full_public_name":"Jonathan Ross","abstract":"Jonathan Ross is a developer and a financial engineer at IMC - a technology driven trading firm based in Amsterdam with offices in Chicago, New York and Sydney. Having developed high performance concurrent algorithms in Java and C++ for 20 years, he knows a thing or two about Java performance.","twitter_name":"@JoroRoss","avatar_path":"/system/avatars/878/large/joro-profile.jpg?1507257415"}]},{"id":1611,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Performance","title":"Introduction to building a distributed machine learning Pipeline for real time analysis of Uber data using Apache APIs: Kafka, Spark, and HBase","track":"Performance","type":"lecture","abstract":"In this talk we will look at a solution that combines real-time data streams with machine learning to analyze and visualize popular Uber trip locations in New York City. You will see the end-to-end process required to build this application using Apache APIs for Kafka, Spark, and HBase.","persons":[{"id":880,"full_public_name":"Carol McDonald","abstract":"Carol Mcdonald is a solutions architect at MapR focusing on big data, Apache HBase, Apache Drill, Apache Spark, and machine learning in healthcare, finance, and telecom. Previously, Carol worked as a Technology Evangelist for Sun, an architect/developer on: a large health information exchange, a large loan application for a leading bank,  pharmaceutical applications for Roche,   telecom applications for HP, OSI messaging applications for IBM, and sigint applications for the NSA. Carol holds an MS in computer science from the University of Tennessee and a BS in geology from Vanderbilt University and is an O'Reilly Certified Spark Developer and Sun Certified Java Architect and Java Programmer. Carol is fluent in French and German. ","twitter_name":"@caroljmcdonald","avatar_path":"/system/avatars/880/large/carol1_(4).jpg?1507302149"}]},{"id":1344,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Performance","title":"The Right Data Format For The Right Job","track":"Performance","type":"lecture","abstract":"What if you could get blazing fast queries on your data without having to be on call for a giant, expensive database? By picking the right file format for your data, you can store your data on disk in the cloud and still get the performance you need for modern analytics. We'll discuss benchmarks of four different data storage formats: Parquet, ORC, Avro, and traditional character-separated files like CSV. We'll cover what they are, how they work at a bits-and-bytes level, and why you might choose each one for your use case.","persons":[{"id":733,"full_public_name":"Emily May Curtin","abstract":"<a href=\"http://framebit.org/\">Emily May Curtin</a> is a rare Atlanta native. She works on Apache Spark and applications in the Spark ecosystem. Emily lives in the city with her husband <a href=\"http://ratml.org/\">Ryan</a>. When she's not busy having very strong opinions about Scala, she can be found on the Hooch, on the Appalachian Trail, or in the zone at her easel.","twitter_name":"@emilymaycurtin","avatar_path":"/system/avatars/733/large/headshot.jpg?1510601754"}]},{"id":1602,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Performance","title":"High Performance Batch Processing","track":"Performance","type":"lecture","abstract":"One of the benefits of batch processing is it's efficiency.  This efficiency lends itself to the ability to bulk process very large volumes of data.  This talk will walk through performance tuning and scaling Spring Batch applications.","persons":[{"id":873,"full_public_name":"Michael Minella","abstract":"Michael Minella is a software engineer, teacher, speaker, and author with over 16 years of enterprise development experience. He currently works for Pivotal as the project lead for the Spring Batch and Spring Cloud Task projects. Michael has spoken on a number of Java, Spring, and Big Data topics and is a JavaOne Rockstar. Michael was a member of the expert group for JSR-352 (java batch processing). Michael is the author of Pro Spring Batch from Apress and the popular Refcard JUnit and EasyMock.\r\n\r\nOutside of the daily grind, Michael enjoys spending time with his family and enjoys woodworking, photography and InfoSec hobbies.","twitter_name":"michaelminella","avatar_path":"/system/avatars/873/large/me.jpg?1507129537"}]}],"Security":[{"id":1442,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Security","title":"SSL/TLS for mortals","track":"Security","type":"lecture","abstract":"Using SSL/TLS the right way is often a big hurdle for developers. We prefer to have that one colleague perform \"something with certificates\", because he/she knows how that works. But what if \"that one colleague\" is enjoying vacation and something goes wrong with the certificates?\r\n \r\nIn this session we'll take a close look at secure communication at the transport level. Starting with what exactly SSL and TLS is, we'll dive into public/private keys, and signing. We'll also learn what all this has to do with an unfortunate Dutch notary. Of course, there'll be plenty of practical tips & trics, as well as demo's. \r\n \r\nAttend this session to become \"that one colleague\"!","persons":[{"id":810,"full_public_name":"Maarten Mulders","abstract":"Enthusiastic senior developer, trainer and architect with a passion for elegant and simple solutions. Passionate about \"building the right thing\" and \"building the thing right\".","twitter_name":"mthmulders","avatar_path":"/system/avatars/810/large/On_stage_at_Devoxx_(small).jpg?1511176599"}]},{"id":1294,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Security","title":"AWS Security Essentials","track":"Security","type":"lecture","abstract":"Are you using or moving to AWS? Have you considered how you organize and secure your AWS environments? The growing push to cloud providers has allowed us to move faster and tackle problems more efficiently. The same freedoms that have allowed us to move faster have also created scenarios where security issues are exposed by accident and/or without proper management and review. As companies move toward more and more cloud usage, teams are pushed harder to ensure the same compliance and security requirements that exist in slower moving private environments. This has the potential to put us right back where we came from.","persons":[{"id":713,"full_public_name":"Aaron Bedra","abstract":"Aaron Bedra is the founder of Modeled Thinking, where he works at the intersection of software, security, and business. He has served as a Chief Security Officer, Chief Technology Officer, and Principal Engineer/Architect. He has worked professionally on programming languages, most notably Clojure and ClojureScript. Aaron is the creator of Repsheet, an open source threat intelligence toolkit. He is the co-author of Programming Clojure, 2nd and 3rd Edition and a contributor to Functional Programming: A PragPub Anthology.","twitter_name":"abedra","avatar_path":"/system/avatars/713/large/generic.jpeg?1504454641"}]},{"id":1431,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Security","title":"Simple Java Security with Apache Shiro","track":"Security","type":"lecture","abstract":"This talk will provide a basic overview of how to secure an application using Apache Shiro and discuss the more common touch points such as: configuration, protecting paths/routes in web applications, and integrating with a custom authentication source.","persons":[{"id":807,"full_public_name":"Brian Demers","abstract":"Brian Demers is a PMC member for the Apache Shiro project. Brian spends much of his day contributing to Shiro in the form of writing code, tutorials, blogs, and answering questions.  He first started working with Shiro (then JSecurity) while working on Sonatype’s Nexus.  Along with typical software development Brian also has a passion for fast builds an automation.","twitter_name":"BrianDemers","avatar_path":"/system/avatars/807/large/gravatar.jpeg?1506473474"}]},{"id":1658,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Security","title":"What the Struts?","track":"Security","type":"lecture","abstract":"You've seen big data breaches in the news. But as a developer who doesn't specialize in security you might find it hard to protected your app from becoming the next victim. In this talk, you'll learn why some systems get hacked, and what practical measures you can take as a developer to keep your business safe.","persons":[{"id":842,"full_public_name":"Joe Kutner","abstract":"Joe is the Java Languages Owner at Heroku. He was named a JavaOne Rock Star in 2016, and authored Deploying with JRuby.","twitter_name":"codefinger","avatar_path":"/system/avatars/842/large/purple_bowtie_small.jpg?1517355816"}]},{"id":1276,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Security","title":"Watch How The Giants Fall","track":"Security","type":"lecture","abstract":"This talk is a fun, fast-moving survey of some of the best recent bug bounty finds against some of the largest and best-known applications in the world. Some of the bugs are really simple, some are super complex, but all are entertaining. As we go through these, we'll take a look at what caused the issue, and how to fix it. ","persons":[{"id":702,"full_public_name":"John Melton","abstract":"John is currently a Principal Member of Technical Staff at Oracle. His previous positions have been focused on secure software engineering, in the technology, financial and defense sectors. He has spent his entire career in software development and security. In his spare time, he leads the OWASP AppSensor project.","twitter_name":"_jtmelton","avatar_path":"/system/avatars/702/large/qIcfjZqk_400x400.jpg?1504289292"}]}],"Serverless and Cloud":[{"id":2049,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Serverless and Cloud","title":"Introducing Amazon EKS","track":"Serverless and Cloud","type":"lecture","abstract":"Amazon Elastic Container Service for Kubernetes (Amazon EKS) is a new managed service for running Kubernetes on AWS. This session will provide an overview of Amazon EKS, why we built it, and how it works. ","persons":[{"id":1164,"full_public_name":"Scott Malkie","abstract":"Scott Malkie is a Specialist Solutions Architect with the Container Services team at Amazon Web Services. He is passionate about open source software and sharing knowledge. When not helping customers on their cloud native journey, he enjoys thrashing on his bass guitar, playing cards, and embarrassing his children.","twitter_name":"","avatar_path":"/system/avatars/1164/large/square-head-jan-2018.png?1516716652"},{"id":776,"full_public_name":"Arun Gupta","abstract":"Arun Gupta is a Principal Open Source Technologist at Amazon Web Services. He has built and led developer communities for 12+ years at Sun, Oracle, Red Hat and Couchbase. He has deep expertise in leading cross-functional teams to develop and execute strategy, planning and execution of content, marketing campaigns, and programs. Prior to that he led engineering teams at Sun and is a founding member of the Java EE team.\r\n\r\nHe has extensive speaking experience in more than 40 countries on myriad topics and is a JavaOne Rock Star for four years in a row. Gupta also founded the Devoxx4Kids chapter in the US and continues to promote technology education among children. A prolific blogger, author of several books, an avid runner, a globe trotter, a Docker Captain, a Java Champion, a JUG leader, NetBeans Dream Team member, he is easily accessible at @arungupta.","twitter_name":"arungupta","avatar_path":"/system/avatars/776/large/evangelist-arun-gupta.png?1505838620"}]},{"id":2050,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Serverless and Cloud","title":"Scaling Elasticsearch for big data processing and analytics","track":"Serverless and Cloud","type":"lecture","abstract":"This presentation will cover ElasticSearch general concepts, and the configuration and deployment of this fault-tolerant indexing and search system. The presentation will focus on real-world use-cases and optimization techniques in running high-performing ElasticSearch cluster on AWS. Some of the topics covered will focus on general cluster configuration, organizing data, retrieving data efficiently, avoiding failure and performance degradation in a running cluster. Real-world use cases will detail how Elasticsearch is typically leveraged along with Apache Spark in distributed environments to process large amounts of heterogeneous data.\r\n","persons":[{"id":1144,"full_public_name":"Roy Russo","abstract":"Roy Russo is the co-author of Elasticsearch in Action and Vice President of Engineering at Predikto, a predictive analytics company. Before joining Predikto, Roy was the Chief Architect at AltiSource Labs, a FinTech startup based in Atlanta, GA. Roy was the Co-Founder and VP of Product Management for Atlanta-based Marketing Automation vendor, LoopFuse; acquired by Atlanta-based SalesFusion, Inc. Roy also helped Co-Found JBoss Portal, a JSR-168 compliant enterprise Java Portal, and represented JBoss on the Java Content Repository, JSR-170.\r\n","twitter_name":"","avatar_path":"/system/avatars/1144/large/download.jpeg?1513024701"}]},{"id":1596,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Serverless and Cloud","title":"An eventful journey from enterprise integration to serverless","track":"Serverless and Cloud","type":"lecture","abstract":"As technology evolves, we’re seeing new ways of connecting applications and services with more options for economically efficient approaches. In this talk we help you understand how event-driven architectures continue to evolve in a cloud-native and containerized world, by comparing and contrasting enterprise integration, event-driven microservices, data streaming and serverless. ","persons":[{"id":801,"full_public_name":"Marius Bogoevici","abstract":"Marius Bogoevici is the Chief Architect for data streaming at Red Hat.","twitter_name":"mariusbogoevici","avatar_path":"/system/avatars/801/large/zZ8CXo3P_400x400.jpg?1506689151"},{"id":826,"full_public_name":"Christian Posta","abstract":"Christian Posta (@christianposta) is a Chief Architect of cloud applications at Red Hat and well known in the community for being an author (Microservices for Java Developers, O’Reilly 2016), frequent blogger, speaker, open-source enthusiast and committer on various open-source projects. Christian has spent time at web-scale companies and now helps companies create and deploy large-scale, resilient, distributed architectures - many of what we now call Microservices. He enjoys mentoring, training and leading teams to be successful with distributed systems concepts, microservices, devops, and cloud-native application design.","twitter_name":"christianposta","avatar_path":"/system/avatars/826/large/profile.jpg?1506706006"}]},{"id":1279,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Serverless and Cloud","title":"Going Serverless with Apache OpenWhisk","track":"Serverless and Cloud","type":"lecture","abstract":"A general introduction to serverless with Apache OpenWhisk.","persons":[{"id":329,"full_public_name":"Raymond Camden","abstract":"Raymond Camden is a developer advocate for IBM. His work focuses on LoopBack, serverless, hybrid mobile development, Node.js, HTML5, and web standards in general. He's a published author and presents at conferences and user groups on a variety of topics. Raymond can be reached at his blog (www.raymondcamden.com), @raymondcamden on Twitter, or via email at raymondcamden@gmail.com.\r\n","twitter_name":"raymondcamden","avatar_path":"/system/avatars/329/large/ray3_2017.jpg?1507836294"}]},{"id":1394,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Serverless and Cloud","title":"While Visions of Cloud Functions Danced in their Heads","track":"Serverless and Cloud","type":"lecture","abstract":"We will take a deep dive into Google Cloud Platform's Cloud Functions solution for performing optical character recognition, using the Vision API to extract text from images, create storage buckets in Google Cloud Storage to store text from images and translate it into other languages, using Google Cloud Pub/Sub to listen for upload and translate events. ","persons":[{"id":556,"full_public_name":"Whitley Bacon","abstract":"Whitley is a Customer Engineer for Google Cloud, where she helps Google Cloud customers reach their business goals by enabling them to continuously ramp up on all things Google Cloud Platform. She also spent several years as a software engineer for The Home Depot and Vanguard. She is a proud Notre Dame graduate (Go Irish!) and you can find her checking into local Atlanta spots to boost her Yelp Elite profile, running races all around Atlanta, and spending time with her feisty cocker spaniel-poodle mix, Sophie. ","twitter_name":"whitbake_","avatar_path":"/system/avatars/556/large/whitley.jpg?1493410797"}]}],"Room 15":[],"Sidney Marcus":[{"id":2073,"date":"2018-02-23T09:00:00-05:00","start":"09:00","duration":"00:30","room":"Sidney Marcus","title":"The Future of the Cloud will be Containerized","track":"Keynote or 2nd Stage","type":"lecture","abstract":"The Cloud ushered in a new world of computing based on elastic infrastructure, automation, and managed services, but it took Containerization to unlock its true potential. ","persons":[{"id":1156,"full_public_name":"Kelsey Hightower","abstract":"Kelsey Hightower is a technologist working at Google help people adopt open source technologies and cloud computing.","twitter_name":"kelseyhightower","avatar_path":"/system/avatars/1156/large/AOB3guut_400x400.jpg?1514996930"}]},{"id":2061,"date":"2018-02-23T16:45:00-05:00","start":"16:45","duration":"00:30","room":"Sidney Marcus","title":"PRIZE GIVEAWAYS and conf close!","track":"Keynote or 2nd Stage","type":"podium","abstract":"We're raffling off a ton of great stuff: Macbook Pro's, iPads. Google Homes, more tshirts, backpacks and more! Stay till the end","persons":[{"id":11,"full_public_name":"Vincent Mayers","abstract":"","twitter_name":"vincentmayers","avatar_path":"/system/avatars/11/large/vincentm.jpg?1406565331"},{"id":7,"full_public_name":"Pratik Patel","abstract":"Pratik Patel is the CTO of Atlanta based startup TripLingo. He’s also an author, speaker, and consultant helping technologists build great apps, and business people make the most of technology. After many years in the big corporate world in places such as New York, London and Hong Long, he’s in the startup space now and hacks iOS, Android, Java, HTML5, CSS3, JavaScript, Rails, and ..... well everything except Perl. You can follow him on twitter at @prpatel.","twitter_name":"prpatel","avatar_path":"/system/avatars/7/large/profile-pic-09-11-2011.jpg?1406354223"}]},{"id":2113,"date":"2018-02-23T19:00:00-05:00","start":"19:00","duration":"01:30","room":"Sidney Marcus","title":"Conference after party at Joystick Gamebar!","track":null,"type":"","abstract":"Please join us for free drinks and food at Joystick Gamebar near downtown Atlanta! Grab some dinner between the conference closing at 5:30PM and 7PM and join us for some retro video games and networking. Bring your conference badge!\r\nJoystick address: 427 Edgewood Ave SE, Atlanta","persons":[]}],"Nighthacking":[{"id":1665,"date":"2018-02-23T12:00:00-05:00","start":"12:00","duration":"01:00","room":"Nighthacking","title":"OffHeap Live!","track":"Keynote or 2nd Stage","type":"other","abstract":"OffHeap Live!  The OffHeap gang is back to talk about the latest news and happenings within the java community.","persons":[{"id":850,"full_public_name":"Bob Paulin","abstract":"Bob Paulin is an independent consultant and speaker that has been developing open source software for the past 10 years. Bob has presented at large international conferences such as ApacheCon, JavaOne and Devnexus. He frequently shares his knowledge and opinions on the Java Pub House and Jave Off Heap podcasts. Bob is actively involved in the Chicago developer community as the Chicago Java User Group CFO and Chicago GOTO Jr presenter/organizer. Bob is a passionate member of the ASF and donates his time to Apache Felix and Apache Tika as a committer and PMC respectively. When not coding, Bob enjoys coaching football, robotics, and spending time with his wife and 3 kids. ","twitter_name":"bobpaulin","avatar_path":null},{"id":873,"full_public_name":"Michael Minella","abstract":"Michael Minella is a software engineer, teacher, speaker, and author with over 16 years of enterprise development experience. He currently works for Pivotal as the project lead for the Spring Batch and Spring Cloud Task projects. Michael has spoken on a number of Java, Spring, and Big Data topics and is a JavaOne Rockstar. Michael was a member of the expert group for JSR-352 (java batch processing). Michael is the author of Pro Spring Batch from Apress and the popular Refcard JUnit and EasyMock.\r\n\r\nOutside of the daily grind, Michael enjoys spending time with his family and enjoys woodworking, photography and InfoSec hobbies.","twitter_name":"michaelminella","avatar_path":"/system/avatars/873/large/me.jpg?1507129537"}]}],"Frameworks":[{"id":1591,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Frameworks","title":"Apache Kafka: A Streaming Data Platform","track":"Frameworks","type":"lecture","abstract":"When it comes time to choose a distributed messaging system, everyone knows the answer: Apache Kafka. But how about when you’re on the hook to choose a world-class, horizontally scalable stream data processing system? When you need not just publish and subscribe messaging, but also long-term storage, a flexible integration framework, and a means of deploying real-time stream processing applications at scale without having to integrate a number of different pieces of infrastructure yourself? The answer is still Apache Kafka.","persons":[{"id":656,"full_public_name":"Vik Gamov","abstract":"Viktor Gamov is a Solution Architect at Confluent, the company behind the popular Apache Kafka streaming platform. ","twitter_name":"gamussa","avatar_path":"/system/avatars/656/large/FCBF0EE3-EDF1-453A-9A40-BEA9284711DF.jpg?1506700500"}]},{"id":1446,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Frameworks","title":"What's New in Spring Boot 2.0","track":"Frameworks","type":"lecture","abstract":"Spring Boot 2.0 introduces a host of new features and whole lot of behind the scenes changes. This talk will cover all the major improvements, show you how to migrate and Boot 1.5 application and discuss some of the smaller tweaks and utilities that you might not be aware of.\r\n\r\nThe talk will also cover some of the changes we made to the Spring Boot internals, discuss why we made them, and how they will help with future releases.","persons":[{"id":812,"full_public_name":"Madhura Bhave","abstract":"Madhura Bhave is a developer at Pivotal on the Spring Boot team. Before joining the Spring Boot team, Madhura worked on the UAA (Authentication and Authorization component for Cloud Foundry).","twitter_name":"madhurabhave23","avatar_path":"/system/avatars/812/large/IMG_0325.JPG?1506539183"}]},{"id":1263,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Frameworks","title":"Getting Groovy With Spark Java","track":"Frameworks","type":"lecture","abstract":"Gone are the days of verbose, cumbersome frameworks that get in your way! Spark Java is a micro framework that is easy to learn, simple to use and makes your job as a developer easier.  It can be used to create anything from a REST API microservice to a full featured web application.  You can write your application or microservice using pure Java, but development gets even easier when you combine it with a the JVM language that you are most comfortable with like Kotlin or Groovy (or others).  In this talk we'll take a look at using Spark Java with Groovy.  You'll learn the basics of Spark Java and get introduced to some ways it can be extended by integrating it with the larger Java ecosystem to do things like persistence with ORM and rendering views with a variety of templating engines available.  Spark Java is so lightweight you can even run it on a Raspberry Pi!","persons":[{"id":688,"full_public_name":"Todd Sharp","abstract":"I'm a full stack developer who has been working with dynamic JVM languages and various JavaScript frameworks since 2004.  I started working with ColdFusion and graduated in 2011 to Groovy with Grails on the server side and has experience with everything from ExtJS to Knockout to AngularJS on the front end.  ","twitter_name":"recursivecodes","avatar_path":"/system/avatars/688/large/15035732_1310991748965002_2689404947618856960_n.jpg?1503360504"}]},{"id":1703,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Frameworks","title":"Lightweight Enterprise Java with MicroProfile","track":"Frameworks","type":"lecture","abstract":"I laugh at people that tell me that Java is slow, heavyweight and cumbersome. Maybe it was true when we had EJB2. I will prove to you that we can develop Enterprise Applications with just a few lines of code that can run in a Raspberry PI. If it runs in a PI, I think we can safely say it would run anywhere! To be able to do it, I'm going to use a new platform called Microprofile. Microprofile optimizes Enterprise Java for a Microservices Architecture and delivers application portability across multiple runtimes. You can use a subset of the Java EE specifications to develop Microprofile applications, with JAX-RS, CDI and JSON-P. Join me for this live coding session and help me spread the word that Java is actually great for the Enterprise.","persons":[{"id":918,"full_public_name":"Roberto Cortez","abstract":"Roberto Cortez is a passionate  Java Developer with more than 10 years of experience; mainly the Finance sector. He is involved within the Open Source Community to help other individuals spread the knowledge about Java EE technologies.\r\n\r\nHe is a regular speaker at conferences like JavaOne, Devoxx, JFokus, and others, leads the Coimbra JUG and enjoys writing blog posts. He is very excited to be a Triber; he now has the opportunity to work on the servers where everything happens, instead of just developing applications that run in a container.\r\n\r\nWhen he is not working, he hangs out with friends, play computer games and spends time with family.","twitter_name":"@radcortez","avatar_path":"/system/avatars/918/large/radcortez-high.jpg?1507765748"}]},{"id":1638,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Frameworks","title":"Let Your Data Flow with Apache NiFi","track":"Frameworks","type":"lecture","abstract":"Apache NiFi is an open-source tool built to address the challenges of enterprise data flow. This talk will give an introduction to NiFi and discuss how it fits into the enterprise architecture. We’ll take a deep dive into NiFi’s core capabilities, such as visual command & control, routing & transformation, dynamic prioritization, back-pressure, and data provenance. We’ll give an overview of NiFi’s extension model which lets developers build their own custom components using Java, or JVM compatible scripting languages, and we’ll conclude by building an example data flow and discussing future work being done by the open-source community. ","persons":[{"id":888,"full_public_name":"Bryan Bende","abstract":"Bryan Bende is a Staff Software Engineer at Hortonworks working on the Hortonworks Dataflow platform, and is a PMC Member and committer on the Apache NiFi project. He has over twelve years of experience developing enterprise software solutions, and received a B.S. in Computer Science from the University of Maryland at College Park, and a M.S. in Computer Science from John Hopkins University. \r\n","twitter_name":"bbende","avatar_path":"/system/avatars/888/large/P5-04082.jpg?1510930537"}]}],"Agile":[{"id":1981,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Agile","title":"Maps over Backlogs: User Story Mapping to share the Big Picture","track":"Agile","type":"lecture","abstract":"A flat backlog presents problems understanding context of individual items.  Determining the value of a user story in a vacuum is difficult, if not impossible.  We need the big picture!  User story mapping is a technique that can help us keep the big picture front and center.  We will discuss the challenges with flat backlogs, how user story mapping can help with those, do an activity to build a story map and discuss how to integrate this technique into the work you’re already doing.\r\n","persons":[{"id":389,"full_public_name":"mdclement","abstract":"Mike Clement is a husband, father of four, and Founding Software Craftsman of Greater Sum. Passionate about agile technical excellence, Mike founded and organizes Software Craftsmanship Atlanta and the Lean+Agile Atlanta Unconference.  Previous employers include Pluralsight, Ancestry.com and Microsoft. Find out more about Mike on his blog (http://blog.softwareontheside.com/) and on Twitter at @mdclement.","twitter_name":"mdclement","avatar_path":null}]},{"id":1303,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Agile","title":"The Trials and Tribulations of Agile Conversion","track":"Agile","type":"lecture","abstract":"There is a hidden side to agile adoption, one that is rarely spoken about at conferences. The dead ends that we reached, the frustrations within the teams, the roadblocks we hit and the staff turnover that occurred. Things that can not only halt an agile adoption, but if not dealt with, that can fracture a team that is not prepared for it. This session will be more encompassing than the path to success - it will cover the trials and tribulations of a team in transition.","persons":[{"id":718,"full_public_name":"Leigh Griffin","abstract":"Engineering Manager at Red Hat. Occasional Scrum Coach and Agile change management advocate. Passionate Open Source supporter","twitter_name":"leighgriffin","avatar_path":"/system/avatars/718/large/leigh_munich.JPG?1511262880"}]},{"id":1411,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Agile","title":"Mob Programming","track":"Agile","type":"lecture","abstract":"Three or more developers. Same time. Same computer. Mob programming is a great fit for a company that follows Agile practices. Find the best way to implement mob programming for your work and learn its many benefits.","persons":[{"id":788,"full_public_name":"Natasha Carlyon","abstract":"Natasha Carlyon is a former elementary school teacher turned web developer. She is currently a software engineer apprentice at Greater Sum, which uses agile practices to build custom software for clients. She loves sharing knowledge with others in the tech community through tweets, blogging, or speaking. When she is not programming, she is reading fantasy/sci-fi novels, dancing, or eating dark chocolate.","twitter_name":"nscarlyon","avatar_path":"/system/avatars/788/large/natasha_small.png?1506383441"}]},{"id":1699,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Agile","title":"Advanced Pipelines for Hypothesis-Driven Development","track":"Agile","type":"lecture","abstract":"We automated our deployment pipelines. We do blue/green and canary deployments. Now we need the next step to reach another level of software releases. Now we want to test our business hypothesis. Two different approaches outstand in this area: smart routers and feature toggles. We'll have it covered.\r\n\r\nCome to this session to see lots of demos and deployments with smart routers and feature toggles to check how effective A/B testing can be achieved. Of course A/B testing is nothing without monitoring, so we'll a monitoring platform setup and integrated for everything! You may be thinking about A/B, but after this session we'll get you from A to Z.","persons":[{"id":915,"full_public_name":"Edson Yanaga","abstract":"Edson Yanaga, Red Hat's Director of Developer Experience, is a Java Champion and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java, Microservices, Cloud Computing, DevOps, and Software Craftsmanship. ","twitter_name":"yanaga","avatar_path":"/system/avatars/915/large/edson_yanaga.jpg?1507757067"}]},{"id":2074,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Agile","title":"Keys to Delivering Valuable AND Working Software Frequently","track":"Agile","type":"lecture","abstract":"While the highest priority of an agile team is to satisfy the customer through early and continuous delivery of “valuable” software, the measure of progress is delivery of “working” software.  The conflict between the terms “valuable” and “working” have led to teams creating “business” stories that add value and “technical” stories that are a perceived nuisance.  The result is an unnecessary conflict between executives, business units, developers and operations that agile is meant to prevent.  During this session we will discuss techniques to follow agile principles while ensuring all stakeholder’s needs are met.","persons":[{"id":1152,"full_public_name":"Rob Gordick","abstract":"I am an agile servant leader and change agent with over a decade's experience in various agile software development frameworks and practices. I enable teams to develop a safe and learning culture which is passionate about value delivery.","twitter_name":"@rob_gordo","avatar_path":"/system/avatars/1152/large/Rob_Gordick.jpg?1513343246"},{"id":1157,"full_public_name":"Tim Begin","abstract":"","twitter_name":"","avatar_path":null}]}],"Architecture":[{"id":1489,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Architecture","title":"Open Source (R)Evolution","track":"Architecture","type":"lecture","abstract":"Open Source, why it's important, why you should care, and how can you help.","persons":[{"id":729,"full_public_name":"Andres Almiray","abstract":"Andres is a Java/Groovy developer and a Java Champion. Founding member of the Griffon framework and Hackergarten community event.","twitter_name":"aalmiray","avatar_path":"/system/avatars/729/large/aalmiray_joker_small.jpg?1512148821"}]},{"id":1384,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Architecture","title":"Reactive Integrations - Caveats and bumps in the road explained","track":"Architecture","type":"lecture","abstract":"Understand the different approaches to integrate fast data and streams based frameworks into your legacy applications and learn about the advantages, disadvantages, caveats, and bumps in the road.","persons":[{"id":784,"full_public_name":"Markus Eisele","abstract":"Two girls. One life. Writing code and more. Director of Developer Advocacy at @Lightbend.","twitter_name":"@myfear","avatar_path":"/system/avatars/784/large/me2_300x300.jpg?1505980054"}]},{"id":1361,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Architecture","title":"Hybrid Transaction/Analytical Processing -\"HTAP\"- What is it and Why It Matters","track":"Architecture","type":"lecture","abstract":"<p>According to Gartner, &ldquo;by 2019, adoption of HTAP-enabled in-memory data management platforms will almost triple from the 2016 level, driven by digital business projects.&rdquo; HTAP is about spotting trends and being aware of leading indicators in order to take immediate action.</p>","persons":[{"id":692,"full_public_name":"Kevin Goldstein","abstract":"A Principle Architect and low latency developer with over 17 years of experience in building high performance enterprise applications and trading systems. Kevin specializes in the low latency, messaging and algorithmic arena of trading, and has experience with front, middle and back office systems.","twitter_name":"","avatar_path":"/system/avatars/692/large/Kevin_Goldstein_Headshot.png?1513179413"}]},{"id":1692,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Architecture","title":"Container-based development in a polyglot enterprise","track":"Architecture","type":"lecture","abstract":"Deployments today are built piecemeal, using technologies and languages chosen for their appropriate application for a specific function, as opposed to just being “the language in which the application is written.” In similar fashion, they’re deployed across a broad range of platforms. In this talk, we’ll will go over some of the concerns that such a sprawling architecture needs to take into account.  We’ll cover some of issues involving polyglot environments (such as common data structures and network endpoints) and some potential solutions, gained through experience, for addressing those concerns.\r\n","persons":[{"id":912,"full_public_name":"Justin Lee","abstract":"Justin Lee, a Java Champion, has been programming in Java since 1996.  He has worked on virtually every level of the application stack from database drivers all the way to application servers and front end interfaces.  A long time advocate of Java, he has spoken at conferences and user groups all across the US and Europe.  He is an active open source community member contributing when and where he can. He recently relocated to Stockholm, Sweden with his family and can be found on twitter and github as @evanchooly.","twitter_name":"evanchooly","avatar_path":"/system/avatars/912/large/JustinProfile.jpg?1507749276"}]},{"id":1464,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Architecture","title":"Machine Learning Exposed","track":"Architecture","type":"lecture","abstract":"In this session, James Weaver will give a gentle introduction to machine learning topics such as supervised learning, unsupervised learning, reinforcement learning, and deep learning. He’ll also give you an overview of what you can achieve with machine learning, as well as an intuition on the maths behind it.","persons":[{"id":650,"full_public_name":"James Weaver","abstract":"James Weaver is a Java developer, author, and speaker with a passion for helping Java to be increasingly leveraged in cloud-native and machine learning applications.  He is a Java Champion, and a JavaOne Rockstar.  James has written books including Inside Java, Beginning J2EE, the Pro JavaFX series, and Java with Raspberry Pi.  As an Pivotal Developer Advocate, James speaks internationally at software technology conferences about Java and Cloud Native development.  James tweets as @JavaFXpert, blogs at http://JavaFXpert.com and http://CulturedEar.com and may be reached at jweaver [at] pivotal.io","twitter_name":"JavaFXpert","avatar_path":"/system/avatars/650/large/james-weaver-presenting-300px.png?1511217202"}]}],"Core Cloud":[{"id":2089,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Core Cloud","title":"riff is for functions","track":"Core Cloud","type":"lecture","abstract":"Riff is an open source polyglot function service built using Kubernetes primitives that allows developers to focus on writing simple and portable units of code. Its unique approach to reactive event streaming enables computations such as time windowing.\r\n\r\nAttend this demo-driven session to learn about the internal architecture of riff and how the use of patterns such as the function sidecar and layered container images help minimize the surface area of code function developers need to care about.","persons":[{"id":1170,"full_public_name":"Eric Bottard","abstract":"Eric Bottard is a core committer on the riff project working at Pivotal. \r\n\r\nEric has been a speaker at various conferences and user groups, including SpringOne, MiXiT Lyon, Devoxx France and the Paris Spring UG.","twitter_name":"","avatar_path":"/system/avatars/1170/large/Eric_Bottard_3.JPG?1517566792"},{"id":1161,"full_public_name":"Mark Fisher","abstract":"Mark has been a member of the Spring team for over a decade, contributing to the Spring Framework and several other projects. He founded Spring Integration in 2007 and is one of the authors of Spring Integration in Action, published by Manning in 2012. He contributes to Spring Cloud Stream, Spring Cloud Data Flow and Spring Cloud Function and is currently focused on Serverless and Functions as a Service.","twitter_name":"@projectriff","avatar_path":"/system/avatars/1161/large/mf.jpg?1516131267"}]},{"id":1310,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Core Cloud","title":"Enable IoT with Edge Computing and Machine Learning","track":"Core Cloud","type":"lecture","abstract":"The next evolution in cloud computing is a smarter application not in the cloud. As the cloud has continued to evolve, the applications that utilize it have had more and more capabilities of the cloud. This presentation will show how to push logic and machine learning from the cloud to an edge application. Afterward, creating edge applications which utilize the intelligence of the cloud should become effortless.\r\n","persons":[{"id":717,"full_public_name":"Jared Rhodes","abstract":"Microsoft Azure MVP specializing in IoT, Mobile, and Cloud. I enjoy long walks on the architecture and evenings spent debugging heisenbugs.","twitter_name":"@qimata","avatar_path":"/system/avatars/717/large/5002468.jpeg?1504576048"}]},{"id":1455,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Core Cloud","title":"Kubernetes, BUGS, and Raspberry PI… OH My!","track":"Core Cloud","type":"lecture","abstract":"Join us as we walk through setting up a Kubernetes (k8s) cluster of raspberry pis.  In this talk, we will show you how to make sure your operating system is ready for installation.  We will tackle problems encountered with network plugin installation and work around k8s issues. Once we have a working cluster, we will show you where to find ARM images and also how to build your own. We will top things off by deploying a working application using k8s","persons":[{"id":766,"full_public_name":"Charles Walker","abstract":"Charles is the chief architect at SUM Global Technology. He has two decades of IT experience in software development and architecture. He started his career working with C, C++ and Fortran but in 2001 migrated to Java and JEE. He is an avid technologist and open source evangelist who always enjoys learning something new.","twitter_name":"","avatar_path":"/system/avatars/766/large/linkedin.jpg?1506627850"},{"id":797,"full_public_name":"Chip Dickson","abstract":"Chip is the CTO of SUM Global Technologies. He is an avid technologist and open source advocate. He is fascinated with IoT and the massive data challenges it brings and the huge potential of edge computing.","twitter_name":"","avatar_path":"/system/avatars/797/large/ChipDickson.jpg?1506631759"}]},{"id":1793,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Core Cloud","title":"Continuous Deployment made easy with Spring Cloud Skipper","track":"Core Cloud","type":"lecture","abstract":"Spring Cloud Skipper is a continuous delivery platform that makes it easy to discover, install, upgrade, and rollback applications across multiple cloud platforms such as Cloud Foundry and Kubernetes. Skipper stores a versioned history of application manifests that declaratively describe how your applications were deployed in the cloud.   When upgrading a set of applications, Skipper only upgrades the applications that have changed and rolls out the new applications based on a customizable upgrade strategy.  Skipper also maintains custom application metadata of deployed applications that can be used to support operational dashboards.  \r\n\r\nIn this talk, you will learn how to build continuous delivery pipelines using existing CI products and application repositories by adding Skipper.  We will demonstrate how to take applications through initial deployment to QA, promotion to production, and rolling back across multiple cloud platforms.\r\n","persons":[{"id":975,"full_public_name":"Mark Pollack","abstract":"Mark Pollack is a software engineer with Pivotal and is the co-lead of the Spring Cloud Data Flow and Spring XD projects He has been a contributor to many Spring projects dating back to the Spring Framework in 2003 as well as founding the Spring.NET and Spring Data projects","twitter_name":"@markpollack","avatar_path":null}]},{"id":1919,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Core Cloud","title":"Cloudy... with a chance of Spaceballs","track":"Core Cloud","type":"lecture","abstract":"Humanity is turning its gaze beyond Earth orbit, seeking to become a multiworld species. NASA missions to Earth's moon, moons of Jupiter and Saturn and nearby asteroids are in development now. The complexities of the trajectory design for these missions present an overwhelming design space. The JavaFX based Deep Space Trajectory Explorer provides custom 2D/3D visualizations. Often the  design space however demands more computing power than available on a single system. Gluon's CloudLink provisioning provides a crucial yet elegant bridge to Oracle Cloud Platform and Bare Metal resources enabling mission success. Demonstration will include data related to manned Lunar surface excursion missions via the Deep Space Gateway.\r\n","persons":[{"id":1018,"full_public_name":"Sean M Phillips","abstract":"Sean Phillips is a Principal Software Engineer with NASA and USAF Aerospace industry leader a.i. solutions. Sean's specialties are data analysis and visualization using Java and JavaFX along with rich-client programming with the NetBeans Platform. Sean has created the Deep Space Trajectory Explorer, software for mission planning to deep space targets. Currently he serves as the lead software engineer for the NASA James Webb Space Telescope Flight Dynamics Ground System","twitter_name":"@seanmiphillips","avatar_path":"/system/avatars/1018/large/SeanMPhillips_Avatar.jpg?1510110519"}]}],"Web":[{"id":2065,"date":"2018-02-23T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Web","title":"Introduction To Grails For Spring Developers","track":"Web","type":"lecture","abstract":"Grails 3 is a high productivity web framework for the JVM. Grails 3 is built on top of Spring Boot. This session provides an introduction and overview of the framework for developers who are familiar with Spring.","persons":[{"id":1154,"full_public_name":"Jeff Brown","abstract":"Jeff Brown, Grails co-founder, has been doing JVM application development for as long as the JVM has existed and has spent most of the last decade focused specifically on work related to the Grails framework. \r\n\r\nJeff co-authored The Definitive Guide To Grails Second Edition, and The Definitive Guide To Grails 2, with Grails founder and OCI Grails Development Lead, Graeme Rocher. Jeff is a regular public speaker on Grails, Groovy and other JVM-related technologies.","twitter_name":"@jeffscottbrown","avatar_path":"/system/avatars/1154/large/jeff.png?1513694318"}]},{"id":1700,"date":"2018-02-23T11:15:00-05:00","start":"11:15","duration":"01:00","room":"Web","title":"Sluggish webapps no more with HTTP/2 and Vert.x","track":"Web","type":"lecture","abstract":"Do you have that feeling that no matter how much network speed gets faster, web pages always taker longer do load? It's 2017 and don't we already have a solution for this? In fact we do! The solution goes through HTTP/2 and Reactive Systems.\r\n\r\nJoin us on this session and we'll discuss the limitations of HTTP/1.1 and the new improvements brought to us by HTTP/2. But just HTTP/2 is not enough! We need to rearchitect part of our applications to allow higher concurrency and lower response times. We also need to be reactive: expects lots of demos and explore how Vert.x and HTTP/2 can solve the sluggish webapps problem.","persons":[{"id":915,"full_public_name":"Edson Yanaga","abstract":"Edson Yanaga, Red Hat's Director of Developer Experience, is a Java Champion and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java, Microservices, Cloud Computing, DevOps, and Software Craftsmanship. ","twitter_name":"yanaga","avatar_path":"/system/avatars/915/large/edson_yanaga.jpg?1507757067"}]},{"id":1460,"date":"2018-02-23T13:15:00-05:00","start":"13:15","duration":"01:00","room":"Web","title":"Dismantling a Progressive Web App","track":"Web","type":"lecture","abstract":"Sometimes we are not sure if using a specific tool is a good decision or not. How many libraries are available in the market? What will become standard? And, what is just a hype?\r\n\r\nPWA sounds like a new framework, or a tool to create some sort of web apps. Many developers link it to JavaScript, and that is only achievable with one of those new framework.js out there.\r\n\r\nI’ve been wondering about the truth of this previous statement, can we create a PWA in, let’s say, pure Java? I did some research and I’m going to present my findings.","persons":[{"id":486,"full_public_name":"AMahdy Abdelaziz","abstract":"Technical speaker, GDE, trainer & developer advocate. Passionate about Web & Mobile apps development, PWA, offline-first, Android internals, and customize AOSP.","twitter_name":"@amahdy7","avatar_path":"/system/avatars/486/large/face_512.png?1515525212"}]},{"id":1694,"date":"2018-02-23T14:30:00-05:00","start":"14:30","duration":"01:00","room":"Web","title":"Why Nobody Fills Out My Forms Part 2: Electric Boogaloo","track":"Web","type":"lecture","abstract":"Still having difficulty encouraging people to fill out web forms to sign up for newsletters, apply for jobs, or complete their online shopping orders? Find out even more tips to help keep people from abandoning early, such as making form field widths more convenient, easing credit card entry, grouping related fields into sections to promote scanning, and styling buttons and controls so your webpage does not look like it was written in 2000.","persons":[{"id":201,"full_public_name":"Andrew Malek","abstract":"Andrew is a UI developer and designer at NCR, focusing on POS (point-of-sale) and clienteling solutions. He has two decades of development experience in languages such as JavaScript, Visual Basic, Python, and C, and will admit to having developed a content management solution with Delphi and Perl if backed into a corner.","twitter_name":"malekontheweb","avatar_path":"/system/avatars/201/large/twitter-photo.png?1463362661"}]},{"id":1333,"date":"2018-02-23T15:45:00-05:00","start":"15:45","duration":"01:00","room":"Web","title":"Postman Delivers : API Development and Testing Made Easy","track":"Web","type":"lecture","abstract":"Whether you are a consumer or publisher of WebServices APIs, you would need a way to explore, evaluate and test APIs . In this talk, we will explore Postman, an easy-to-use, free app available for all the major platforms and also as a Chrome extension. I'll present a few slides and  then dive into a demonstration of the key features. \r\nWhether you are a developer or a QA engineer, this is a useful tool to have in your arsenal.","persons":[{"id":750,"full_public_name":"Priya Rajagopal","abstract":"Priya Rajagopal has been professionally developing software for over 18 years and is a Developer Advocate at Couchbase. She is an active member of the mobile development community where she frequently talks on mobile development related topics, does technical consulting / mentoring and organizes the Mobile Monday, Ann Arbor user group. While her current interests lie with mobile development, she has previously worked on a range of technologies and is a co-inventor on 22 US patents. ","twitter_name":"rajagp","avatar_path":null}]}]}}]}}}