{"schedule":{"conference":{"title":"Devnexus 2019","start":"2019-03-06","end":"2019-03-08","daysCount":3,"timeslot_duration":"00:10","days":[{"index":0,"date":"2019-03-06","day_start":"2019-03-06T07:00:00-05:00","day_end":"2019-03-06T21:00:00-05:00","rooms":{"2GM":[],"Agile":[],"Architecture":[],"Cloud Infra":[],"Cloud Tech ":[],"Core Java":[],"Frameworks":[],"Java Platform":[],"JavaScript":[],"Practices":[],"Security":[],"Tools - Techniques":[],"Web":[],"Foyer":[],"Unobtanium":[]}},{"index":1,"date":"2019-03-07","day_start":"2019-03-07T07:00:00-05:00","day_end":"2019-03-07T21:00:00-05:00","rooms":{"2GM":[{"id":3513,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"2GM","title":"Getting the Best of Grails 4.0 and Micronaut","track":"2GM","type":"lecture","abstract":"In this talk Grails and Micronaut creator Graeme Rocher will demonstrate how Grails developers can take advantage of Micronaut's coolest features. Whether you want to send messages to Kafka, make HTTP client calls or write WebSockets Micronaut has a great API that is easily usable from your Grails application.","persons":[{"id":1714,"full_public_name":"Graeme Rocher","abstract":"Graeme Rocher, co-founder of the Grails and Micronaut frameworks and co-author of The Definitive Guide to Grails, serves as Technical Lead for the OCI Grails & Micronaut team.\r\nGraeme has worked in the software development field for more than 20 years and has expertise in Grails, Groovy, Web Development, Dynamic Languages, and the JVM.","twitter_name":"@graemerocher ","avatar_path":"/system/avatars/1714/large/Graeme.png?1544122897"}]},{"id":3342,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"2GM","title":"Building Grails Apps on Google Cloud","track":"2GM","type":"lecture","abstract":"This talk will cover the basics of using Google cloud to build and deploy your Grails application. You will learn to use some basic services such as BigTable, Compute and Pub/Sub.","persons":[{"id":1658,"full_public_name":"Ryan Vanderwerf","abstract":"Ryan Vanderwerf is a developer on the Grails and Micronaut team at Object Computing, Inc. Previously, he was chief systems and software architect and director of products at ReachForce, where he helped design and build a Grails, Groovy, and AWS Cloud SaaS solution for marketing data management, and lead architect at Developerprogram.com, where he built a SaaS solution that allows rapid deployment of developer program portals for all kinds of companies. He has helped maintain various Grails plugins, built Java- and Linux-based webcasting for events such as SXSW, and built telecom software and SaaS systems for the financial sector. Ryan is cochair of the Austin Groovy and Grails User Group in Austin, TX, and coauthor of Effective Gradle Implementation.","twitter_name":"@RyanVanderwerf","avatar_path":"/system/avatars/1658/large/IMG_4671.jpg?1544122818"}]},{"id":3507,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"2GM","title":"Micronaut: The New Wiz on the Block","track":"2GM","type":"lecture","abstract":"As we head into the third decade of the 21st century, the demands on applications are vastly different than the past. We need speed, performance, efficiency, smaller footprint, and at the same time, ease of development. Micronaut is a new library that has been designed from the scratch to provide just that. In this presentation we'll learn about Micronaut, what it is useful for, and how to quickly build RESTful services and applications with it.\r\n","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]},{"id":3509,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"2GM","title":"Developing Micronaut Applications with Kotlin","track":"2GM","type":"lecture","abstract":"If you’re developing with Kotlin or getting started with the language, come to this talk to find out how to program your Micronaut application with Kotlin. Kotlin brings a variety of interesting features for fluency, type safety, and asynchronous programming. Learn how to leverage those capacities of the language in the context of Micronaut.","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]},{"id":3512,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"2GM","title":"Micronaut For Single Page Apps","track":"2GM","type":"lecture","abstract":"Single Page App (SPA) frameworks offer many benefits over traditional web apps which do all of their HTML generation on the server side.  Popular SPA frameworks include Vue, React and Angular.  Micronaut is very well suited for publishing REST APIs and is a terrific fit for implementing backend logic for SPAs.  This session will explore and demonstrate using Micronaut as the backend for SPA apps including the following specifics:\r\n\r\n- Introduction To Micronaut\r\n- Micronaut With Vue, Angular or React\r\n- Static Asset Resolution\r\n- Using JWT For Securing SPA Front Ends With Micronaut\r\n- Building With Gradle, NPM and Webpack\r\n- Deployment Options","persons":[{"id":1874,"full_public_name":"Zachary Klein","abstract":"Zachary Klein is a Senior Software Engineer at OCI.  He has been practicing web development since 2010 and frontend development since 2015. He's a contributor to both the Grails and Micronaut frameworks, as well as an instructor in OCI's training practice. Zachary's home base is in St Louis, MO, along with his wife, Beth, and three children.\r\n\r\n","twitter_name":"@ZacharyAKlein ","avatar_path":"/system/avatars/1874/large/Zak-3.png?1548352750"}]}],"Agile":[{"id":2959,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"00:50","room":"Agile","title":"Time to Good DX","track":"Agile","type":"workshop","abstract":"We often hear focus on the customer, but what do you do when you customers are your coworkers? Developers are the largest group of individual contributors in software teams. It's about time Developer Experience (DX) got the focus it deserves! Devs are users, too! Wouldn't it be great if your user needs were met?","persons":[{"id":565,"full_public_name":"Claire Moss","abstract":"Agilist working as part of product development teams to support and accelerate development through fast feedback. I help teams to craft more executable user stories. Strong understanding of needs of product team competencies testing, programming, product ownership, and user experience. Testing teacher, unit and integration test review and advisement, exploratory testing coach. Test automator and exploratory tester. Meetup founder, conference organizer, speaker, workshop facilitator, author, podcaster, and blogger.","twitter_name":"aclairefication","avatar_path":"/system/avatars/565/large/ClaireMoss.jpg?1493514383"},{"id":1499,"full_public_name":"Cheryl Spruce","abstract":"Cheryl Spruce – Senior Product Manager, The Home Depot\r\nCSM, SaFE Agilist, PMP, Certified Agile Leader, 25+ years supporting Information Technology\r\n\r\nCheryl has been with The Home Depot for 6 years. In my current role, I am leading IT Enterprise Architecture in transformation and adoption of product management.\r\n\r\nPreviously, held roles as a Software Engineer, Project and Program Manager, Agile Transformation Change Agent and Agile Coach.  My passion is to help teams improve and gain knowledge and experience for growth.  \r\nWhen outside of work, Cheryl likes to play tennis at the competitive level and visit with my family in Oregon and New York. \r\n","twitter_name":"cherylspruce","avatar_path":"/system/avatars/1499/large/cheryl_profile_pic.png?1550090931"}]},{"id":2883,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Agile","title":"Metrics that Matter - Moving from Easy to Impactful","track":"Agile","type":"lecture","abstract":"Metrics are the bane of many organizations, getting fascinated on measurements that don’t matter or can drive improper behaviours. In this session, we walk through a simple grouping for metrics where the groupings not only call out the metrics, but their limits, and help guide to better metrics.","persons":[{"id":897,"full_public_name":"Joel Tosi","abstract":"Just a dude helping organizations improve their product delivery ","twitter_name":"joeltosi","avatar_path":null}]},{"id":2821,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Agile","title":"¡Three Amigos! ","track":"Agile","type":"lecture","abstract":"Learn about the value of the Three Amigos practice of Behavior Driven Development to reduce rework, gain better clarity and understanding of user stories, and get Product Owner and user acceptance.","persons":[{"id":1455,"full_public_name":"Danny James","abstract":"Danny is a software engineer who has a passion for the integration and delivery of complex enterprise solutions. ","twitter_name":"","avatar_path":null},{"id":1415,"full_public_name":"M. Jeff Wilson","abstract":"M. Jeff Wilson is a avid software developer, published author, certified scrum master and SAFe Program Coach, and lifelong learner. He has worked with teams in the telecommunications, insurance, traffic engineering, retail, and other industries to develop and deliver solutions and improve processes. ","twitter_name":"","avatar_path":"/system/avatars/1415/large/profile-small.jpeg?1543266766"}]},{"id":2675,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Agile","title":"Proper Care & Feeding of Jr. Developers","track":"Agile","type":"lecture","abstract":"Jr. Devs require more than just a job; they need help from YOU. This talk will focus on actionable tasks which can be implemented by mid- and Sr. Devs to help their Jr. teammates be more effective and efficient team members. More importantly for Sr.'s, this talk will focus on ways to leverage being a great mentor to further their own career! ","persons":[{"id":1190,"full_public_name":"Valarie Regas","abstract":"Valarie Regas is a youngling developer, a Georgia Tech coding bootcamp graduate, and a veteran mommy. She holds a BA in Psychology and currently works as a Jr. DevOps Engineer. After years being a stay-at-home mom, she decided to change her life by entering Tech, and has learned a lot along the way. She enjoys mixed martial arts fighting, table-top role playing games, public speaking, creating tiny humans, and political activism.  ","twitter_name":"@ValarieRegas","avatar_path":"/system/avatars/1190/large/lowres_(1_of_5)_square.jpg?1541687121"}]},{"id":3231,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Agile","title":"Navigating the Slippery Slope of Emergent Design","track":"Agile","type":"lecture","abstract":"One of the best, and worst, things to come out of Agile is Emergent Design. More on the technical side of Agile, this session offers practical suggestions and real-life examples to help your team create a shared definition of \"just enough\" design. ","persons":[{"id":1611,"full_public_name":"Erika Burrows","abstract":"Erika Burrows, PMP, PMI-ACP is a JAVA Application Development Manager for Palmetto GBA, a subsidiary of Blue Cross Blue Shield of South Carolina.","twitter_name":"@ErikaForPres","avatar_path":"/system/avatars/1611/large/blog.jpg?1538344154"}]}],"Architecture":[{"id":2808,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Architecture","title":"Developer To Architect","track":"Architecture","type":"lecture","abstract":"Becoming a software architect is a longed-for career upgrade for many software developers. While the job title suggests a work day focused on technical decision-making, the reality is quite different. In this workshop, software architect Nathaniel Schutta constructs a real world job description in which communication trumps coding.","persons":[{"id":1058,"full_public_name":"Nathaniel Schutta","abstract":"Nathaniel T. Schutta is a software architect focussed on mobile and making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. In an effort to rid the world of bad presentations, Nate coauthored the book Presentation Patterns with Neal Ford and Matthew McCullough.","twitter_name":"ntschutta","avatar_path":"/system/avatars/1058/large/nts_pic_400x400.jpg?1510766283"}]},{"id":3152,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Architecture","title":"Reacting to the future of application architecture","track":"Architecture","type":"lightning_talk","abstract":"Ever wondered how honeybees have come to be some of the world's most efficient architects? Learn how we can all use mother nature's expertise to better architect our software solutions to be more reactive, responsive and resilient through reactive architecture frameworks.","persons":[{"id":1570,"full_public_name":"Grace Jansen","abstract":"Grace is a technical evangelist at IBM, primarily advocating the Reactive Platform offering. She has a degree in Biology with a specialty in the  modelling and prediction of biological systems. She has spoken at both internal and external conferences (e.g. DevoxxUK, THINK and QCon London).","twitter_name":"@gracejansen27","avatar_path":"/system/avatars/1570/large/bluepages_photo.png?1545408317"}]},{"id":2806,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Architecture","title":"Evolving to Cloud Native","track":"Architecture","type":"lecture","abstract":"Every organization has at least a phalanx or two in the Cloud and it is, understandably changing the way we architect our systems. But your application portfolio is full of heritage systems that hail from the time before everything was as a service. Not all of those applications will make it to the valley beyond, how do you grapple with your legacy portfolio? This talk will explore the strategies, tools and techniques you can apply as you evolve towards a cloud native future.","persons":[{"id":1058,"full_public_name":"Nathaniel Schutta","abstract":"Nathaniel T. Schutta is a software architect focussed on mobile and making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. In an effort to rid the world of bad presentations, Nate coauthored the book Presentation Patterns with Neal Ford and Matthew McCullough.","twitter_name":"ntschutta","avatar_path":"/system/avatars/1058/large/nts_pic_400x400.jpg?1510766283"}]},{"id":3044,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Architecture","title":"Achieving Undisturbed REST","track":"Architecture","type":"lecture","abstract":"Building an API is easy. Designing an API is hard. That's the motto of Undisturbed REST: a guide to designing the perfect API, and the book used by many of today's top enterprises to answer key questions and build a sustainable, efficient API that lasts. In this session we'll jump right in, tackling the questions you need to answer, looking at how to design your API, and learning from real examples in the field. And as a special bonus, each participant will receive a complimentary PDF version of the book to dig in and continue learning with.","persons":[{"id":1544,"full_public_name":"Mike Stowe","abstract":"Author of Undisturbed REST, Michael Stowe has spoken at conferences around the world. An active advocate for creating better architectures and interfaces, his work has also been featured on ProgrammableWeb, DZone, and InfoQ. You can view his past talks and slides at http://www.mikestowe.com/slides and follow him on Twitter @mikegstowe.","twitter_name":"mikegstowe","avatar_path":"/system/avatars/1544/large/headshot.jpg?1541721745"}]},{"id":3050,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Architecture","title":"Microservice Patterns - Implemented by Eclipse MicroProfile","track":"Architecture","type":"lecture","abstract":"This session presents a group of patterns commonly used in microservice based architectures. Each pattern will be in explained and demoed live in using Eclipse MicroProfile.","persons":[{"id":798,"full_public_name":"Ivar Grimstad","abstract":"Java Champion, JUG Leader, JCP Spec Lead, EC and EG Member, Jakarta EE WG, EE4J PMC, Oracle Developer Champion, Speaker, The guy with the Duke tattoo...","twitter_name":"ivar_grimstad","avatar_path":"/system/avatars/798/large/ivar_jc_240_241.png?1541667090"}]}],"Cloud Infra":[{"id":2776,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Cloud Infra","title":"Serverless Java Challenges and Triumphs","track":"Cloud Infrastructure (Microservices and Serverless)","type":"lecture","abstract":"This hands-on session examines the challenges to using Java for serverless functions and the latest Java platform features that address them. It also digs into the open source Fn project’s unparalleled Java support (including Kotlin), which makes it possible to build, test, and scale out Java-based functions applications.","persons":[{"id":1413,"full_public_name":"David Delabassée","abstract":"DevRel in the Fn Project - Serverless Team at Oracle","twitter_name":"@delabassee","avatar_path":"/system/avatars/1413/large/dd_devoxx_head_1000.jpeg?1533912517"}]},{"id":2913,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Cloud Infra","title":"Cloud-Native Networking With RSocket","track":"Cloud Infrastructure (Microservices and Serverless)","type":"lecture","abstract":"RSocket is an open-source network protocol developed in collaboration with Netflix, Facebook, Pivotal and others that was designed to handle the challenges of communication in the cloud. In this session, Ryland will discuss how RSocket is being used to simplify the way enterprises build and operate cloud-native applications, dramatically reducing operational overhead and speeding development by allowing developers to focus on their product instead of their network infrastructure.","persons":[{"id":1447,"full_public_name":"Ryland Degnan","abstract":"Ryland Degnan is a co-founder and CTO of Netifi, where he is working to lay the groundwork for the next generation of cloud-native applications. Prior to Netifi, he was a member of the Netflix Edge Platform team that created RSocket, Hystrix and RxJava. He has over 12 years of experience building scalable distributed systems at organizations like Netflix, Skydeck, and Cisco. Ryland holds an AB from Harvard University and an MSc from the University of Oxford.","twitter_name":"rjdegnan","avatar_path":"/system/avatars/1447/large/ryland.png?1535745523"}]},{"id":3165,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Cloud Infra","title":"Are you ready for cloud-native Java?","track":"Cloud Infrastructure (Microservices and Serverless)","type":"lecture","abstract":"Cloud-native. It's a great term, one that promises significant benefits for Java developers and Java applications. However there are traps for the unwary traveller undertaking this journey. It's best to be prepared and forewarned. In this talk hear more about what cloud-native Java looks like, and how it can differ from what you might be expecting.\r\n\r\nFrom application to JVM to hosting environment, there are challenges to face and obstacles to overcome before you've reached your goal. This talk will educate and remind you of the important points to be aware of, and will offer an opinionated view of the open technologies you should be including in your travel bag.\r\n\r\nWhether a new starter or an old hand, this session will leave you thinking differently about cloud-native Java!\r\n\r\n(Note: this talk may contain MicroProfile or OpenJ9 )","persons":[{"id":816,"full_public_name":"Steve Poole","abstract":"Steve Poole is a Developer Advocate, DevOps practitioner  and a long time IBM Java developer, leader and evangelist. He’s been working on Java SDKs and JVMs since Java was less than one year old. ","twitter_name":"spoole167","avatar_path":null},{"id":815,"full_public_name":"Graham Charters","abstract":"Graham is a (fairly ancient) Architect and IBM Senior Technical Staff Member now focusing on developer advocacy for Open Liberty at IBM's R&D Laboratory in Hursley, UK. He takes a keen interest in emerging technologies and practices and in particular programming models. His past exploits include establishing and contributing to open source projects at PHP and Apache and participation in, and leading, industry standards.","twitter_name":"@gcharters","avatar_path":"/system/avatars/815/large/charters-grey-220x220.jpg?1506593614"}]},{"id":3092,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Cloud Infra","title":"Splitting the Monolith","track":"Cloud Infrastructure (Microservices and Serverless)","type":"lecture","abstract":"There is no straightforward path to move from a monolith to microservices. Every case is different, and this is a very interesting one: gradually splitting a monolithic PHP application into several Java services.\r\n","persons":[{"id":716,"full_public_name":"Enrique Zamudio","abstract":"Enrique has been creating software professionally for more than 20 years, specializing in backend systems and host to host interfaces. He was named Java Champion in 2015 and worked on the Ceylon to Javascript compiler for 5 years. Lately he's been involved in cryptocurrency-related technologies.","twitter_name":"chochosmx","avatar_path":"/system/avatars/716/large/ezl_bitso_smallcrop.png?1537037705"}]},{"id":2941,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Cloud Infra","title":"Who Needs Servers Anyway?","track":"Cloud Infrastructure (Microservices and Serverless)","type":"lecture","abstract":"For many, serverless computing is the natural progression of the microservice philosophy. In this talk we’ll take a look at what that is and the benefits of going serverless. We’ll see how you can get started writing, testing, and deploying your functions on top of Apache OpenWhisk. We will see examples using several different programming languages. This talk will attempt to cover the very latest developments in this rapidly changing emerging field.","persons":[{"id":912,"full_public_name":"Justin Lee","abstract":"Justin Lee is Principal Software Engineer at Red Hat, a Java Champion, and has been programming in Java since 1996.  He has worked on virtually every level of the application stack from database drivers all the way to application servers and front end interfaces.  A long time advocate of Java, he has spoken at conferences and user groups all across the US and Europe.  He is an active open source community member contributing when and where he can. He can be found on twitter and github as @evanchooly.","twitter_name":"evanchooly","avatar_path":"/system/avatars/912/large/JustinProfile.jpg?1524234804"}]}],"Cloud Tech ":[{"id":3218,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Cloud Tech ","title":"Microservices Messaging","track":"Cloud Technology","type":"lecture","abstract":"Messaging has been around forever, and many Libraries, Frameworks and Design Patterns have emerged to solve different problems. Microservices are new trending topic and they are facing new problems. How can we solve them? Which Library should we use to integrate these new Systems? How can we make an abstraction to create fluent Streaming Messaging services that can help to solve these new problems? In this session you will learn how create highly scalable event-driven microservices for system integrations.","persons":[{"id":995,"full_public_name":"Felipe Gutierrez","abstract":"Over 20 years of IT experience, during which he has developed programs for companies in multiple vertical industries, such as: government, retail, healthcare, education and banking. He has developed Accounting and Administration enterprise systems, device driver construction, development of educational software, antivirus modules, batch processing for legacy system using new technologies, among others. He has extensive experience developing software, using technologies such as Java (J2EE, Groovy, Grails, Hibernate, Spring Framework), C++, .NET Framework (C#, VB .NET, ASP .NET), Delphi, Unix, Linux, Web Services, and PHP. Methodologies used RUP, Agile (Extreme Programming, Crystal, and SCRUM), and Emerging Technologies such as: Adobe Flex, iOS and Android.\r\n\r\nCurrently working for Pivotal as Sr. Platform Architect / Solutions Architect\r\n\r\nBook Author (Apress Publishing)\r\n- Introducing Spring Framework (http://www.apress.com/9781430265320)\r\n- Pro Spring Cloud Data Flow (work in progress – Feb 2018)\r\n- Pro Spring Boot (http://www.apress.com/us/book/9781484214329)\r\n- Spring Boot Messaging (http://www.apress.com/us/book/9781484212257)\r\n- Pro Spring Boot 2nd Edition (https://www.apress.com/us/book/9781484236758)\r\n\r\n","twitter_name":"@felipeg48","avatar_path":"/system/avatars/995/large/Me.jpg?1509416622"},{"id":1678,"full_public_name":"Dan Buchko","abstract":"Dan Buchko is an experienced Platform Architect currently working for Pivotal Software, with more than 25 years of industry experience.  He has worked on the design and integration of large enterprise class, real-time distributed systems leveraging messaging and caching technologies.  In his current role, Dan assists customers with applying cloud-native principles to modernize their applications to run on Pivotal Cloud Foundry. ","twitter_name":"","avatar_path":null}]},{"id":3037,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Cloud Tech ","title":"APIs, Chains, & Graphs","track":"Cloud Technology","type":"lecture","abstract":"Let’s face it, REST APIs can be problematic, and hypermedia hasn’t quite proven to be the answer we’ve looked for. GraphQL has quickly become more popular offering a solution to the problems REST created – but opens back up the very problems REST was created to avoid (remember SOAP?). But what if there was a way to take the best of both: enter API chains. In this session we’ll take a look at the pros and cons of REST, GraphQL, and a new specification and library for chaining numerous resource calls into a single HTTP request.","persons":[{"id":1544,"full_public_name":"Mike Stowe","abstract":"Author of Undisturbed REST, Michael Stowe has spoken at conferences around the world. An active advocate for creating better architectures and interfaces, his work has also been featured on ProgrammableWeb, DZone, and InfoQ. You can view his past talks and slides at http://www.mikestowe.com/slides and follow him on Twitter @mikegstowe.","twitter_name":"mikegstowe","avatar_path":"/system/avatars/1544/large/headshot.jpg?1541721745"}]},{"id":2601,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Cloud Tech ","title":"Event-driven Microservices","track":"Cloud Technology","type":"lecture","abstract":"This session covers the fundamentals, patterns, techniques and pitfalls of Event-driven Microservices with several demos leveraging Spring-Boot, Camel, ActiveMQ and Docker.","persons":[{"id":1373,"full_public_name":"Jeremy Deane","abstract":"Chief Architect at Foundation Medicine and software engineering aficionado.","twitter_name":"jtdeane","avatar_path":"/system/avatars/1373/large/headjtdeane1.jpg?1541682575"}]},{"id":3559,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Cloud Tech ","title":"The new new Cloud Native: Serverless Architecture","track":"Cloud Technology","type":"lecture","abstract":"Serverless architecture is the current pinnacle of cloud native and microservices. In this session we'll explore how all the cloud services come together, along with Serverless, to define the state of the art.","persons":[{"id":7,"full_public_name":"Pratik Patel","abstract":"All around software and hardware enthusiast. Helps to organize the Atlanta Java User Group and North Atlanta JavaScript meetups, frequent speaker at tech events, and master builder of nachos.","twitter_name":"prpatel","avatar_path":"/system/avatars/7/large/profile-pic-09-11-2011.jpg?1406354223"},{"id":765,"full_public_name":"Billy Korando","abstract":"Billy is a developer advocate with IBM and has over a decade of experience. Billy is passionate about finding ways to reduce mental capacity waste from tedious work; such as project initiation, deployment, testing and validation, and so on through automation and good management practices. Outside of work Billy enjoy traveling, playing kickball, and having his heartbroken by cheering on the Kansas City Chiefs.","twitter_name":"@BillyKorando","avatar_path":"/system/avatars/765/large/billy.jpg?1521070157"}]},{"id":3203,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Cloud Tech ","title":"Spring Skills: Creating talking applications with Spring","track":"Cloud Technology","type":"lecture","abstract":"In this example-driven presentation, you will learn how to develop voice-enabled Spring applications--applications that you can talk to. You'll see how to add a voice-UI on any Spring application for interaction via Amazon Alexa, Google Assistant, and potentially other voice devices.","persons":[{"id":1083,"full_public_name":"Craig Walls","abstract":"Spring Developer and a author of Spring in Action.","twitter_name":"habuma","avatar_path":"/system/avatars/1083/large/247032_10150611073575580_4897903_n.jpg?1511136831"}]}],"Core Java":[{"id":2716,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Core Java","title":"Exploring what's new in Java 10 and 11","track":"Core Java","type":"lecture","abstract":"<p>Thanks to the new release schedule, 2018 is seeing two releases of Java - 10 &amp; 11. In this live-coding session, we explore the most impactful features from these JDKs on a series of examples.</p>\r\n","persons":[{"id":752,"full_public_name":"Miro Cupak","abstract":"Miro is VP Engineering at DNAstack. He's passionate about Java, genetics, and building meaningful things.","twitter_name":"@mirocupak","avatar_path":"/system/avatars/752/large/profile-cas-800.JPG?1534114244"}]},{"id":3127,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Core Java","title":"Java Puzzlers NG S03: What? Where did those came from?!","track":"Core Java","type":"lecture","abstract":"You know what to expect in this session by now: funny and puzzling questions about Java, airborne JFrog t-shirts, and the usual combo of learning and fun ahead!","persons":[{"id":864,"full_public_name":"Baruch Sadogursky","abstract":"JFrog Developer Advocate","twitter_name":"@jbaruch","avatar_path":"/system/avatars/864/large/2017_official.jpg?1537124114"}]},{"id":3552,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Core Java","title":"Live Hacking: Exploiting vulnerabilities you wish your Java app didn't have","track":"Core Java","type":"lecture","abstract":"Open source modules are undoubtedly awesome. However, they also represent an undeniable and massive risk. You’re introducing someone else’s code into your system, often with little or no scrutiny. The wrong package can introduce severe vulnerabilities into your application, exposing your application and your user's data. This talk will use a sample application, Goof, which uses various vulnerable dependencies, which we will exploit as an attacker would. For each issue, we'll explain why it happened, show its impact, and – most importantly – see how to avoid or fix it. We'll live hack exploits like the classic struts vulnerability that recently made it famous, along with Spring Break and several others.","persons":[{"id":827,"full_public_name":"Simon Maple","abstract":"Simon is the Director of Developer Relations at Snyk, a Java Champion since 2014, JavaOne Rockstar speaker in 2014 & 2017, Duke’s Choice award winner, Virtual JUG founder and organiser and London Java Community co-leader.","twitter_name":"sjmaple","avatar_path":"/system/avatars/827/large/Simon-Speaker.jpg?1506706949"}]},{"id":3314,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Core Java","title":"Reactive Relational Database Connectivity","track":"Core Java","type":"lecture","abstract":"As more and more projects start incorporating reactive programming, they start to discover that the only way to get the full benefit of that change is to ensure that they have a fully reactive stack. There are a number of messaging systems and data stores that enable this fully reactive stack, but there has been a big piece missing when it comes to accessing relational database systems in a fully reactive way. This talk presents the Reactive Relational Database Connectivity (R2DBC) project. The project is a test-bed for what a reactive API would look like when paired with relational database access. This talk will explain how the API works, the benefits of using it, and how it contrasts with the ADBC project proposed as a successor to JDBC.","persons":[{"id":1015,"full_public_name":"Ben Hale","abstract":"Ben Hale leads Pivotal's Java Cloud Foundry efforts including being a founding member of the Cloud Native Buildpacks CNCF Sandbox project and leading the Cloud Foundry Java Buildpack.  In addition to this work, he's very involved in the Reactive Programming scene founding the Reactive Relational Database Connectivity (R2DBC) project, being a spec lead and committer on the RSocket Reactive networking protocol, and being a long-time contributor to Project Reactor.  In what little spare time he has left, Ben loves riding his bike, especially in the high mountains of the Italian Dolomites.","twitter_name":"nebhale","avatar_path":"/system/avatars/1015/large/Headshot-4.jpg?1545171511"}]},{"id":3015,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Core Java","title":"Writing better functional Java code","track":"Core Java","type":"lecture","abstract":"In Java 8 functional style programming was introduced in Java. Although many are still working Java 8, new releases 9,10 and 11 extended this with some nice new features. For many people it is hard to grasp the idea of functional style programming after so many years of purely working in the imperative OOP style. The opportunities Java gives us out of the box are massive, but with great power comes great responsibility.","persons":[{"id":1037,"full_public_name":"Brian Vermeer","abstract":"Developer Advocate for Snyk and Software Engineer with over 10 years of hands-on experience in creating and maintaining Software. He is passionate about Java, (Pure) Functional Programming and Cybersecurity. \r\n\r\nBrian is an Oracle Groundbreaker Ambassador and regular international speaker on mostly Java related conferences like JavaOne, Oracle Code One, Devoxx BE, Devoxx UK, Jfokus, JavaZone and many more.\r\n\r\nBesides all that Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher.","twitter_name":"BrianVerm","avatar_path":"/system/avatars/1037/large/brian_OCO_400x400.jpg?1547920986"}]}],"Frameworks":[{"id":3901,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Frameworks","title":"Building Reactive Pipelines","track":"Frameworks","type":"lecture","abstract":"In this session, learn how Project Reactor enables you to create scalable reactive apps, how streaming platforms help, & how Spring Cloud Stream leverages both to provide fully reactive pipelines for system-wide (ridiculous!) scalability.\r\n\r\n_The presenter will code all examples live & in real-time_.","persons":[{"id":1181,"full_public_name":"Mark Heckler","abstract":"Mark Heckler is a Pivotal Principal Technologist & Spring Developer Advocate, conference speaker, published author, & Java Champion focusing upon developing innovative production-ready software at velocity for the Cloud and IoT applications. He has worked with key players in the manufacturing, retail, medical, scientific, telecom, and financial industries and various public sector organizations to develop and deliver critical capabilities on time and on budget. Mark is an open source contributor and author/curator of a developer-focused blog (https://www.thehecklers.com) and an occasionally interesting Twitter account (@mkheck).","twitter_name":"@mkheck","avatar_path":"/system/avatars/1181/large/MarkHecklerProfilePic.jpg?1533228955"}]},{"id":2976,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Frameworks","title":"Bulletproof Java Enterprise Applications for The Hard Production Life","track":"Frameworks","type":"lecture","abstract":"It’s one thing to develop Java Enterprise applications, to execute, and validate them in test environments. Running the application in production, however, is a whole other story. Production life is harsh, unforgivable and the ultimate verification whether your application is able to add value to its users. Besides knowing the Java Enterprise APIs, developers therefore also need to know how to meet production requirements.","persons":[{"id":882,"full_public_name":"Sebastian Daschner","abstract":"Sebastian Daschner is a Java Developer Advocate at IBM, a consultant, author, and trainer. He is the author of the book ‘Architecting Modern Java EE Applications’. Sebastian is participating in the JCP, helping forming the future standards of Java EE, serving in the JAX-RS, JSON-P and Config Expert Groups and collaborating on various open source projects. For his contributions in the Java community and ecosystem he was recognized as a Java Champion, Oracle Developer Champion and double 2016 JavaOne Rockstar. Besides Java, Sebastian is also a heavy user of Linux and cloud native technologies. He evangelizes computer science practices on https://blog.sebastian-daschner.com, his newsletter, and on Twitter via @DaschnerS. When not working with Java, he also loves to travel the world — either by plane or motorbike.","twitter_name":"@DaschnerS","avatar_path":"/system/avatars/882/large/sebastian4.jpg?1536818345"}]},{"id":3020,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Frameworks","title":"What's New in JHipster 5","track":"Frameworks","type":"lecture","abstract":"Learn about all the new features in JHipster 5. Watch a demo of an application being generated and modified. See an app go from nothing to production live.","persons":[{"id":577,"full_public_name":"Dennis Sharpe","abstract":"Dennis Sharpe is a software architect with over 20 years experience leading, designing, and coding software applications. He has experience in a variety of different industries including healthcare, federal government, loyalty, marketing, utilities, telecommunications, and financial. He has experience speaking at several conferences and events including DevNexus, DevFest and Java User Groups. He also has experience training and providing technical leadership for hackathons and coding dojos.","twitter_name":"@SharpeDennis","avatar_path":"/system/avatars/577/large/profile-suit.jpeg?1500734835"}]},{"id":3071,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Frameworks","title":"Crossing the Streams: Rethinking Stream Processing with KStreams and KSQL","track":"Frameworks","type":"lecture","abstract":"All things change constantly! And dealing with constantly changing data at low latency is pretty hard. It doesn’t need to be that way. Apache Kafka, the de facto standard open source distributed stream processing system. Many of us know Kafka’s architectural and pub/sub API particulars. But that doesn’t mean we’re equipped to build the kind of real-time streaming data systems that the next generation of business requirements are going to demand. We need to get on board with streams!","persons":[{"id":1439,"full_public_name":"Tim Berglund","abstract":"Tim is a teacher, author, and technology leader with Confluent, where he serves as the Senior Director of Developer Experience. He can frequently be found at speaking at conferences in the United States and all over the world. He is the co-presenter of various O’Reilly training videos on topics ranging from Git to Distributed Systems. He is a co-host of the http://devrelrad.io podcast and lives in Littleton, CO, USA with the wife of his youth.","twitter_name":"tlberglund","avatar_path":"/system/avatars/1439/large/001berglund-5-square.jpg?1534547229"},{"id":656,"full_public_name":"Vik Gamov","abstract":"Viktor Gamov is a Developer Advocate at Confluent, the company that makes a streaming platform based on Apache Kafka.\r\n","twitter_name":"gamussa","avatar_path":"/system/avatars/656/large/FCBF0EE3-EDF1-453A-9A40-BEA9284711DF.jpg?1506700500"}]},{"id":3296,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Frameworks","title":"MicroProfile and Jakarta EE - What's Next?","track":"Frameworks","type":"lecture","abstract":"MicroProfile is well established as a microservices development platform. It blazed the trail for the Jakarta EE movement. In it's short tenure, MicroProfile has introduced us to the Fault Tolerance, JWT Propagation, Metrics, Rest Client, Config, Health Check, OpenAPI, and OpenTracing programming models. But, what's next for these two key Eclipse projects? Will MicroProfile stay independent and continue to demonstrate it's fast-paced innovation? Or, will it be combined with Jakarta EE, which is also promising a faster development cycle than the previous Java EE platform? Come to this session to learn about our current direction and to provide feedback.","persons":[{"id":1633,"full_public_name":"Kevin Sutter","abstract":"Kevin has been actively developing in Java ever since he could spell \"WebSphere\".  Kevin's most recent endeavor is leading the IBM effort on the Eclipse MicroProfile project (http://microprofile.io).  He is also a member of the Eclipse EE4J PMC (https://projects.eclipse.org/projects/ee4j), which is guiding the effort of moving Java EE to the Eclipse Foundation.","twitter_name":"@kwsutter","avatar_path":"/system/avatars/1633/large/sutter2016.jpg?1538488184"}]}],"Java Platform":[{"id":3740,"date":"2019-03-07T07:30:00-05:00","start":"07:30","duration":"01:30","room":"Java Platform","title":"Registration & Breakfast","track":"Other","type":"","abstract":"Lunch","persons":[]},{"id":3728,"date":"2019-03-07T09:00:00-05:00","start":"09:00","duration":"00:50","room":"Java Platform","title":"Mixed Paradigm: the method to madness","track":"Keynote","type":"lecture","abstract":"Language Paradigms are intriguing, some languages are pure and enforce a particular paradigm, and yet some languages are hybrid. A single paradigm language is consistent, easier to use, and often favored by the proponents of the promoted paradigm. Hybrid languages often appear confusing, seem harder to use, and yet there are so many of them. From the programming point of view should we stick to one paradigm or should we dabble into the mixed paradigm arena? It turns out, that is not an easy question.","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]},{"id":3545,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Java Platform","title":"Kotlin jumpstart with Venkat and Josh, part 1","track":"Java Platform","type":"lecture","abstract":"A two hour, live-coded, presentation on getting you on the road to Kotlin with Josh Long and Venkat S!","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"},{"id":1669,"full_public_name":"Josh Long","abstract":"Josh (@starbuxman) is the Spring Developer Advocate at Pivotal. Josh is a Java Champion, author of 5 books (including O'Reilly's Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry) and numerous best-selling video trainings (including Building Microservices with Spring Boot Livelessons with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring Integration, Spring Cloud, Activiti and Vaadin). \r\n","twitter_name":"starbuxman","avatar_path":"/system/avatars/1669/large/professional-studio-shoot-by-richard-october-2018.jpg?1539382905"}]},{"id":3730,"date":"2019-03-07T11:00:00-05:00","start":"11:00","duration":"00:20","room":"Java Platform","title":"Break 1.1","track":"Other","type":"","abstract":"Break","persons":[]},{"id":3546,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Java Platform","title":"Kotlin jumpstart with Venkat and Josh, part 2","track":"Java Platform","type":"lecture","abstract":"A two hour, live-coded, presentation on getting you on the road to Kotlin with Josh Long and Venkat S!","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"},{"id":1669,"full_public_name":"Josh Long","abstract":"Josh (@starbuxman) is the Spring Developer Advocate at Pivotal. Josh is a Java Champion, author of 5 books (including O'Reilly's Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry) and numerous best-selling video trainings (including Building Microservices with Spring Boot Livelessons with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring Integration, Spring Cloud, Activiti and Vaadin). \r\n","twitter_name":"starbuxman","avatar_path":"/system/avatars/1669/large/professional-studio-shoot-by-richard-october-2018.jpg?1539382905"}]},{"id":3737,"date":"2019-03-07T12:20:00-05:00","start":"12:20","duration":"01:00","room":"Java Platform","title":"Lunch 1.0","track":"Other","type":"","abstract":"Lunch","persons":[]},{"id":2867,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Java Platform","title":"JVM.Languages.Compare(Java, Kotlin, Groovy, Scala);","track":"Java Platform","type":"lecture","abstract":"One of key pillars of the Java language strength is the Java Virtual Machine - with its openness to other languages, it allows developers to choose the right tool for their job and still benefit from the rich Java ecosystem. This led to the creation of many different languages in the past years, with some languages getting more attention and traction than others. Still, most Java developers don’t use or have ever tried anything besides the “plain old Java”! In this talk, we’ll show how these languages compare regarding syntax, target use cases and projects that use them. This will help you expand your tool set and choose the right language for your next essay!\r\n","persons":[{"id":1005,"full_public_name":"Donald Raab","abstract":"Donald Raab works in the Application Platform and Services team at BNY Mellon in the Jersey City Innovation Center. Donald is a member of the Java Specification Request (JSR) 335 Expert Group and has presented at JavaOne, Devoxx US, EclipseCon, GIDS and the JVM Language Summit. He created the Eclipse Collections Java library which was originally open sourced as GS Collections in 2012 and migrated to the Eclipse Foundation in 2015.","twitter_name":"@TheDonRaab","avatar_path":"/system/avatars/1005/large/PZjOBoO9_400x400.jpeg?1510755909"},{"id":884,"full_public_name":"Nikhil Nanivadekar","abstract":"Nikhil Nanivadekar is a vice president in Private Wealth Management within Goldman Sachs Engineering. He joined Goldman Sachs in 2012 upon graduation from the University of Utah with a Masters in Mechanical Engineering with specialization in Robotics and Controls. Nikhil is also the project lead of Eclipse Collections and has presented at JavaOne, DevoxxUS, Great Indian Developer Summit and various Java User Group meetups. He is passionate about robotics and has conducted robotics workshops at JCrete4Kids, JavaOne4Kids and Devoxx4Kids. Nikhil is a Java Champion and an Oracle Developer Champion.","twitter_name":"nikhilnanivade","avatar_path":null}]},{"id":3731,"date":"2019-03-07T14:20:00-05:00","start":"14:20","duration":"00:20","room":"Java Platform","title":"Break 1.2","track":"Other","type":"","abstract":"Break","persons":[]},{"id":2924,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Java Platform","title":"Is Java Still Free?","track":"Java Platform","type":"lecture","abstract":"The way the core Java platform is developed and distributed is changing significantly. In this session, we'll explain all the changes from the release cycle, long-term support and availability of updates. Is Java still free, or do you have to pay for it? Find out what your options are.","persons":[{"id":1504,"full_public_name":"Simon Ritter","abstract":"Simon Ritter is the Deputy CTO of Azul Systems.  Simon joined Sun Microsystems in 1996 and spent time working in both Java development and consultancy.  He has been presenting Java technologies to developers since 1999 focusing on the core Java platform.","twitter_name":"speakjava","avatar_path":"/system/avatars/1504/large/SimonRitter-04A-SQ.jpg?1536327466"}]},{"id":3732,"date":"2019-03-07T15:40:00-05:00","start":"15:40","duration":"00:20","room":"Java Platform","title":"Break 1.3","track":"Other","type":"","abstract":"Break","persons":[]},{"id":3232,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Java Platform","title":"JDK Releases: Migrate early, migrate often!","track":"Java Platform","type":"lecture","abstract":"A Java release every 6 months? Awesome! But maybe you’re worried about upgrading and deprecation?  Don’t be!  This session highlights the tools and concrete strategies necessary for adapting to the new OpenJDK release cycle. Come learn from JVM developers how to prepare for continuous change without losing your mind.","persons":[{"id":1612,"full_public_name":"Dan Heidinga","abstract":"Dan Heidinga is an Eclipse OpenJ9 project lead while also leading IBM's J9 VM Interpreter team.  He has been involved with virtual machine development since 2007 and has represented IBM on multple JSRS include JSR 292 ('invokedynamic') and JSR 335 ('lambda').  He has his hands in most new JVM features and all major Java releases. In the past he's spent entirely too long staring at Java bytecode while maintaining the verifier and still enjoys an occasional detour into Smalltalk development.  As of this year, he's also an CodeOne Rockstar.","twitter_name":"@DanHeidinga","avatar_path":"/system/avatars/1612/large/DanHeidinga_resized.png?1542835022"}]},{"id":3733,"date":"2019-03-07T17:00:00-05:00","start":"17:00","duration":"00:10","room":"Java Platform","title":"Break 1.4","track":"Other","type":"","abstract":"Break","persons":[]},{"id":3727,"date":"2019-03-07T17:10:00-05:00","start":"17:10","duration":"00:50","room":"Java Platform","title":"Keynote: The Whys and Hows of Evolutionary Architecture","track":"Keynote","type":"lecture","abstract":"The perceptions of Evolutionary Architecture have progressed rapidly from something considered heretical to something considered essential yet challenging. The shift has resulted from changes in both the business climate with its need for rapid innovation and the supporting technology that makes Evolutionary Architecture feasible. Describing these changes sets up a discussion about the mechanics of implementing an evolutionary architecture. We'll particularly focus on the central role of fitness functions in driving the architecture in the desired direction and how techniques such as refactoring databases and continuous delivery support architectural evolution. We'll close by looking at what the future holds. ","persons":[{"id":1877,"full_public_name":"Rebecca Parsons","abstract":"Dr. Rebecca Parsons is ThoughtWorks’ Chief Technology Officer with decades-long applications development experience across a range of industries and systems. Her technical experience includes leading the creation of large-scale distributed object applications and the integration of disparate systems. Separate from her passion for deep technology, Dr. Parsons is a strong advocate for diversity in the technology industry. Committed to increasing the number of women in coding and STEM fields, Dr. Parsons served on the board of CodeChix and acted as an advisor to Women Who Code.","twitter_name":"rebeccaparsons","avatar_path":"/system/avatars/1877/large/profile_image_avatar-417e18be9961518d949524907b1896f8.jpeg?1548364553"}]},{"id":3739,"date":"2019-03-07T18:00:00-05:00","start":"18:00","duration":"01:30","room":"Java Platform","title":"Conference Reception","track":"Other","type":"","abstract":"Lunch","persons":[]}],"JavaScript":[{"id":2951,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"JavaScript","title":"JavaScript: Hey y'all, watch this!","track":"JavaScript","type":"lecture","abstract":"Ah, JavaScript! Like it or not, it's a \"tragically important\" language that is \"eating the world.\" Hate it? Love it? Avoid it? Embrace it?\r\n\r\nThis talk will be a parade of face-palm JavaScript fails, stupid JavaScript tricks, and bad jokes sure to get an eye-roll from everyone! \r\n\r\nAlong the way, we may even learn a few mistakes to avoid and tips to make our own JavaScript less terrible!","persons":[{"id":612,"full_public_name":"David Neal","abstract":"David is a family man, musician, illustrator, software developer, and Microsoft MVP living in North Georgia. He is currently a Senior Developer Advocate for Okta, runs on a high-octane mixture of caffeine and JavaScript, and is made entirely of bacon.","twitter_name":"reverentgeek","avatar_path":"/system/avatars/612/large/reverentgeek_avatar_v2.jpg?1536689346"}]},{"id":3371,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"00:50","room":"JavaScript","title":"Functional Programming with TypeScript","track":"JavaScript","type":"lecture","abstract":"We'll look at how to start writing functional code with TypeScript and refactor some examples pulled from a real production application. ","persons":[{"id":560,"full_public_name":"Bryan Oliver","abstract":"Bryan is an experienced presenter, with over 20 different talks via Meetup and Conferences. He is an avid web developer with years of experience working with open source technologies. His strongest skills are in TypeScript and Angular, and he works regularly with Mobile technologies (such as Ionic) and backend Technologies like Node.js and Golang.","twitter_name":"olivercodes","avatar_path":"/system/avatars/560/large/35788281_2101890316765770_4244036564486717440_o.jpg?1539473361"}]},{"id":3355,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"JavaScript","title":"JavaScript Performance Cage Match: (Map, Filter and Reduce) vs For Loop","track":"JavaScript","type":"lecture","abstract":"Higher-order functions built in to the Array object, like Map, Filter, and Reduce make our code more declarative and readable. But, how do these functions perform against for and forEach loops? Come watch these methodologies go head-to-head as we see just how fast each of these functions compare to similar loops!","persons":[{"id":767,"full_public_name":"Scott McAllister","abstract":"Scott McAllister has been building web applications in several industries for over a decade. Now he's helping others learn about a wide range of web technologies. When he's not coding, writing or speaking he enjoys long walks with his wife, skipping rocks with his kids, and is happy whenever Real Salt Lake can manage a win.","twitter_name":"stmcallister","avatar_path":"/system/avatars/767/large/Scott-McAllister-1400.jpg?1519849693"}]},{"id":3506,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"JavaScript","title":"Getting Started with Service Workers","track":"JavaScript","type":"lecture","abstract":"A Service Worker is a relatively new API that’s been introduced in modern web browsers in the last few years. It’s a special kind of web worker that can be installed in your browser to provide features that were previously unavailable to ordinary web pages. Find out how to create them and use them in a Progressive Web App.","persons":[{"id":332,"full_public_name":"Jennifer Bland","abstract":"Jennifer Bland is a Senior Software Developer for Hearst Autos, specializing in MEAN stack development. She has more than ten years of development experience working for companies like CNN, Coca-Cola and Apple Computer. Jennifer is the author of the book “Developing e-Business Applications Using Lotus Domino on the AS/400\", published by IBM.\r\n\r\nShe runs the website codeprep.io which provides interview questions to assist programmers in preparation for job interviews. Her personal website is jenniferbland.com.\r\n\r\nJennifer holds a B.A. in History from Furman University and an MBA from San Jose State University.\r\n","twitter_name":"ratracegrad","avatar_path":"/system/avatars/332/large/Jennifer-Bland-headshot.jpg?1494079160"}]},{"id":2850,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"JavaScript","title":"Testing, Testing, 1, 2, NaN","track":"JavaScript","type":"lecture","abstract":"Santa Clause, The Free Lunch, and JS Testing - All myths? We all know Testing is key, but it’s not easy. What are your options, what exists, and what works? Let’s talk about it all. What tools exist, and what matters in testing JavaScript, React, and React Native.","persons":[{"id":471,"full_public_name":"Gant Laborde","abstract":"Inspirational technology strategist.  Tinkerer at heart, but with a passion to ship a quality product at the end.  Love leadership and teaching has driven me to many conferences worldwide.","twitter_name":"gantlaborde","avatar_path":"/system/avatars/471/large/gant-face.jpg?1484858603"}]}],"Practices":[{"id":3148,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Practices","title":"A Research Study into DevOps bottlenecks","track":"Practices and other tech","type":"lecture","abstract":"We asked a Fortune 500 software delivery leaders what holds them back. This talk is the analysis of their insights on what bottlenecks they encountered in their DevOps journey. We share discoveries on what helped them to overcome the bottlenecks and how they plan to deliver even faster. Using this we define some unifying themes on what areas provide the greatest return on investments of time and resources.","persons":[{"id":864,"full_public_name":"Baruch Sadogursky","abstract":"JFrog Developer Advocate","twitter_name":"@jbaruch","avatar_path":"/system/avatars/864/large/2017_official.jpg?1537124114"}]},{"id":3182,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Practices","title":"What You Need to Know About Open Source","track":"Practices and other tech","type":"lecture","abstract":"Come learn what open source really means and investigate the most popular OSS licenses in use today—from a lawyer's perspective. We all use open source in our projects. It is important to understand the impact it has on our work and our organizations.","persons":[{"id":1117,"full_public_name":"Jeff Strauss","abstract":"Jeff is a software developer, an entrepreneur, and an attorney. He maintains a passion for solving problems with inspired solutions, improving life through technology. Beyond speaking, Jeff is a conference organizer, helping to run the Kansas City Developer Conference.","twitter_name":"jeffreystrauss","avatar_path":"/system/avatars/1117/large/strauss_avatar.jpg?1537809330"}]},{"id":2785,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Practices","title":"TDD, BDD, and Java Oh My!","track":"Practices and other tech","type":"lecture","abstract":"Every one knows that testing your code goes a long way in improving quality. However, approaches to do this is varied. This session will discuss a rather opinionated approach of combining test and behavior driven development for integration testing of Java applications.","persons":[{"id":844,"full_public_name":"Cecili Reid","abstract":"Cecili Reid is a software engineer at NCR building cloud enabled microservices for their Omnichannel Decision Support Platform. As an engineer, Cecili strongly believes in test driven development and automation and incorporates both whenever she can.","twitter_name":"@cecili_reid","avatar_path":null}]},{"id":3120,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Practices","title":"Want to Succeed with TDD? Stop Writing Tests!","track":"Practices and other tech","type":"lecture","abstract":"Test Driven Development (TDD) has been around for almost twenty years and, despite the claims of its followers, many developers aren't impressed and just don't do it. But wait, TDD is a foundational practice for agile development and things like DevOps, and succeeding with Microservices. \r\nSo what's a developer to do? Come to this session. You’ll leave understanding the real problem with TDD and knowing how to succeed with it.","persons":[{"id":233,"full_public_name":"Burk Hufnagel","abstract":"Burk is a long-time programmer and software architect, with experience in multiple languages including Java and JavaScript. He’s presented at multiple conferences including ConnectTech, DevNexus, and JavaOne, and contributed to two of the “97 Things” books published by O’Reilly. <br>Burk works as a Technical Architect for Daugherty Business Solutions where he's focused on finding ways to deliver better code in less time, and teaching others how to do the same thing.","twitter_name":"@BurkHufnagel","avatar_path":"/system/avatars/233/large/Burk.jpeg?1537069825"}]},{"id":2828,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Practices","title":"Badass 101","track":"Practices and other tech","type":"lecture","abstract":"Would Chuck Norris ask you to come hear him speak at a conference?  No, he wouldn't.  He would TELL you that you're coming, and then roundhouse kick you in the face if you gave him any more lip.","persons":[{"id":269,"full_public_name":"Lyndsey Padget","abstract":"Lyndsey Padget is a MEAN full stack developer, healthy teams advocate, git enthusiast, and advocate for women in tech.","twitter_name":"lyndseypadget","avatar_path":"/system/avatars/269/large/02fefe9.jpg?1436672210"}]}],"Security":[{"id":2641,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Security","title":"Containing the Cloud","track":"Security","type":"lecture","abstract":"Curious about the current state of container security? Want to know what the best practices are for creating images? Interested in the current container security offerings? You're in luck! Come join me as we explore the attack surface for containers. Recent exploits. Best practices for creating container images. And the current offerings for container security.","persons":[{"id":840,"full_public_name":"Wes Widner","abstract":"Wes Widner engineers clouds with Crowdstrike. Large-scale distributed threat intelligence systems that span a range of threat vectors are his bread and butter.","twitter_name":"kai5263499","avatar_path":null}]},{"id":2982,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Security","title":"Securing the JVM","track":"Security","type":"lecture","abstract":"The Java API allows a lot: sending packets over the network, compiling code, etc. If you put an application in an production environment, you need to make sure it doesn’t do more than it’s supposed to do.","persons":[{"id":895,"full_public_name":"Nicolas Fränkel","abstract":"Developer Advocate. Former Developer, Software Architect, Author. Blogger. Learner.","twitter_name":"nicolas_frankel","avatar_path":"/system/avatars/895/large/id_5_big.jpg?1542011331"}]},{"id":2860,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Security","title":"10 Mistakes Hackers Want You to Make","track":"Security","type":"lecture","abstract":"You've seen big data breaches in the news. But as a developer who doesn't specialize in security you might find it hard to protect yourself from becoming the next victim. In this talk, you'll learn the most common reasons that some systems get hacked and what practical measures you can take as a developer to keep your apps safe.","persons":[{"id":842,"full_public_name":"Joe Kutner","abstract":"Joe is the Java Languages Owner at Heroku. He was named a JavaOne Rock Star in 2016, and authored Deploying with JRuby.","twitter_name":"codefinger","avatar_path":"/system/avatars/842/large/purple_bowtie.jpg?1541860127"}]},{"id":2957,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Security","title":"Useful Cryptography, an Introduction","track":"Security","type":"lecture","abstract":"Cryptography is often thought of as a scary topic, but it doesn't have to be. In this talk, you'll learn about different types of useful cryptography, how they work (without needing a PhD in mathematics), and how to immediately start applying these concepts in your projects.","persons":[{"id":1518,"full_public_name":"Randall Degges","abstract":"Randall Degges is a happy programmer living in California. He loves working on open source and security-focused software both at work and home. His goal is to make the internet a little better every day.","twitter_name":"rdegges","avatar_path":"/system/avatars/1518/large/forward-js.jpg?1536687847"}]},{"id":3311,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Security","title":"Spring Security 5.1 by Example","track":"Security","type":"lecture","abstract":"In this talk we will be taking an insecure, set of microservices and gradually apply Spring Security 5.1 to it. Along the way we will highlight the new features in Spring Security 5.1 including password storage migrations, new  OAuth2 Client and Resource Server Support, and more. Whether you are new to Spring Security or a seasoned Spring Security user, this presentation is a must.","persons":[{"id":1171,"full_public_name":"Rob Winch","abstract":"Project Lead of Spring Security","twitter_name":"rob_winch","avatar_path":"/system/avatars/1171/large/profile.jpg?1517592720"}]}],"Tools - Techniques":[{"id":3262,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Tools - Techniques","title":"Busy Developer's Guide to Virtual Machines","track":"Tools and Techniques","type":"lecture","abstract":"Ever wanted to get a sense of how a virtual machine (like the JVM, CLR or V8) does its magic? Swing by and find out, as we build a truly simple--but functional--virtual machine from nothing.","persons":[{"id":773,"full_public_name":"Ted Neward","abstract":"Computational philosopher: techno-jargon for I am a big geek. Currently Director of Developer Relations at Smartsheet.","twitter_name":"@tedneward","avatar_path":"/system/avatars/773/large/javapolis_400x400.png?1511207937"}]},{"id":2795,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Tools - Techniques","title":"Debugging with the Scientific Method","track":"Tools and Techniques","type":"lecture","abstract":"<p>People see debugging as an occult art, when often it is the easiest part of software development. Debugging is a perfect closed world in which to apply the scientific method.</p>","persons":[{"id":1444,"full_public_name":"Stuart Halloway","abstract":"@stuarthalloway is a founder and President of Cognitect (formerly Relevance). He is a Clojure committer, and a developer of the Datomic database.\r\n\r\nStuart has spoken at a variety of industry events, including StrangeLoop, Clojure/conj, EuroClojure, ClojureWest, SpeakerConf, QCon, GOTO, OSCON, RailsConf, RubyConf, JavaOne, and NFJS.\r\n\r\nStuart has written a number of books and technical articles. Of these, he is most proud of Programming Clojure.","twitter_name":"stuarthalloway","avatar_path":"/system/avatars/1444/large/stuarthalloway.jpg?1534691622"}]},{"id":2805,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Tools - Techniques","title":"JUnit 5 the Next Step in Automated Testing for Java","track":"Tools and Techniques","type":"lecture","abstract":"JUnit 5 has been out for a year, so what is the big fuss and why should I take the time to update my existing automated tests to use JUnit 5? In this presentation we will look at many of the new features that have been added in JUnit 5 and not only how they make automated testing easier, but allow developers and organizations to encourage and enforce good development practices through the tests we write. If you have been wondering why you should make the switch from JUnit 4 to JUnit 5 you will definitely want to check out this presentation.","persons":[{"id":765,"full_public_name":"Billy Korando","abstract":"Billy is a developer advocate with IBM and has over a decade of experience. Billy is passionate about finding ways to reduce mental capacity waste from tedious work; such as project initiation, deployment, testing and validation, and so on through automation and good management practices. Outside of work Billy enjoy traveling, playing kickball, and having his heartbroken by cheering on the Kansas City Chiefs.","twitter_name":"@BillyKorando","avatar_path":"/system/avatars/765/large/billy.jpg?1521070157"}]},{"id":3150,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Tools - Techniques","title":"Computer Vision vs Machine Learning","track":"Tools and Techniques","type":"lecture","abstract":"Set against the backdrop of the capabilities of the browser, this interactive session compares and contrasts both approaches through two different applications. In the first, you will learn image processing and feature detection techniques to track, and solve, a Rubik’s Cube. In the second, you will learn to apply those techniques to build an object classifier for facial recognition. Sit in the front row at your own risk!","persons":[{"id":1572,"full_public_name":"Kevin Hoyt","abstract":"Kevin Hoyt is a Program Manager at IBM, leading a team of developer advocates focused on technologies ranging from blockchain and serverless, to Node.js and Java. Passionate about Web Standards, Kevin enjoys blending the physical with the digital using IoT and computer vision.","twitter_name":"krhoyt","avatar_path":"/system/avatars/1572/large/kevin.hoyt.jpg?1537302000"}]},{"id":2917,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Tools - Techniques","title":"Top 10 SQL Performance tips & tricks for Java Developers","track":"Tools and Techniques","type":"lecture","abstract":"Want to get the best performance out of your SQL execution time? This primer will give you the top 10 common tips and tricks that will help you speed up your database queries. Even if you are already seasoned in SQL and SQL Tuning, the session will be a good refresher.","persons":[{"id":1434,"full_public_name":"Gerald Venzl","abstract":"Common-Sense Developer, Oracle expert, performance enthusiast and genuine technology geek","twitter_name":"GeraldVenzl","avatar_path":"/system/avatars/1434/large/Bio2.jpg?1536189679"}]}],"Web":[{"id":3244,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Web","title":"Guide to \"Reactive\" for Spring MVC","track":"Web","type":"lecture","abstract":"This talk is a guide for Spring MVC developers to understand the reactive features available to them to add value to existing applications.","persons":[{"id":822,"full_public_name":"Rossen Stoyanchev","abstract":"Spring Framework committer at Pivotal.","twitter_name":"rstoya05","avatar_path":"/system/avatars/822/large/rossen-small.jpg?1538397241"}]},{"id":2900,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Web","title":"An Introduction to WebAssembly","track":"Web","type":"lecture","abstract":"In this talk, I'm going to explain how WebAssembly works and how to use it. I'll cover what it is, how it fits into your application, and how to build and use your own WebAssembly modules. And, I'll demo how to build and use those modules with both Rust and the WebAssembly Text Format. That's right, I'll be live coding in an assembly language. ","persons":[{"id":1495,"full_public_name":"Guy Royse","abstract":"Guy works for DataRobot in Columbus, Ohio as a Developer Evangelist. Combining his decades of experience in writing software with a passion for sharing what he has learned, Guy goes out into developer communities and helps others build great software.","twitter_name":"guyroyse","avatar_path":"/system/avatars/1495/large/guy-royse-nexosis-square-smaller.jpg?1536080573"}]},{"id":3380,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Web","title":"Vue.js for Regular People","track":"Web","type":"lecture","abstract":"A workshop that will take you from simple Vue demos to full applications.","persons":[{"id":329,"full_public_name":"Raymond Camden","abstract":"Raymond Camden is a developer advocate looking for his next gig. He's a published author and presents at conferences and user groups on a variety of topics. Raymond can be reached at his blog (www.raymondcamden.com), @raymondcamden on Twitter, or via email at raymondcamden@gmail.com.","twitter_name":"raymondcamden","avatar_path":"/system/avatars/329/large/ray3_2017.jpg?1507836294"}]},{"id":3282,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Web","title":"CSS Fundamentals","track":"Web","type":"lecture","abstract":"This class is intended for a complete novice to CSS, or those who know enough to get by, but hate everything about it. We will be covering the the basics of CSS (including specificity), using preprocessors, as well as several practical best practices to keep you out of CSS hell. ","persons":[{"id":952,"full_public_name":"Jessica Kennedy","abstract":"Jessica is a senior software engineer at Inmar, inc. Specializing in front end architecture, specifically around css, she brings over 10 years of full stack experience to the table. Her current role involves working as part of a polyglot team of engineers working full-stack within an ever-evolving ecosystem of technologies.","twitter_name":"mistersender","avatar_path":"/system/avatars/952/large/Kennedy_Jessica_sm.jpg?1513015256"}]},{"id":2858,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Web","title":"Writing End-To-End Tests Using Headless Chrome and Puppeteer","track":"Web","type":"lecture","abstract":"End-to-end tests are great! They ensure a great experience for your users, prevent bugs, and save money. However, they also have a history of being brittle and slow... but not any more! In this talk we'll cover end-to-end testing conceptually, then use Headless Chrome and Puppeteer to write powerful tests that can run on top of any stack.","persons":[{"id":1276,"full_public_name":"Taylor Krusen","abstract":"A tech-enthusiast and Japanophile, Taylor Krusen is an Associate Developer Advocate for Smartsheet. He typically spends his time coding, snowboarding, or teaching his little girl the art of mischief. Taylor's passion for travel, collaboration, and learning have instilled in him a significant appreciation for diversity of thought.","twitter_name":"TaylorKrusen","avatar_path":"/system/avatars/1276/large/headshot_KCDC2018.jpg?1534354599"}]}],"Foyer":[],"Unobtanium":[{"id":3920,"date":"2019-03-07T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Unobtanium","title":"Serverless or IaaS? Why not both - with Knative","track":"Unobtanium","type":"lecture","abstract":"Is my application better suited for a serverless platform or a IaaS system such as Kubernetes? This an increasingly common question developers face nowdays and represents the all-or-nothing approach of many serverless platforms. Knative differs from these platforms by extending one of the most popular IaaS layers (Kubernetes) to make it a serverless platform. With this approach we can remove this dichotomy and have our cake and eat it too!\r\n \r\nThis talk will explore what Knative is at its core: a set of custom Kubernetes resources, and how these allow us to extend Kubernetes to turn it in to a serverless platform. We will explain the integration points between Knative and other technologies such as istio and how we leverage CRDs to enable pluggability for service vendors. We will also demonstrate how Knative is workload agnostic and can easily run and scale existing applications from zero to infinity.","persons":[{"id":1928,"full_public_name":"Gregory Haynes","abstract":"Cloud Infrastructure Engineer","twitter_name":"ibmdeveloper","avatar_path":"/system/avatars/1928/large/greg.jpeg?1549662001"}]},{"id":3271,"date":"2019-03-07T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Unobtanium","title":"A Java Space Odyssey: Fun with flying saucers, lasers, Pis and Arduino","track":"Unobtanium","type":"lightning_talk","abstract":"Space Sentry Challenge is a fun arcade game that allows players to take control of a 3D printed spaceship to shoot down pop-up targets.  It uses popular IoT kits like Arduino, ESP wifi modules and Raspberry Pi with Microservices built with Eclipse MicroProfile. In this talk, you will learn how to bring your Arduino projects online using modern Java technologies.","persons":[{"id":1622,"full_public_name":"Prashanth G","abstract":"Prashanth Gunapalasingam, Software Engineer, IBM\r\n\r\nHe is software developer for OpenLiberty development.\r\n\r\n","twitter_name":"","avatar_path":"/system/avatars/1622/large/speakerPrashanth.jpg?1548368147"},{"id":1605,"full_public_name":"Frank Ji","abstract":"IBM Cloud software Developer and IBM AI Technical Accelerator. I've been working on various IBM Java and cloud offerings presently including WebSphere Application Server, Open Liberty, and IBM Cloud Private.","twitter_name":"","avatar_path":"/system/avatars/1605/large/Screen_Shot_2018-09-29_at_1.01.01_PM.png?1538240603"}]},{"id":3833,"date":"2019-03-07T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Unobtanium","title":"Spring and the Mystery of the Polyglot Stack.","track":"Unobtanium","type":"lecture","abstract":"Modern Cloud Native applications are not composed of a single language, or runtime. There are often local standards and requirements for individual services, intended to allow the application as a whole to be properly managed, and secure. In this talk, Erin and Ozzy will discuss what it means to be a Spring application in a polyglot environment, with a focus on interoperable security, logging, metrics, and including a brief boat trip to view the architectural considerations for a Spring Cloud application on Kubernetes.","persons":[{"id":1876,"full_public_name":"Erin Schnabel","abstract":"Erin Schnabel is a Senior Technical Staff Member at IBM working with microservice architectures, cloud native applications, composable runtimes and Java. Erin has 20 years under her belt, as a developer, technical leader, architect and evangelist. She is passionate about developer experience, particularly with how the evolving cloud ecosystem impacts developers and their applications. She prefers learning (and teaching) by doing, as demonstrated by her open source exploits with \"Game On!\" (gameontext.org), a text adventure game that provides developers with a playground to experimenting with backend technologies.","twitter_name":"ebullientworks","avatar_path":null},{"id":1613,"full_public_name":"Ozzy Osborne","abstract":"Ozzy has over two decades of experience in Enterprise Software Development for IBM, mainly working with Java based technologies and enterprise middleware. An enthusiastic developer, who loves to \"make things work\", and who isn't scared to take things apart to figure out how, his most recent focus has been Cloud Native architectures.","twitter_name":"OzzyDweller","avatar_path":"/system/avatars/1613/large/codeportraitPicture-45.png?1548772663"}]},{"id":3823,"date":"2019-03-07T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Unobtanium","title":"Kubernetes & the 12 factors cloud applications","track":"Unobtanium","type":"lecture","abstract":"The 12 factors represent the expression of cloud application perfection, yet the cloud-agnostic Kubernetes gets us closer to it! Kubernetes flexibility complements the 12 factors apps with their flavours across frameworks and cloud providers. In this session I will showcase how applications complying with the 12 factors can graciously take advantage of the best practices with Kubernetes. Each of the principles will be illustrated by a demo.","persons":[{"id":1879,"full_public_name":"Ana Maria Mihalceanu","abstract":"Ana-Maria Mihalceanu is a custom application development enthusiast, co-founder of Bucharest Software Craftsmanship Community and a constant adopter of challenging technical scenarios. Some of her older experiments are available on Dzone. Other passions? The knowledge hunt through reading and growing fashion skills through shopping.","twitter_name":"@ammbra1508","avatar_path":"/system/avatars/1879/large/eu.png?1548405259"}]},{"id":3919,"date":"2019-03-07T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Unobtanium","title":"Akka and Kubernetes, the beginning of a beautiful relationship","track":"Unobtanium","type":"lecture","abstract":"One of the best features of Akka is Akka Cluster. Akka cluster allows for building distributed applications, where one application or service spans multiple nodes. From its initial release in 2013, Akka Cluster needed a node management system to manage the Akka nodes and to provide resilience and elasticity. With Kubernetes Akka finally has a node management system. Akka Cluster has been designed to gracefully handle nodes leaving and joining a running cluster while continuing to run. Kubernetes adds and removes nodes as needed to increase capacity or to recover from failures. In effect, there is a perfect symbiosis between Akka Cluster and Kubernetes. In this talk, we will look at and demonstrate how Akka Cluster and Kubernetes work together and how together they form a beautiful relationship.","persons":[{"id":937,"full_public_name":"Hugh McKee","abstract":"Hugh McKee is a developer advocate at Lightbend. He has had a long career building applications that evolved slowly, that inefficiently utilized their infrastructure, and that was brittle and prone to failure. That all changed when we started building reactive, asynchronous, actor-based systems. This radically new way of building applications rocked his world. As an added benefit, building application systems became way more fun than it had ever been. Now he is focused on helping others to discover the significant advantages and joys of building responsive, resilient, elastic, message-driven applications.","twitter_name":"mckeeh3","avatar_path":"/system/avatars/937/large/me-ye-restaurant-atlanta-250.png?1508189960"}]}]}},{"index":2,"date":"2019-03-08","day_start":"2019-03-08T07:00:00-05:00","day_end":"2019-03-08T21:00:00-05:00","rooms":{"2GM":[{"id":3511,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"2GM","title":"Micronaut Deep Dive","track":"2GM","type":"lecture","abstract":"This talk is for developers looking to go beyond the basics with Micronaut. Taking an extensive look at how advanced features like Dependency Injection (DI), Aspect Oriented Programming (AOP) and Ahead of Time (AOT) compilation work, the creator of Micronaut Graeme Rocher will walk attendees through Micronaut's elegant programming model.","persons":[{"id":1714,"full_public_name":"Graeme Rocher","abstract":"Graeme Rocher, co-founder of the Grails and Micronaut frameworks and co-author of The Definitive Guide to Grails, serves as Technical Lead for the OCI Grails & Micronaut team.\r\nGraeme has worked in the software development field for more than 20 years and has expertise in Grails, Groovy, Web Development, Dynamic Languages, and the JVM.","twitter_name":"@graemerocher ","avatar_path":"/system/avatars/1714/large/Graeme.png?1544122897"}]},{"id":3350,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"2GM","title":"Micronaut Http Client","track":"2GM","type":"lecture","abstract":"Micronaut's HTTP client is powerful, robust, and loaded with features that put the cloud in cloud native.  This talk will cover in depth how to use the HTTP client in Micronaut, including the declarative and imperative styles. The client supports many cloud ready features like retry, service discovery, circuit breaker, and more. ","persons":[{"id":1662,"full_public_name":"James Kleeh","abstract":"James is a member of the OCI Grails and Micronaut team, and has been programming with Groovy & Java for more than 7 years. He has deep knowledge of the full web stack as well as a strong background in relational database centric applications and is a passionate software developer that strives for elegant solutions to complex problems.  James has many years of experience in the education industry and has worked with many of the technology companies near his hometown. Beyond the world of software engineering, James enjoys science fiction, games, and spending time with his family in Youngstown, OH.  ","twitter_name":"Schlogen","avatar_path":"/system/avatars/1662/large/James.png?1544122742"}]},{"id":3346,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"2GM","title":"Micronaut and Alexa","track":"2GM","type":"lecture","abstract":"The Amazon Echo is more than a home toy - you can have the real star trek experience in your home with hooks into home automation platforms, streaming music, news, help you cook, tell you jokes, etc. Now let's use Micronaut to build Alexa Skills! I will go over how to make them in two ways, via Micronaut web app and via functions with AWS Lamba. You can use Groovy, Java or Kotlin for both of these approaches! I will bring one to demonstrate some fun things you can do with it. I'm sure if you don't already have one you'll be hacking away as soon as you get home. \r\n","persons":[{"id":1658,"full_public_name":"Ryan Vanderwerf","abstract":"Ryan Vanderwerf is a developer on the Grails and Micronaut team at Object Computing, Inc. Previously, he was chief systems and software architect and director of products at ReachForce, where he helped design and build a Grails, Groovy, and AWS Cloud SaaS solution for marketing data management, and lead architect at Developerprogram.com, where he built a SaaS solution that allows rapid deployment of developer program portals for all kinds of companies. He has helped maintain various Grails plugins, built Java- and Linux-based webcasting for events such as SXSW, and built telecom software and SaaS systems for the financial sector. Ryan is cochair of the Austin Groovy and Grails User Group in Austin, TX, and coauthor of Effective Gradle Implementation.","twitter_name":"@RyanVanderwerf","avatar_path":"/system/avatars/1658/large/IMG_4671.jpg?1544122818"}]},{"id":3514,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"2GM","title":"Micronaut: The Power of Ahead of Time (AOT) Compilation ","track":"2GM","type":"lecture","abstract":"Micronaut introduces a completely revolutionary way to build applications through the use of Ahead of Time (AOT) compilation that allows building significantly more resource efficient applications.\r\n\r\nIn this talk Micronaut creator Graeme Rocher will demonstrate the features that developers can take advantage of to power applications with AOT compilation including type visitors, checkers, and annotation mappers.","persons":[{"id":1714,"full_public_name":"Graeme Rocher","abstract":"Graeme Rocher, co-founder of the Grails and Micronaut frameworks and co-author of The Definitive Guide to Grails, serves as Technical Lead for the OCI Grails & Micronaut team.\r\nGraeme has worked in the software development field for more than 20 years and has expertise in Grails, Groovy, Web Development, Dynamic Languages, and the JVM.","twitter_name":"@graemerocher ","avatar_path":"/system/avatars/1714/large/Graeme.png?1544122897"}]},{"id":3345,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"2GM","title":"$Getting Paid$ - Working with Ethereum with Micronaut and Grails","track":"2GM","type":"lecture","abstract":"Working with blockchain is all the rage these days. A lot of the guides and examples to use it are not in JVM based languages. I'll show you how to get started building in conducting transactions in Micronaut and Grails, and how Ethereum and smart contracts work and how to create them.\r\n\r\n","persons":[{"id":1658,"full_public_name":"Ryan Vanderwerf","abstract":"Ryan Vanderwerf is a developer on the Grails and Micronaut team at Object Computing, Inc. Previously, he was chief systems and software architect and director of products at ReachForce, where he helped design and build a Grails, Groovy, and AWS Cloud SaaS solution for marketing data management, and lead architect at Developerprogram.com, where he built a SaaS solution that allows rapid deployment of developer program portals for all kinds of companies. He has helped maintain various Grails plugins, built Java- and Linux-based webcasting for events such as SXSW, and built telecom software and SaaS systems for the financial sector. Ryan is cochair of the Austin Groovy and Grails User Group in Austin, TX, and coauthor of Effective Gradle Implementation.","twitter_name":"@RyanVanderwerf","avatar_path":"/system/avatars/1658/large/IMG_4671.jpg?1544122818"}]}],"Agile":[{"id":3063,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Agile","title":"LIVE! Learning-loop driven development","track":"Agile","type":"lecture","abstract":"Is it possible for a live mobile app dev-team to learn from <b>your</b> real-time feedback, execute a hypothesis-driven ‘learning loop’, then incorporating the findings into new capabilities, and deliver them to your phone? There’s only one way to find out…","persons":[{"id":1152,"full_public_name":"Rob Gordick","abstract":"I am an agile servant leader and change agent with over a decade's experience in various agile software development frameworks and practices. I enable teams to develop a safe and learning culture which is passionate about value delivery.","twitter_name":"@rob_gordo","avatar_path":"/system/avatars/1152/large/Rob_Gordick.jpg?1513343246"}]},{"id":3558,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Agile","title":"LIVE! Learning-loop driven development Part II","track":"Agile","type":"lecture","abstract":"PART II\r\nIs it possible for a live mobile app dev-team to learn from your real-time feedback, execute a hypothesis-driven ‘learning loop’, then incorporating the findings into new capabilities, and deliver them to your phone? There’s only one way to find out…","persons":[{"id":1152,"full_public_name":"Rob Gordick","abstract":"I am an agile servant leader and change agent with over a decade's experience in various agile software development frameworks and practices. I enable teams to develop a safe and learning culture which is passionate about value delivery.","twitter_name":"@rob_gordo","avatar_path":"/system/avatars/1152/large/Rob_Gordick.jpg?1513343246"}]},{"id":3076,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Agile","title":"Play to Learn!: Agile Games with Cards and Dice","track":"Agile","type":"lecture","abstract":"Play is a powerful method to learn! Come and play some simple agile games that use playing cards, index cards and dice to explore the different values that are at the foundation of Agile and Lean development practices.  In addition to your own insights, you may be able to take these game back to work to share with your co-workers.\r\n\r\nThis is a hands-on session so come prepared to have some fun!\r\n\r\nThere is no \"right\" answer to what you're \"supposed to\" learn from a game, so come ready to discover your own insights into software development processes and teamwork.\r\n","persons":[{"id":389,"full_public_name":"Mike Clement","abstract":"Mike Clement is a husband, father of four, and Founding Software Craftsman of Greater Sum. Passionate about agile technical excellence, Mike founded and organizes Software Craftsmanship Atlanta and the Lean+Agile Atlanta Unconference.  Previous employers include Pluralsight, Ancestry.com and Microsoft. Find out more about Mike on his blog (http://blog.softwareontheside.com/) and on Twitter at @mdclement.","twitter_name":"mdclement","avatar_path":"/system/avatars/389/large/MichaelClement2016.png?1526516379"}]},{"id":2813,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Agile","title":"Art for Agilists - A Visual Thinking Warmup","track":"Agile","type":"lecture","abstract":"This talk will introduce you to Visual Thinking Strategies (or VTS) - an activity that can help get the most from every member of your agile team. VTS develops critical thinking skills by viewing and discussing works of art in a group. By allowing individuals to talk about art - without needing a background in the field - VTS advances skills such as: Observing, Brainstorming, Speculating, Reasoning with Evidence, Cultivating a Point of View, and Revision & Elaboration.","persons":[{"id":1458,"full_public_name":"Alexandra West","abstract":"Alexandra West is a production designer, international speaker, and Creative Director of Nerd/Noir, an agile consulting firm. Her present interest is in bringing a visual thinking mindset into the world of collaborative work. ","twitter_name":"birdsncherries","avatar_path":"/system/avatars/1458/large/nn-alexandra-west-1x1-large.jpg?1541776094"}]},{"id":2739,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Agile","title":"6 Myths of delivering software that will destroy your sleep nights","track":"Agile","type":"lecture","abstract":"Who care about sleeping? Why a good sleeping night if you can work for long hours, eat pizza during when you should have dinner and break the night trying to deliver a new version to production?\r\n\r\nMaybe are you working with wrong concepts? Wrong values? Maybe some \"experts\" are giving you bad advices?\r\n\r\nThis session will discuss some DevOps myths that could destroy your project. After all what could be worst in the software delivery than don't deliver?\r\n\r\nJoin us to learn how to deal with those myths and enjoy your bed without guilt! ","persons":[{"id":1390,"full_public_name":"Elder Moraes","abstract":"Elder helps server side developers to work on great projects by building and delivering secure, available and fast applications.","twitter_name":"elderjava","avatar_path":"/system/avatars/1390/large/avatar-500x500.jpg?1544468107"}]}],"Architecture":[{"id":2996,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Architecture","title":"Nowadays Architecture Trends, from Monolith to Microservices and Serverless","track":"Architecture","type":"lecture","abstract":"In this session, attendees will learn about a real-world evolution to a Distributed Architecture without being involved of a complete Microservices Madness; we will be covering tips and tricks of an experience of a evolution of a huge EAR Core Banking Application and how we evolve to a modern distributed Architecture until the evolution of use 3rd party services and Serverless; tips, tricks, pros, cons and the reasons for being involved on move forward and present sample code as FaaS and explain the pitfalls of Serverless and the security concerns on this evolution. We will be using snippets code based on JAVA, JWT, JWS, Auth0, Spring Boot, Reactor, Webflux, Spring Cloud Gateway and Spring Cloud Functions.\r\n","persons":[{"id":931,"full_public_name":"Alberto Salazar","abstract":"Alberto Salazar is an entrepreneur, passionate Consultant, Java Champion, JUG Leader, Oracle Groundbreaker Ambassador, Auth0 Ambassador and founder of the Ecuador Java User Group, Java Community Process Associate Member and Java evangelist/trainer. He is the co-author of the book 'Software Architecture with Spring 5.0'. Alberto has been working for 2 decades creating large scalable and high transaction load systems from military software to banking solutions. He is also a frequent speaker at Java conferences such as Oracle Code One, Voxxed Days, Oracle Code, Red Hat Summit, JavaOne,  Oracle Developer Tour Latam, OTN Tours, and local JUG meetings. Recently, Alberto organized a Java Conference in Ecuador bringing Java Rocks starts, Java Champions, Dev Champions to the country and he co-organized a Java Hackdays event in Spanish, joining together eleven different cities around the world and nine Spanish native language countries.","twitter_name":"betoSalazar","avatar_path":"/system/avatars/931/large/ASalazarRHSummit2_result_1.jpg?1537063992"}]},{"id":2599,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Architecture","title":"Architectural Resiliency","track":"Architecture","type":"lecture","abstract":"Regardless of the techniques used to make an enterprise solution Highly Available (HA), failure at some point inevitable. Resiliency is how fast a system reacts and then recovers to such failures. This session covers a number of techniques and patterns such as Intelligent Agents, Tolerant Reader, and Circuit Breaker, for addressing architectural resiliency.","persons":[{"id":1373,"full_public_name":"Jeremy Deane","abstract":"Chief Architect at Foundation Medicine and software engineering aficionado.","twitter_name":"jtdeane","avatar_path":"/system/avatars/1373/large/headjtdeane1.jpg?1541682575"}]},{"id":2907,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Architecture","title":"An Evolutionary Approach to Managing Software Entropy","track":"Architecture","type":"lecture","abstract":"As an industry, we’re not very good at managing tech debt. Yesterday's big balls of mud are destined to become tomorrow’s big buckets of glue. In this talk, I’ll share my lightweight approach and toolchain for avoiding this trap. Expect lots of tips and tricks for combating entropy in long-lived, software-intensive products shared by teams and large organizations. Ultimately, I'll show you how to start building a system for visualizing, prioritizing, and managing your software product's evolution and technical debt side by side with new feature development. ","persons":[{"id":1457,"full_public_name":"David Laribee","abstract":"David Laribee is a player-coach, trainer, speaker, and co-founder of Nerd/Noir. He believes in the power of collaboration, simplicity, and feedback. He has built teams and products for companies in the Fortune 500 and startups alike. Prior to founding Nerd/Noir, an agile consulting company, David coached the product development team at VersionOne, a leader in agile planning tools.","twitter_name":"laribee","avatar_path":"/system/avatars/1457/large/david-laribee.jpg?1535051292"}]},{"id":2636,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Architecture","title":"Effective Design of RESTful APIs.","track":"Architecture","type":"lecture","abstract":"Developers creating websites and especially backend developers need to know how to build RESTful APIs correctly. As nowadays those APIs is serving many channels either it is Mobile, Microservices components, IoT, integration or all of them. \r\n\r\nThis session will help you plan and model your own APIs and understand the six REST design constraints that help guide your architecture. ","persons":[{"id":886,"full_public_name":"Mohamed Taman","abstract":"Sr. Enterprise Architect @ComTrade Digital Services, a Java Champion, an Oracle Groundbreaker Ambassador, Java/ Mobile/ Web / Big Data / Cloud / Blockchain (HashGraph) / DevOps Architect, JCP, Duke Award winner 3 times, International Speaker, Books & Videos Author","twitter_name":"@_tamanm","avatar_path":"/system/avatars/886/large/TamanM.jpg?1507547778"}]},{"id":2624,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Architecture","title":"Jamming with a Quantum Computer","track":"Architecture","type":"lecture","abstract":"In this session, James will give an introduction to quantum computing, cover a bit of music theory, and demonstrate how a quantum computer can compose and participate in a musical jam session. He will then discuss the development and implementation of the Quantum Music Composer application on real quantum computers.","persons":[{"id":650,"full_public_name":"James Weaver","abstract":"James Weaver is a developer, author, and speaker with a passion for quantum computing. He is a Java Champion, and a JavaOne Rockstar. James has written books including Inside Java, Beginning J2EE, the Pro JavaFX series, and Java with Raspberry Pi. As an IBM Quantum Developer Advocate, James speaks internationally at quantum and classical computing conferences.  He tweets as @JavaFXpert, and blogs at http://JavaFXpert.com and http://CulturedEar.com","twitter_name":"JavaFXpert","avatar_path":"/system/avatars/650/large/ibm-james-weaver-700px.jpg?1541676068"}]}],"Cloud Infra":[{"id":3293,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Cloud Infra","title":"riffing on Knative","track":"Cloud Infrastructure (Microservices and Serverless)","type":"lecture","abstract":"Knative extends Kubernetes via Custom Resource Definitions to provide support for higher level developer concerns such as autoscaling and routing across revisions of an application. Knative also provides support for pluggable build strategies and an eventing model for connecting publishers to subscribers. riff is an open source, event-driven, function as a service platform built on top of Knative. In this session, we will take a tour of Knative and riff with demos of the developer experience along the way.","persons":[{"id":1161,"full_public_name":"Mark Fisher","abstract":"Mark has been a member of the Spring team for over 12 years, contributing to the Spring Framework and several other projects. He founded Spring Integration in 2007 and is one of the authors of Spring Integration in Action, published by Manning in 2012. He has contributed to Spring Cloud Stream, Spring Cloud Data Flow and Spring Cloud Function and is currently focused on Serverless Functions with riff.","twitter_name":"@projectriff","avatar_path":"/system/avatars/1161/large/mf.jpg?1516131267"}]},{"id":2816,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Cloud Infra","title":"Decrypting Tech Hype for the Busy Coder","track":"Cloud Infrastructure (Microservices and Serverless)","type":"lecture","abstract":"It seems like there is a new technology trend, development methodology, or deployment tool coming out every day and if you aren’t using it you are labeled as deprecated, legacy, or a technology dinosaur.  Come hear straight talk about the latest trends such as blockchain, chatbots, serverless, CD pipelines, AI, and machine learning.  In 45 minutes you will know more than your average redditor, and you can shut down tweet-driven development in your workplace once and for all.","persons":[{"id":1460,"full_public_name":"Stephen Chin","abstract":"Stephen Chin is Director of Oracle Developer Community, author of Raspberry Pi with Java, co-author of Pro JavaFX Platform, and Oracle Code One Content Chair. He has keynoted numerous Java conferences around the world including JavaOne, where he is a 7-time Rock Star Award recipient. Stephen is an avid motorcyclist who has done several Pan-European evangelism tours, interviewing hackers in their natural habitat and posting the videos on http://nighthacking.com/. When he is not traveling, he enjoys teaching kids how to do embedded and robot programming together with his teenage daughter.","twitter_name":"steveonjava","avatar_path":"/system/avatars/1460/large/steve-champion-300.jpg?1535093552"}]},{"id":2771,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Cloud Infra","title":"Amazon Corretto","track":"Cloud Infrastructure (Microservices and Serverless)","type":"lecture","abstract":"Amazon Corretto is a no-cost, multiplatform, production-ready distribution of the OpenJDK. Corretto comes with long-term support that will include performance enhancements and security fixes. Amazon runs Corretto internally on thousands of production services and Corretto is certified as compatible with the Java SE standard. With Corretto, you can develop and run Java applications on popular operating systems, including Amazon Linux 2, Windows, and macOS. This talk will explain on why Amazon Corretto was created. Upstream compatibility to OpenJDK is a core tenet of Corretto. Attendees will learn how an upstream OpenJDK build is published as Corretto. You’ll learn how to get started with Corretto and collaborate in open source.","persons":[{"id":776,"full_public_name":"Arun Gupta","abstract":"Arun Gupta is a Principal Technologist at Amazon Web Services. He is responsible for the Cloud Native Computing Foundation (CNCF) strategy within AWS, and participates at CNCF Board and technical meetings actively. He particularly enjoys AMA on Containers and Serverless. He has built and led developer communities for several years at Sun, Oracle, Red Hat and Couchbase. He has extensive speaking experience in 40+ countries on myriad topics. Gupta also founded the Devoxx4Kids chapter in the US and continues to promote technology education among children. A prolific blogger, author of several books, an avid runner, a globe trotter, a Docker Captain, a Java Champion, a JUG leader, he is easily accessible at @arungupta on twitter.","twitter_name":"arungupta","avatar_path":"/system/avatars/776/large/evangelist-arun-gupta.png?1505838620"}]},{"id":3058,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Cloud Infra","title":"Going Native on Kubernetes with Knative","track":"Cloud Infrastructure (Microservices and Serverless)","type":"lecture","abstract":"Now that Kubernetes has become the defacto standard for Linux container orchestration and the new monolith and microservices application platform, the next battle is for serverless architecture where Functions rule and there are numerous Open Source players competing for relevance in this space.   Your future cloud native applications will consist of both microservces and functions, often wrapped as Linux containers, but in many cases where you the developer ignore the operational aspects of managing that infrastructure.\r\n\r\nIn this session, we will be diving into Knative as serverless \"base primitives\" for Kubernetes.  ","persons":[{"id":836,"full_public_name":"Burr Sutter","abstract":"A lifelong developer advocate, community organizer, and technology evangelist, Burr Sutter is a featured speaker at technology events around the globe—from Bangalore to Brussels and Berlin to Beijing (and most parts in between)—he is currently Red Hat’s Director of Developer Experience. A Java Champion since 2005 and former president of the Atlanta Java User Group, Burr founded the DevNexus conference—now the second largest Java event in the U.S.—with the aim of making access to the world’s leading developers affordable to the developer community. When not speaking abroad, Burr is also the passionate creator and orchestrator of highly-interactive live demo keynotes at Red Hat Summit, the company’s premier annual event.","twitter_name":"burrsutter","avatar_path":"/system/avatars/836/large/080717_BURRSUTTER_HEADSHOT_6INX6IN_300DPI.JPG?1536947070"}]},{"id":2619,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Cloud Infra","title":"Drinking from the Stream: How to Use Messaging Platforms for Scalability & Performance","track":"Cloud Infrastructure (Microservices and Serverless)","type":"lecture","abstract":"Most mission-critical systems have distributed elements or are entirely distributed, resulting in a number of challenges: performance, scalability, reliability, resilience...the eight fallacies of distributed computing are alive and well!\r\n\r\nMessaging platforms are often used to solve these problems and increase the \"ilities\", but they don't come without a few complexities of their own. Come to this session to learn how to leverage open source solutions like Spring Cloud Stream, RabbitMQ, & Apache Kafka to maximize your distributed systems' capabilities while minimizing complexity. All examples will be coded *live & in real-time*!","persons":[{"id":1181,"full_public_name":"Mark Heckler","abstract":"Mark Heckler is a Pivotal Principal Technologist & Spring Developer Advocate, conference speaker, published author, & Java Champion focusing upon developing innovative production-ready software at velocity for the Cloud and IoT applications. He has worked with key players in the manufacturing, retail, medical, scientific, telecom, and financial industries and various public sector organizations to develop and deliver critical capabilities on time and on budget. Mark is an open source contributor and author/curator of a developer-focused blog (https://www.thehecklers.com) and an occasionally interesting Twitter account (@mkheck).","twitter_name":"@mkheck","avatar_path":"/system/avatars/1181/large/MarkHecklerProfilePic.jpg?1533228955"}]}],"Cloud Tech ":[{"id":3220,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Cloud Tech ","title":"Google Cloud Native Architecture with Spring","track":"Cloud Technology","type":"lecture","abstract":"Google and Pivotal partnered to develop Spring Boot starters for Google Cloud Platform. With Spring Cloud GCP, you can quickly develop cloud native application and harness the power of managed services. Join this session to see how you can develop cloud native applications to run on Google Cloud Platform, deployed into Platform as  a service or Kubernetes in minutes.","persons":[{"id":806,"full_public_name":"Ray Tsang","abstract":"Ray is currently a Developer Advocate at Google focused on Google Cloud Platform and Java developer experience. Follow Ray on Twitter @saturnism (https://twitter.com/saturnism)","twitter_name":"saturnism","avatar_path":"/system/avatars/806/large/profile.jpeg?1517295479"}]},{"id":3023,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Cloud Tech ","title":"Service Mesh and Sidecars with Istio and Envoy","track":"Cloud Technology","type":"lecture","abstract":"The first generation of microservices was primarily shaped by Netflix OSS and leveraged by numerous Spring Cloud annotations all throughout your business logic. The next generation of microservices will leverage sidecars and a service mesh. In this session, we will give you a taste of Envoy and Istio, two open source projects that will change the way you write distributed Java applications on Kubernetes. Check out how we use Envoy and Istio to deal with traffic shaping, network fault-injection, A/B testing, dark launches, mirroring, and much more.","persons":[{"id":848,"full_public_name":"Rafael Benevides","abstract":"Rafael Benevides is Director of Developer Experience at Red Hat. With many years of experience in several fields of the IT industry, he helps developers and companies all over the world to be more effective in software development. Rafael considers himself a problem solver who has a big love for sharing. He is a member of Apache DeltaSpike PMC - a Duke’s Choice Award winner project, and a speaker in conferences like JavaOne, Devoxx, TDC, DevNexus and many others.","twitter_name":"@rafabene","avatar_path":"/system/avatars/848/large/Rafael18-2.jpg?1536945097"}]},{"id":3254,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Cloud Tech ","title":"Welcome to the Reactive Revolution:RSocket and Spring Cloud Gateway","track":"Cloud Technology","type":"lecture","abstract":"As more applications are experiencing the benefits of using a reactive programming model, one of the biggest problems they experience is the mismatch between Reactive Stream back pressure and current networking protocols. The RSocket protocol enables Reactive Streams back pressure to be transmitted across a network link connecting reactive flows in multiple applications to directly affect one another in a positive way. In addition to introducing the RSocket protocol and how to use it, this talk will show integration with Spring Cloud Gateway and how it, combined with RSocket, can create a type of messaging gateway.","persons":[{"id":1182,"full_public_name":"Spencer Gibb","abstract":"Spencer Gibb is a Principal Software Engineer for Pivotal, Inc where he is the co-founder and co-lead of the Spring Cloud Core projects. He is a husband, father, and geek.","twitter_name":"spencerbgibb","avatar_path":"/system/avatars/1182/large/Spencer_Gibb_Headshot_-_Square_-_Hi_Res.jpg?1538405673"}]},{"id":2893,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Cloud Tech ","title":"Get your Java application ready for Kubernetes !","track":"Cloud Technology","type":"lecture","abstract":"In this talk we'll explore the best practices to create a Docker image for a Java app, and how to integrate best with the Kubernetes ecosystem.","persons":[{"id":1493,"full_public_name":"Anthony Dahanne","abstract":"I am a <a href=\"https://ca.linkedin.com/in/anthonydahanne\">software developer with 15 years of experience</a>, and currently I'm working on management and monitoring components as well as \"cloud migrations\" for my employer, Software AG, making sure our products (mainly Java based applications) run well in the cloud, and in particular on Kubernetes.","twitter_name":"anthonydahanne","avatar_path":"/system/avatars/1493/large/anthony_square_400px.png?1535939712"}]},{"id":3305,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Cloud Tech ","title":"Where has my money gone? Transaction problems with Kubernetes and how to solve them.","track":"Cloud Technology","type":"lecture","abstract":"Most of the industry is working on modernizing existing applications. The end goal may be to develop microservices in the cloud, but usually the first step is to containerize the applications and run them in Kubernetes. This step brings its own challenges which need to be addressed otherwise your data may become inconsistent. This talk will discuss the issues running containerized mission critical applications in Kubernetes and how to resolve them. It will cover how to configure and test these applications so that data remains consistent by making sure the transactions can be recovered. ","persons":[{"id":1628,"full_public_name":"Monica","abstract":"Monica Tamboli holds MS in Computer Science. Her focus has been developing JEE applications and testing Enterprise Security, transactions and dynamic caching with various IBM products. Those products include WebSphere Application Server, WebSphere Liberty, Open Liberty, and IBM Cloud Private. She has over 20 years of software industry experience. She likes to volunteer for Technology and Engineering camps for kids. She is passionate about going green and reducing trash.","twitter_name":"https://www.linkedin.com/in/monica-tamboli/","avatar_path":null}]}],"Core Java":[{"id":3193,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Core Java","title":"Java Garbage Collectors’ Current Performance Impact ","track":"Core Java","type":"lecture","abstract":"A lot of changes have happened to JVM garbage collectors. G1 became the default garbage collector, and CMS was deprecated. New low-pause garbage collectors (such as ZGC) are coming. This session delves into the performance impact of current garbage collectors unveils details of how GCs may affect the performance of your application, and will help you understand which GC is most suitable for your application.\r\n","persons":[{"id":837,"full_public_name":"Sergey Kuksenko","abstract":"Sergey Kuksenko is a Java Performance Engineer at Oracle working on a variety of Java and JVM performance enhancements. He joined Oracle in 2010 and OpenJDK/OracleJVM is the third JVM in his experience. He started working as Java Engineer in 1996 and as Java Performance Engineer in 2005. He has had a passion for exploring how Java works on modern hardware.","twitter_name":"@kuksenk0","avatar_path":"/system/avatars/837/large/p4.jpg?1537914881"}]},{"id":3242,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Core Java","title":"Instant Startup and Low Footprint for Java","track":"Core Java","type":"lecture","abstract":"GraalVM is an integrated, polyglot, high-performance execution environment for dynamic, static, and native languages. One of the abilities of GraalVM is to compile Java programs ahead of time into native images that offer performance comparable to running on the JVM but have instant startup times and much lower runtime overhead. Generating native images is proven to work on real-world applications. In this session, you will learn how native images work and what is required to generate them and will look at several examples of compiling programs ahead of time and packaging them into minimal (<10 MB) containers. You’ll also see how to configure native image generation, work around the limitations, and configuring your application to use native images.","persons":[{"id":1174,"full_public_name":"Oleg Šelajev","abstract":"Lead Developer Advocate for Graal at OracleLabs","twitter_name":"shelajev","avatar_path":"/system/avatars/1174/large/IMG_0058.JPG?1538412476"}]},{"id":2822,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Core Java","title":"Things that make you go \"huh\", Java Edition","track":"Core Java","type":"lecture","abstract":"Have you ever wonder why you need to override equals and hashcode at the same time? Or why system.currenttimemillis() might not be good enough to measure things? Or why choose LinkedList vs ArrayList? Or why you get weird \"state\" and behavior on a Spring Bean? Or why the internet says not to use Double for currency? We explore these and more \"cases\" that make you go \"...huh...\" in Java. After this talk, you can then be demistifyed on a lot of things, and make sure you are making the \"Right\" decision, and not just a copy/paste from StackOverflow\r\n","persons":[{"id":850,"full_public_name":"Bob Paulin","abstract":"Bob Paulin is an independent consultant and speaker that has been developing open source software for the past 10 years. Bob has presented at large international conferences such as ApacheCon, JavaOne and Devnexus. He frequently shares his knowledge and opinions on the Java Pub House and Java Off Heap podcasts. Bob is actively involved in the Chicago developer community as the Chicago Java User Group Sponsorship Director and Chicago CJUG4Kids presenter/organizer. Bob is a passionate member of the ASF and donates his time to Apache Felix and Apache Tika as a committer and PMC respectively. When not coding, Bob enjoys coaching football, robotics, and spending time with his wife and 4 kids. ","twitter_name":"bobpaulin","avatar_path":"/system/avatars/850/large/bob.jpg?1537033760"},{"id":762,"full_public_name":"Freddy Guime","abstract":"Freddy is a Principal Developer at Expedia. Always dealing with performance and usability he is always curious on how to make the overabundance of data useful for travelers, traders and consumers. Having worked with different technologies before has allowed him to come with solutions to rendering bottleneck problems. A Usability Guru, Freddy understands and bridges the concepts of high-throughput with usability within software.\r\n\r\nHe is also the author and maintainer of the javapubhouse.com, a podcast dedicated to tutorial topics in Java that covers everything from the use of the keyword volatile to the definition of beautiful code, also of javaoffheap.com, a java news podcast.\r\n\r\n","twitter_name":"fguime","avatar_path":"/system/avatars/762/large/c859ec9be32acb8b4b1e7724b0dce608_400x400.png?1518901955"}]},{"id":2933,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Core Java","title":"Alternates to Java Reflection and Unsafe usage","track":"Core Java","type":"lecture","abstract":"The session covers Method and Var Handles. With code examples the session highlights the erstwhile reflection API and its newer lightweight replacement in Method Handles. The session also covers the (ab)use of sun.misc.Unsafe and its newer safer complimentary API.","persons":[{"id":879,"full_public_name":"Chandra Guntur","abstract":"Java geek. Spring Boot and Cloud enthusiast. Organizer, presenter at NYJavaSIG and co-chair of the NYJavaSIG Hands-On-Workshop (HOW). Speaker at Devnexus, QCon, Oracle Code NY, Oracle Code One and several Java User Groups. Love Smalltalk, Groovy and Java. ","twitter_name":"@CGuntur","avatar_path":"/system/avatars/879/large/chandra_portrait.png?1510811166"}]},{"id":2695,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Core Java","title":"Java 12 – Keeping the Java Release Train on the Right Track","track":"Core Java","type":"lecture","abstract":"Java is on a fast new release cycle with releases every 6 months. Many enterprises were waiting for Java 11 - the long term support release. Now that it is out is a great time to review the new features in Java 10 and 11 along with a preview of what will be in Java 12. This talk emphasizes the changes in the release model so your team can make sure their next upgrade is on the right track.","persons":[{"id":883,"full_public_name":"Jeanne Boyarsky","abstract":"Jeanne Boyarsky wrote Sybex’s hugely popular Java 8 OCA/OCP certification books. She is in the process of updating them for Java 11. She is a Java developer with 16 years experience and volunteers with a FIRST robotics team.  In 2018, she spoke at DevNexus, JavaOne and QCon.  Jeanne is a Distinguished Toastmaster which involves giving over 50 public speeches. For more on Jeanne’s professional experience:, see http://www.coderanch.com/how-to/java/BioJeanneBoyarsky","twitter_name":"jeanneboyarsky","avatar_path":"/system/avatars/883/large/2017-black-and-white.jpeg?1510619579"}]}],"Frameworks":[{"id":3278,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Frameworks","title":"MicroProfile Survival Guide in the Cloud","track":"Frameworks","type":"lecture","abstract":"Microprofile is a breath of fresh air in the Enterprise Java world. But is it fit to the Cloud? We believe it is! Come to this session and see how we can successfully develop/integrate/deploy a Microprofile application on top of the Azure cloud computing platform. We’ll cover it all: metrics, tracing, health checks, security, and deployment pipelines. Because Microprofile belongs in your code, but it needs to be leverage by many other services provided by your platform.","persons":[{"id":737,"full_public_name":"brianbenz@brianbenz.com","abstract":"Brian is a Senior Developer Advocate at Microsoft, helping Java developers to get the most out of Azure. Before Joining Microsoft, he was a solution architect, consultant, developer, author and presenter at IBM, Deloitte, and other companies. Find him on Twitter @bbenz.","twitter_name":"bbenz","avatar_path":"/system/avatars/737/large/briheadshot.jpg?1504729974"},{"id":1389,"full_public_name":"Edson Yanaga","abstract":"Edson Yanaga, Red Hat's Director of Developer Experience, is a Java Champion and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java, Microservices, Cloud Computing, DevOps, and Software Craftsmanship.","twitter_name":"@yanaga","avatar_path":"/system/avatars/1389/large/edson_yanaga.png?1533308310"}]},{"id":3292,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Frameworks","title":"Reactive for the Impatient","track":"Frameworks","type":"lecture","abstract":"As Java is an object-oriented language that inherently supports the imperative programming style, asynchronicity presents a challenge that can turn the code into nightmare.  One way to deal with the complexity of asynchronicity is to introduce reactivity onto the coding level (reactive programming), and/or to handle it on the design and architecture level (reactive systems design).","persons":[{"id":855,"full_public_name":"Mary Grygleski","abstract":"A passionate software technologist who appreciates good craftsmanship and desires to be a contributor to making people's lives better through technology.","twitter_name":"@mgrygles","avatar_path":"/system/avatars/855/large/mary.grygleski_cjug.org_0504.jpg?1546417212"}]},{"id":3366,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Frameworks","title":"Bootiful Applications (Redux)","track":"Frameworks","type":"lecture","abstract":"Bootiful Applications (Redux)\r\n\r\nWe're already more than 5 years since the public debut of Spring Boot at SpringOne Platform 2018 and the world looks different than it did. Spring Boot looks different, owing to the tectonic shifts affecting the ecosystem in those years. In this talk, join Spring Developer Advocate Josh Long and learn about Spring Boot, the observable, reactive, agile, and Kotlin-ready microframework development sensation that's sweeping all nations!  ","persons":[{"id":1669,"full_public_name":"Josh Long","abstract":"Josh (@starbuxman) is the Spring Developer Advocate at Pivotal. Josh is a Java Champion, author of 5 books (including O'Reilly's Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry) and numerous best-selling video trainings (including Building Microservices with Spring Boot Livelessons with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring Integration, Spring Cloud, Activiti and Vaadin). \r\n","twitter_name":"starbuxman","avatar_path":"/system/avatars/1669/large/professional-studio-shoot-by-richard-october-2018.jpg?1539382905"}]},{"id":3256,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Frameworks","title":"Batch Processing in 2019","track":"Frameworks","type":"lecture","abstract":"In a world where stream processing and REST APIs get all the press, you may run across instances where batch processing makes sense.  But what is batch processing?  Why would you use it in 2019?  How does Spring Batch help?  This talk will walk you through all of that and more!","persons":[{"id":873,"full_public_name":"Michael Minella","abstract":"Michael Minella is a software engineer, Java Champion, speaker, and author with over 17 years of enterprise development experience. He currently works for Pivotal as the project lead for the Spring Batch and Spring Cloud Task projects. Michael has spoken on a number of Java, Spring, and Big Data topics and is a JavaOne Rockstar. Michael was a member of the expert group for JSR-352 (java batch processing). Michael is the author of Pro Spring Batch from Apress and the popular Refcard JUnit and EasyMock.\r\n\r\nOutside of the daily grind, Michael enjoys spending time with his family and enjoys woodworking, photography and InfoSec hobbies.","twitter_name":"michaelminella","avatar_path":"/system/avatars/873/large/MeCropped.jpg?1538665510"}]},{"id":2788,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Frameworks","title":"Reactive Java Programming: a new Asynchronous Database Access API","track":"Frameworks","type":"lecture","abstract":"Reactive Applications require non-blocking database access; the existing JDBC API leads to blocked threads, threads scheduling, and contention. \r\nFor high throughput and large-scale deployment, the Java community needs a standard asynchronous API for database access where user threads never block. \r\nThis session presents a new Java standard proposal for accessing SQL databases. \r\nThis new API is completely non-blocking. It is not intended to be an extension to, or a replacement for, JDBC but, rather, an entirely separate API that provides completely non-blocking access to the same databases as JDBC.  This presentation examines the API, its execution model, lot of code samples, and the next steps.","persons":[{"id":1448,"full_public_name":"Kuassi Mensah","abstract":"Kuassi is Director of Product Management at Oracle.\r\n\r\nHe covers the following oroduct areas\r\n(i) Java connectivity to the Oracle database (JDBC, UCP), in-place processing using the embedded JVM (a.k.a. OJVM) and database quality of services for Java apps  (Zero downtime, multi-tenancy, sharding, and so on).\r\n(ii) Turning RDBMS Database tables into Hadoop and Spark datasources \r\n(iii) MicroServices integration with databases\r\n\r\nHe holds an MS CS from the Programming Institute of University of Paris \r\n\r\nFrequent speaker: JavaOne, JUG Meetups, Scale by the Bay, Oracle Open World, Data Summit, Node Summit, Oracle User groups \r\n(UKOUG, DOAG, OUGN, BGOUG, OUGF, GUOB, ArOUG, ORAMEX, Sangam, China) \r\n\r\nAuthor: http://www.amazon.com/exec/obidos/ASIN/1555583296.\r\n\r\n@kmensah, http://db360.blogspot.com/, https://www.linkedin.com/in/kmensah","twitter_name":"@kmensah","avatar_path":"/system/avatars/1448/large/Kuassi_Mensah.jpg?1534798911"}]}],"Java Platform":[{"id":3741,"date":"2019-03-08T08:00:00-05:00","start":"08:00","duration":"00:50","room":"Java Platform","title":"Breakfast 2.0","track":"Other","type":"","abstract":"Lunch","persons":[]},{"id":3729,"date":"2019-03-08T09:00:00-05:00","start":"09:00","duration":"00:50","room":"Java Platform","title":"Leadership for the Reluctant Leader","track":"Keynote","type":"lecture","abstract":"Regardless of the technology you know, regardless of the job title you have, you have amazing potential to impact your family, workplace, community, and beyond. In this talk, I'll share a few candid stories of my career failures... I mean... learning opportunities. You'll walk away with some essential leadership skills I believe anyone can develop, and a good dose of encouragement to be more awesome","persons":[{"id":612,"full_public_name":"David Neal","abstract":"David is a family man, musician, illustrator, software developer, and Microsoft MVP living in North Georgia. He is currently a Senior Developer Advocate for Okta, runs on a high-octane mixture of caffeine and JavaScript, and is made entirely of bacon.","twitter_name":"reverentgeek","avatar_path":"/system/avatars/612/large/reverentgeek_avatar_v2.jpg?1536689346"}]},{"id":3199,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Java Platform","title":"Intro to Functional Programming","track":"Java Platform","type":"lecture","abstract":"After decades on the outskirts, Functional Programming is finally breaking into the mainstream due to changing needs and paradigms. For instance, Apache Spark has brought FP to many developers due to its function-oriented, big data transformation API. This session will give you a quick intro to FP. You’ll learn from code examples how to make sense of terminology like Higher-Order Function, Functor, and Monad – and you won’t need a math degree!","persons":[{"id":1589,"full_public_name":"James Ward","abstract":"James Ward is a Developer Advocate for Google Cloud Platform. He tweets as @_JamesWard and blogs on jamesward.com.","twitter_name":"_JamesWard","avatar_path":"/system/avatars/1589/large/james_ward_2015.jpg?1548958691"}]},{"id":3734,"date":"2019-03-08T11:00:00-05:00","start":"11:00","duration":"00:20","room":"Java Platform","title":"Break 2.1","track":"Other","type":"","abstract":"Break","persons":[]},{"id":2665,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Java Platform","title":"Go Java, Go!","track":"Java Platform","type":"lecture","abstract":"Java may be the king on the server side but Go is the new upstart. com learn how both languages can be combined to build better systems.","persons":[{"id":729,"full_public_name":"Andres Almiray","abstract":"Andres is a Java/Groovy developer and a Java Champion. Founding member of the Griffon framework and Hackergarten community event.","twitter_name":"aalmiray","avatar_path":"/system/avatars/729/large/aalmiray_joker_small.jpg?1512148821"}]},{"id":3738,"date":"2019-03-08T12:20:00-05:00","start":"12:20","duration":"01:00","room":"Java Platform","title":"Lunch 2.0","track":"Other","type":"","abstract":"Lunch","persons":[]},{"id":3515,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Java Platform","title":"Gettin' Groovy for Java Devs","track":"Java Platform","type":"lecture","abstract":"Groovy is a powerful, agile and dynamic language for the Java platform. Groovy has a Java like syntax along with many features inspired by languages such as Python, Ruby and Smalltalk. The language has been embraced by popular frameworks including Grails, Micronaut, Spring Boot and many others.  This session covers a lot of ground to quickly get Java developers started with Groovy including many interactive examples to highlight the powerful language features that make Groovy compelling. This session is targeted to demonstrate the power of Groovy and help Java developers understand how to leverage that power in their enterprise applications. \r\nTopics include:\r\n\r\n- Everything Is An Object\r\n- Groovy Beans\r\n- Groovy Strings\r\n- Closures\r\n- Collections\r\n- Groovy Builders\r\n- Java Integration\r\n- Build Tools\r\n- Frameworks\r\n- What Is New In Groovy 2.5/2.6","persons":[{"id":1874,"full_public_name":"Zachary Klein","abstract":"Zachary Klein is a Senior Software Engineer at OCI.  He has been practicing web development since 2010 and frontend development since 2015. He's a contributor to both the Grails and Micronaut frameworks, as well as an instructor in OCI's training practice. Zachary's home base is in St Louis, MO, along with his wife, Beth, and three children.\r\n\r\n","twitter_name":"@ZacharyAKlein ","avatar_path":"/system/avatars/1874/large/Zak-3.png?1548352750"}]},{"id":3735,"date":"2019-03-08T14:20:00-05:00","start":"14:20","duration":"00:20","room":"Java Platform","title":"Break 2.2","track":"Other","type":"","abstract":"Break","persons":[]},{"id":3237,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Java Platform","title":"The Trouble with Memory","track":"Java Platform","type":"lecture","abstract":"It is our experience that 60-70% of all the applications we analyze incur a performance penalty due to how it consumes and/or retains memory. Yet if you ask people what is their biggest performance headache it’s unlikely that they’d recognize memory as being #1. I have been involved in analyzing numerous applications for just these kinds of issues and in this session, I will cover the tell tale signs and symptoms that your application is one of those suffering from some sort of memory issue.  I'll discuss what steps you can take to cure this problem and will also cover how the JVM can both help reduce the memory ~strength of your application.  What should you do?\"","persons":[{"id":938,"full_public_name":"Kirk Pepperdine","abstract":"Kirk is a co-founder of jClarity, a company building the next generation of application diagnostic tooling. He is the author of jPDM, a performance diagnostic model that help people to quickly identify the root cause of performance regressions.","twitter_name":"kcpeppe","avatar_path":"/system/avatars/938/large/kirk-thumb.jpg?1510757491"}]},{"id":3736,"date":"2019-03-08T15:40:00-05:00","start":"15:40","duration":"00:20","room":"Java Platform","title":"Break 2.3","track":"Other","type":"","abstract":"Break","persons":[]},{"id":3211,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Java Platform","title":"Spring Boot and Kotlin","track":"Java Platform","type":"lecture","abstract":"Let's showcase how Kotlin makes Java developers lives easier in Spring Boot","persons":[{"id":1597,"full_public_name":"Dev Gupta","abstract":"Software Developer. Graduated from UF with a degree in CS. Been working professionally 7+ years","twitter_name":"","avatar_path":"/system/avatars/1597/large/20626272_10111628576840611_5725042854231210125_o.jpg?1538771799"}]},{"id":3745,"date":"2019-03-08T17:00:00-05:00","start":"17:00","duration":"00:20","room":"Java Platform","title":"Mega raffle (prize giveaways) and closing","track":"Other","type":"other","abstract":"","persons":[]},{"id":3746,"date":"2019-03-08T19:30:00-05:00","start":"19:30","duration":"02:00","room":"Java Platform","title":"Conf after party","track":"Other","type":"other","abstract":"","persons":[]}],"JavaScript":[{"id":3523,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"JavaScript","title":"Don't Be Afraid of the JavaScript Stack Trace","track":"JavaScript","type":"lecture","abstract":"At some point your code will not work. You could spend hours trying to google for a solution. Instead use the JavaScript stack trace to find the problem. A beginner-friendly overview of the JavaScript stack trace and tips on how to use it.","persons":[{"id":332,"full_public_name":"Jennifer Bland","abstract":"Jennifer Bland is a Senior Software Developer for Hearst Autos, specializing in MEAN stack development. She has more than ten years of development experience working for companies like CNN, Coca-Cola and Apple Computer. Jennifer is the author of the book “Developing e-Business Applications Using Lotus Domino on the AS/400\", published by IBM.\r\n\r\nShe runs the website codeprep.io which provides interview questions to assist programmers in preparation for job interviews. Her personal website is jenniferbland.com.\r\n\r\nJennifer holds a B.A. in History from Furman University and an MBA from San Jose State University.\r\n","twitter_name":"ratracegrad","avatar_path":"/system/avatars/332/large/Jennifer-Bland-headshot.jpg?1494079160"}]},{"id":3284,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"JavaScript","title":"Effective TypeScript","track":"JavaScript","type":"lecture","abstract":"JavaScript is in every browser. It’s flexible, dynamically, very dynamic, and somewhat flawed. Because of its shortcomings, there are countless languages that transpile to JavaScript. One of the most popular of these is TypeScript, which provides type-safety and other features like generics, as well as early implementations of new JavaScript features. TypeScript has become even more popular with the newer versions of Angular. However, developers often don’t take full advantage of the language, instead reverting to pure JavaScript when there’s a much better (and strongly typed) TypeScript alternative. In this session, we’ll take look at common features developers don’t use, and show you how to get the best out of this awesome language.","persons":[{"id":160,"full_public_name":"Kito Mann","abstract":"Kito D. Mann is the Principal Consultant at Virtua, Inc. (http://virtua.tech), specializing in enterprise application architecture, training, development, and mentoring with Web Components, Polymer, Angular,  JavaServer Faces, and Java EE technologies. He is also the editor-in-chief of JSFCentral.com (www.jsfcentral.com), co-host of the Enterprise Java Newscast (http://www.enterprisejavanews.com), and the author of JavaServer Faces in Action (Manning). Mann has participated in several Java Community Process expert groups (including CDI, JSF and Portlets) and is also an internationally recognized speaker. He holds a BA in Computer Science from Johns Hopkins University.","twitter_name":"kito99","avatar_path":"/system/avatars/160/large/kito-mann-small.jpg?1438802820"}]},{"id":3030,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"JavaScript","title":"Kubernetes and OpenShift for JavaScript Developers","track":"JavaScript","type":"lecture","abstract":"You’ve probably heard of Kubernetes and OpenShift already. But do you know the reasons why you might use them and more importantly, as a developer, how to get started? I'll cover the basics of Kubernetes and OpenShift and how they relate to each other, and then we'll walk through the process of building and deploying an app that uses Node.js and React to OpenShift. ","persons":[{"id":1543,"full_public_name":"Jan Kleinert","abstract":"Jan Kleinert is a Developer Advocate at Red Hat, where she focuses on OpenShift and the developer experience for developers working with containers and Kubernetes. Prior to joining Red Hat, she worked in a variety of roles ranging from developer relations to web analytics and conversion optimization. \r\n","twitter_name":"jankleinert","avatar_path":"/system/avatars/1543/large/jan-new-square.jpg?1550593789"}]},{"id":3351,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"JavaScript","title":"SOLID JavaScript","track":"JavaScript","type":"lecture","abstract":"Many .Net and Java developers live by the SOLID principles to make their software designs more understandable, flexible, and maintainable. As more business logic moves to the front end with frameworks like React and Angular, developers often lose touch with these principles and resort to more reactionary code. It doesn’t have to be that way. In this session, you will learn how to apply all five of the SOLID principles to your front-end JavaScript applications.","persons":[{"id":928,"full_public_name":"Jonathan Mills","abstract":"Jon is a Pluralsight author, Microsoft MVP, and international speaker focusing on JavaScript both in the browser and on the server.  ","twitter_name":"jonathanfmills","avatar_path":"/system/avatars/928/large/headshot.jpg?1507834298"}]},{"id":3742,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"JavaScript","title":"Building Webapps with Vue.js & Nuxt.js","track":"JavaScript","type":"lecture","abstract":"Nuxt is a powerful way to create Vue.js applications. In this session I'll introduce you to the project, describe where it makes sense, and walk you through several examples of using it for different styles of web apps.","persons":[{"id":329,"full_public_name":"Raymond Camden","abstract":"Raymond Camden is a developer advocate looking for his next gig. He's a published author and presents at conferences and user groups on a variety of topics. Raymond can be reached at his blog (www.raymondcamden.com), @raymondcamden on Twitter, or via email at raymondcamden@gmail.com.","twitter_name":"raymondcamden","avatar_path":"/system/avatars/329/large/ray3_2017.jpg?1507836294"}]}],"Practices":[{"id":3136,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Practices","title":"Seamless development","track":"Practices and other tech","type":"lecture","abstract":"There are many ways to improve productivity and generate positive outcomes with software development. One aspect that is frequently overlooked is the idea of friction. This talk looks at the aspects of development that makes things painful or difficult to get work done and how to make it better. Have you ever thought....\"It's too tough to get things done?\". We'll look at a number of different elements that can make development teams less productive, and discuss why they occur and how to remediate them. This will include topics such as language and framework choice, immutable infrastructure, and both GitOps and DevOps techniques. For each of the areas we will provide some common symptoms and dive deep into specific processes or technical solutions to resolve the issue.","persons":[{"id":1758,"full_public_name":"Thomas Gamble","abstract":"Thomas Gamble is a technical principal. Tom has worked in a variety of development and management roles. He’s currently enjoying contributing to open source and helping teams to deliver quality software more efficiently (while having fun).","twitter_name":"gambtho","avatar_path":"/system/avatars/1758/large/Tom.png?1543262175"},{"id":1517,"full_public_name":"Dustin Bennett","abstract":"Dustin is a Director in Wayfair's Supply Chain Engineering group. His team is responsible for delivering value through applications and services that connect products from suppliers to customers in the most frictionless and efficient manner. Prior to Wayfair, Dustin spent several years in the Technology organization at The Home Depot where he was instrumental to digital transformation and value delivery in both Store Operations Software and Enterprise Architecture. Dustin played football at MIT and moved back to Boston after completing his MBA at the University of Georgia.","twitter_name":"dusbennett","avatar_path":"/system/avatars/1517/large/HeadshotCircle1024.png?1536682399"}]},{"id":3216,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Practices","title":"If you want to talk about accessibility issues, we have to consider readability","track":"Practices and other tech","type":"lecture","abstract":"The average adult in this country reads only at a 7th - 8th grade level, and when it comes to technical content, a person’s reading level dramatically lowers. In other words, what you are writing on your websites might not be comprehendible by your audience. Find out how to determine the level of your website text and ways to revise to ensure your audience can read and comprehend your content.\r\n","persons":[{"id":1198,"full_public_name":"Dr. Faith H. Wallace","abstract":"Web Developer. Professor. Writer. Hogwarts Student. Doctor Who Companion. Okay, so maybe I am not a student at Hogwarts… I am sure I'd be sorted into Ravenclaw! And, maybe I am not a Doctor Who companion… But wouldn’t time traveling in the TARDIS be amazing? I am a former college professor turned web developer with the goal of making teaching and learning code more accessible.","twitter_name":"fwallacephd","avatar_path":"/system/avatars/1198/large/faith.jpg?1543892160"}]},{"id":2920,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Practices","title":"A Practical(ish) Introduction to Data Science","track":"Practices and other tech","type":"lecture","abstract":"Data Science has been described as the sexiest job of the 21st Century. But what is Data Science? And what has Machine Learning got to do with all of this? In this talk I will share insights and knowledge that I have gained from building up a Data Science department from scratch.","persons":[{"id":740,"full_public_name":"Mark West","abstract":"Hacker, Norwegian JUG Leader, Data Scientist, Father.","twitter_name":"markawest","avatar_path":"/system/avatars/740/large/joker2017.jpg?1542660013"}]},{"id":2778,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Practices","title":"Code Wars - How the Database Affects Your Application","track":"Practices and other tech","type":"lecture","abstract":"We know that different business needs or standards drive towards one technology or another, but how can we truly know which is the best technology for the job?\r\nIn this session, we will learn how different data sources and a variety of query languages impact the amount of code required to store and retrieve data. From relational to NoSQL to graph, we will explore various types of data - the way it is stored underneath and how best to go about retrieving it. A live-coding demo will bring all this to life, as the presenter shows exactly how your database choices change how you write applications.\r\nCome to this session to find out whether the solution actually fits the need, and if it doesn’t, how to provide valuable criteria and reasoning for a change!","persons":[{"id":1185,"full_public_name":"Jennifer Reif","abstract":"Jennifer Reif is an avid developer and problem-solver. She holds a Master’s degree in Computer Management and Information Systems and has worked with large enterprises to organize and make sense of widespread data assets and leverage them for maximum business value. She has worked with a variety of commercial and open source tools and enjoys learning new technologies, sometimes on a daily basis! Her passion is finding ways to organize chaos and deliver software more effectively.","twitter_name":"@JMHReif","avatar_path":"/system/avatars/1185/large/Bio_pic_presenting_crop.jpg?1543263561"}]},{"id":3052,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Practices","title":"Continuous Reliability: An agile process to deliver higher quality applications","track":"Practices and other tech","type":"lecture","abstract":"Every business going through organizational transformation to gain a competitive advantage faces the same challenge: how do we balance agility and stability? To solve for the agility part of this equation, many development and operations teams turn to continuous integration (CI) and continuous development/deployment (CD), however these practices often put stability at risk. Enter Continuous Reliability.\r\n\r\nContinuous Reliability (CR) is a new framework that brings together automated code quality gates and contextual feedback loops within a CI/CD workflow to help organizations overcome the agility/stability paradox. CR can mean the difference between hoping your code might work in production, and actually knowing it will.\r\n\r\nIn this session, Eric Mizell, VP of Solution Engineering at OverOps, will define CR for attendees and demonstrate how they can implement this practice within the context of their organization’s own transformation.\r\n\r\nThe session will follow the below outline:\r\n--Introduce and define the concept of CR \r\n>Quality Gates\r\n>Feedback Loops\r\n--How are organizations approaching this problem today and the challenges they encounter\r\n--The benefits of CR\r\n--CR in Practice: How CR is implemented at Comcast\r\n--Key tools and best practices\r\n--Q&A \r\n","persons":[{"id":1541,"full_public_name":"Eric Mizell, VP of Solution Engineering at OverOps","abstract":"Eric is the VP of Solution Engineering at OverOps. Prior to his role at OverOps, Eric served as VP of Global Solution Engineering at Kinetica, Director of Solution Engineering for Hortonworks, and Director of Field Engineering and Solutions Architect for Terracotta. He also previously held positions in systems and software engineering at McCamish Systems and E/W Group.  ","twitter_name":"","avatar_path":null}]}],"Security":[{"id":3008,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Security","title":"Please pass the salt: Serve up passwords with a side of entropy","track":"Security","type":"lecture","abstract":"So many companies today don't follow best practices when it comes to storing passwords.  And even worse, many companies don't think they need to because hackers would never bother with them. Come learn the truth about how you should deal with your user's passwords and how to navigate the confusing terminology of crypto.","persons":[{"id":626,"full_public_name":"Brad Wood","abstract":"Brad is a software architect living in Kansas City.  He is an open source enthusiast, developer advocate, and lead developer of the CommandBox CLI project.  He works for Ortus Solutions making open source tools for CFML developers.","twitter_name":"bdw429s","avatar_path":"/system/avatars/626/large/Brad_Wood.jpg?1495654535"}]},{"id":3180,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Security","title":"Modern WebAppSec, 7 steps to secure your websites","track":"Security","type":"lecture","abstract":"Modern WebAppSec techniques can be used to secure websites with minimal efforts and reduce the time and cost spent dealing with security vulnerabilities. This talk presents seven practical steps that every engineer can adopt, and shows tools and techniques developed at Mozilla to protect the security of Firefox's backend websites and services.","persons":[{"id":1580,"full_public_name":"Julien Vehent","abstract":" DevOps security expert and engineering manager with over 15 years of experience in large organizations and web companies. Currently responsible for the operational security of Firefox's backend infrastructure at Mozilla. Author of Securing DevOps, published at Manning in 2018.","twitter_name":"jvehent","avatar_path":null}]},{"id":3574,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Security","title":"OAuth 2.0 and OpenID Connect (In Plain English)","track":"Security","type":"lecture","abstract":"There's no shortage of information out there on OAuth and OpenID Connect. Much of it is not helpful for people not already familiar with the standard. This talk takes you through it all - in simple English.","persons":[{"id":772,"full_public_name":"Micah Silverman","abstract":"Developer, Maker, Tinkerer, Movie, TV and Gaming Nerd","twitter_name":"afitnerd","avatar_path":"/system/avatars/772/large/__Projects_StormPath_JavaRoadStorm2016_images_fjr1300.jpg?1505750595"}]},{"id":3306,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Security","title":"Stateless Microservice Security via JWT and MicroProfile","track":"Security","type":"lecture","abstract":"The learning curve for REST API security is severe and unforgiving. When left to the end of a project, we miss key opportunities to create truly scalable, stateless architectures.  The first half of this session delves into OAuth 2.0 with and without JWTs and shows how it falls into two camps: stateful and stateless.  We then take a code-driven deep dive into MicroProfile JWT, which offers a clean Java API and standard configuration for consuming JWTs across Microservices in an elegantly stateless architecture.","persons":[{"id":1149,"full_public_name":"David Blevins","abstract":"Founder of Tomitribe, veteran of Open Source Java EE in both implementing and defining JavaEE specifications for over 10 years with a strong drive to see JavaEE simple, testable and as light as Java SE. Co-Founder of OpenEJB (1999), Geronimo (2003), TomEE (2011). Member of the Java EE 7 and EJB 3.2 Expert Groups, past member of the Java EE 6, EJB 3.1, and EJB 3.0 Expert Groups. Contributing author to Component-Based Software Engineering: Putting the Pieces Together from Addison Wesley.","twitter_name":"dblevins","avatar_path":null}]},{"id":3061,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Security","title":"Secure Java Apps By Default in the Cloud","track":"Security","type":"podium","abstract":"Do you lose sleep at night because you're worried about app secrets lying bare in cloud? Proper management of app secrets is critical. We've seen too many high profile companies suffer from security breaches over the years. Developers hide secrets and make them hard to find – this is a hide and seek game that has plenty of potentials to lose; it's just a matter of time.  In this session we will take a fresh look at managing secrets by default; using app identities and role based access, connecting to cloud services without connection strings and securing remaining secrets in vaults.\r\n","persons":[{"id":1175,"full_public_name":"Ruth Yakubu","abstract":"Ruth is a Sr. Cloud Developer Advocate at Microsoft; and founder of PoshBeauty.com. Ruth specializes in Java, Cloud, Advanced Analytics, Data Platforms and Artificial Intelligence (AI).","twitter_name":"ruthieyakubu","avatar_path":"/system/avatars/1175/large/profile-face.png?1537069779"}]}],"Tools - Techniques":[{"id":2943,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Tools - Techniques","title":"Kotlin & Implications in an IoT project ","track":"Tools and Techniques","type":"lecture","abstract":"Develop IoT solutions with Kotlin is possible thanks to the incorporation to Kotlin as a first class programming language to Android and the becoming of Android Things, an optimized version of Android for embedded devices. This talk is looking for explore the aspects around IoT projects, Hardware, Security, Server Side, Data Analysis from the hand of Android Things and Kotlin.","persons":[{"id":709,"full_public_name":"Mercedes Wyss","abstract":"Community Leader, Auth0 Ambassador, Oracle Groundbreaker Ambassador, Women in Tech, Speaker, Geek and Passionate About Life.","twitter_name":"itrjwyss","avatar_path":"/system/avatars/709/large/LanzamientoBranch.jpg?1536614778"}]},{"id":3281,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Tools - Techniques","title":"Testing for Those Who have No Idea What’s Going On","track":"Tools and Techniques","type":"lecture","abstract":"Are you a developer who's been asked to do QA? Is your company shifting to a new model where developers both develop and build automation? Did your company give you absolutely no training on this important and rather opaque topic? Then this topic is for you! Having learned the hard way myself, I've come to enjoy the significance of testing and its many nuances. What is its primary difficulty? Terminology! What is the second difficulty? There's no end to testing, technically speaking, but there is an end to your company's money and time, not to mention your sanity. This talk will cover the basics and provide an excellent foundation for understanding the role and limitations of testing, and how to custom build your approach to testing that meets your particular goals and constraints in the most efficient, effective, and sanity-retaining manner.","persons":[{"id":763,"full_public_name":"Amanda Olsen","abstract":"UI Engineer with a desire to know everything (turns out this is impossible), an appreciation of clearly-written instructions, a love for JavaScript, a love for visuals and their role in our understanding, a deep joy in aesthetics, and a mild addiction to explaining things.","twitter_name":"AmandaLaine_UX","avatar_path":"/system/avatars/763/large/olsenPic.JPG?1510951615"}]},{"id":3122,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Tools - Techniques","title":"Performance tuning Twitter services with Graal and Machine Learning","track":"Tools and Techniques","type":"lecture","abstract":"Running Twitter services on Graal has been very successful and saved Twitter a lot of money on datacenter cost. In order to save even more we are using our Machine Learning framework called Autotune to tune Graal inlining parameters.","persons":[{"id":1560,"full_public_name":"Chris Thalinger","abstract":"Chris Thalinger is a software engineer working on Java Virtual Machines for over 14 years. His main expertise is in compiler technology with Just-In-Time compilation in particular. Initially being involved with the CACAO and GNU Classpath projects, the focus shifted to OpenJDK as soon as Sun made the JDK open-source. Ever since Chris has worked on the HotSpot JVM at Sun, Oracle and now at Twitter.","twitter_name":"christhalinger","avatar_path":"/system/avatars/1560/large/IMG_0001.jpg?1542807585"}]},{"id":2964,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Tools - Techniques","title":"Create a Continuous Delivery pipeline in 50 minutes","track":"Tools and Techniques","type":"lecture","abstract":"In this presentation I will show you how you can quickly create a Continuous Delivery pipeline for Java. It consists of GitLab, Jenkins, SonarQube, Nexus and a Docker registry, all running in Docker containers. A Jenkinsfile is used to define all the build steps from compile to running and testing our application for performance. A live demo is of course included.","persons":[{"id":690,"full_public_name":"Johan Janssen","abstract":"Johan is working as a Java architect and trainer at Info Support. He has been working for various demanding companies where rapidly delivering quality software was very important. Johan regularly writes articles and presents about various subjects at conferences like JavaOne, Devoxx BE/UK, J-Fall, Jfokus, JavaZone, GOTO. Johan received the JavaOne Rock Star award.","twitter_name":"@johanjanssen42","avatar_path":"/system/avatars/690/large/Johan_Janssen.jpg?1541745406"}]},{"id":3090,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Tools - Techniques","title":"Breaking into Open Source","track":"Tools and Techniques","type":"lecture","abstract":"We use it at work, we use it at home, in 2018 open source is all around us. Most of us only see the end result whither that be the apps we use or the binaries we import in our projects. This talk will give a behind the scenes look at all that goes into open source projects. Learn the differences between projects run by individuals, foundations and companies. Find out ways to contribute even if you're not a coder. Finally learn about some of the common processes and responsibilities associated with contributing to an open source project. Over the past 20 years open source has had a huge impact on the future of software development. It's been said the best way to predict the future is create it. Come find out how to be a part of the future today.","persons":[{"id":873,"full_public_name":"Michael Minella","abstract":"Michael Minella is a software engineer, Java Champion, speaker, and author with over 17 years of enterprise development experience. He currently works for Pivotal as the project lead for the Spring Batch and Spring Cloud Task projects. Michael has spoken on a number of Java, Spring, and Big Data topics and is a JavaOne Rockstar. Michael was a member of the expert group for JSR-352 (java batch processing). Michael is the author of Pro Spring Batch from Apress and the popular Refcard JUnit and EasyMock.\r\n\r\nOutside of the daily grind, Michael enjoys spending time with his family and enjoys woodworking, photography and InfoSec hobbies.","twitter_name":"michaelminella","avatar_path":"/system/avatars/873/large/MeCropped.jpg?1538665510"},{"id":850,"full_public_name":"Bob Paulin","abstract":"Bob Paulin is an independent consultant and speaker that has been developing open source software for the past 10 years. Bob has presented at large international conferences such as ApacheCon, JavaOne and Devnexus. He frequently shares his knowledge and opinions on the Java Pub House and Java Off Heap podcasts. Bob is actively involved in the Chicago developer community as the Chicago Java User Group Sponsorship Director and Chicago CJUG4Kids presenter/organizer. Bob is a passionate member of the ASF and donates his time to Apache Felix and Apache Tika as a committer and PMC respectively. When not coding, Bob enjoys coaching football, robotics, and spending time with his wife and 4 kids. ","twitter_name":"bobpaulin","avatar_path":"/system/avatars/850/large/bob.jpg?1537033760"}]}],"Web":[{"id":3177,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Web","title":"GraphQL: from beginner to expert in 60 minutes","track":"Web","type":"lecture","abstract":"In four short years, GraphQL has taken the API world by storm. You may heard about this technology and wondered what all the fuss is about; wonder no longer. We’ll start at the very beginning: what is GraphQL and what it can to to you. We’ll move on to brass tacks: developing a schema, implementing a server, and writing client queries. We’ll also touch on some of the many graphql tools and clients that have sprung up. By the end of the presentation, you’ll be able to start writing your own GraphQL servers and clients!","persons":[{"id":818,"full_public_name":"Yoel Spotts","abstract":"Yoel Spotts is a software engineer at Experience, based in Atlanta. Holding degrees in Computer Science and Talmudic Law, he has almost 20 years of programming experience. A huge fan of the JVM, Yoel has worked in Java, Groovy and Scala. No stranger to DevNexus or public speaking, Yoel attended the very first DevNexus (back before it was called DevNexus) and has presented several times in the past. When not building great software or trying to avoid category theory, Yoel enjoys hiking and spending time with his family.","twitter_name":"","avatar_path":"/system/avatars/818/large/Experience_032.jpg?1511108826"}]},{"id":2848,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Web","title":"Micro Web Apps (micro frontends)","track":"Web","type":"lecture","abstract":"Micro web front-end application architecture extends the microservices architecture to front-end web applications to achieve similar and specific benefits in a micro container architecture.","persons":[{"id":1446,"full_public_name":"Cosmin","abstract":"Cosmin is an engineer with a passion for code, who prefers keeping things simple and effective. He usually develops web apps and services, and has mobile apps experience. ","twitter_name":"https://twitter.com/cosmycx","avatar_path":"/system/avatars/1446/large/face.jpg?1542217438"}]},{"id":2877,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"01:00","room":"Web","title":"Bootiful Development with Spring Boot and Vue.js","track":"Web","type":"lecture","abstract":"You’re in love with Spring Boot, but you miss your old pal AngularJS? Don’t fear, Vue.js is here! Vue is very similar to AngularJS, but much more powerful, yet slim and light for PWAs.\r\n\r\nIn this session, you’ll see how to build a Spring Boot API and secure it with Spring Security. You’ll also learn how to build a Vue.js PWA, all the while enjoying a bootiful hot-code-reload experience. Lots of live coding in this one!","persons":[{"id":588,"full_public_name":"Matt Raible","abstract":"Web Developer, Java Champion, and Developer Advocate at Okta with a passion for skiing, mountain biking, VWs, and good beer. Driving a '66 21-window and a '90 Syncro. Made in Montana. @mraible on Twitter.","twitter_name":"mraible","avatar_path":"/system/avatars/588/large/mattraible.jpg?1523027696"}]},{"id":2698,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Web","title":"Focusing on Focus","track":"Web","type":"lecture","abstract":"When we think of CSS and Accessibility, what comes to mind? Is it adding alt attributes to image tags? How about color contrast? Is :focus given that much thought since browser's style these by default? Often, focus outlines are turned off in CSS to meet non-inclusive design standards, but this causes problems for keyboard users. How can we make the web a more inclusive place while maintaining design intent?","persons":[{"id":803,"full_public_name":"Chris DeMars","abstract":"Chris DeMars is a front end developer first, UX architect always, from Detroit, Michigan. For his community contributions, he holds awards as a Microsoft MVP in developer technologies and Google Developer Expert in web technologies. He is also an organizer for Vuetroit and co-organizer for the Ann Arbor Accessibility Group. Chris loves coming up with solutions for enterprise applications, which include modular CSS architectures, performance, and advocating for web accessibility. When he is not working on making the web great and inclusive you can find him writing blog posts, recording episodes of his podcast, Tales From The Script, watching horror movies, or in the woods of northern Michigan.","twitter_name":"saltnburnem","avatar_path":"/system/avatars/803/large/my-headshot.jpg?1548792965"}]},{"id":3179,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Web","title":"Hands-on PWA","track":"Web","type":"lecture","abstract":"Progressive Web Apps (PWA) have many of the benefits of native apps, like offline support and push notifications, without the hassle of installing yet another app. You'll learn the basics of PWA and how to build your own with a live coding example. ","persons":[{"id":531,"full_public_name":"Marcus Hellberg","abstract":"Marcus Hellberg is a developer advocate at Vaadin. He works with modern web technologies like Web Components and Progressive Web Applications. His background is in embedded systems but has worked on everything web related for the past 11+ years. ","twitter_name":"marcushellberg","avatar_path":"/system/avatars/531/large/MarcusHellberg-square.jpeg?1492464669"}]}],"Foyer":[],"Unobtanium":[{"id":3821,"date":"2019-03-08T10:00:00-05:00","start":"10:00","duration":"01:00","room":"Unobtanium","title":"Migrating to Java 11","track":"Unobtanium","type":"lecture","abstract":"Are your applications running on Java 8? Thinking about switching your application to run on Java 11 and wondering about where to start? Come to this session to learn about the most impactful changes that went into Java 11 and what you will need to do to move your application to run on Java 11. Topics will include the removal of APIs (such as Java EE packages) and behavior changes resulting from moving an application from running on Java 8 to running on Java 11. We will also go over tools to use that will help you identify potential issues within your application and how to resolve them.","persons":[{"id":1875,"full_public_name":"Dalia Abo Sheasha","abstract":"Dalia Abo Sheasha is the development lead for the IBM WebSphere Migration Tools. Her team develops several migration tools including the WebSphere Application Server Migration Toolkit. Dalia has worked on WebSphere for 5 years starting her career with the EJB team and transitioning to the JPA team where she contributed to the open-source projects: EclipseLink and OpenJPA. She loves talking about WebSphere Liberty and sometimes dresses up as it for Halloween (ask to see a picture).","twitter_name":"DaliaShea","avatar_path":"/system/avatars/1875/large/AboSheashaDalia2.jpg?1549897592"}]},{"id":3921,"date":"2019-03-08T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Unobtanium","title":"Open Liberty: A Modern Java Platform for the Cloud","track":"Unobtanium","type":"lecture","abstract":"If one thing can be said about the IT industry is that things are in constant flux. Every year there are new tools, new technologies and new articles that claim Java is dead, or not relevant, or being imminently replaced, and yet Java is still as relevant to modern businesses as it was a decade ago. The temptation is to look at Java middleware from the mid-2000s and dismiss in light of the shift into cloud based development and deployment practices and say \"it isn't relevant\". However Java middleware of the late 2010s is very different, more efficient and more cloud ready than ever.\r\n\r\nIn modern cloud environments you need runtimes that start and stop quickly, use a low memory footprint, scale well for high throughput and provide just enough runtime to support your application needs. Traditional Java application servers don't do this, but the traditional application server has been replaced by more efficient and effective frameworks that enable you to more quickly build and deploy your applications while using existing APIs that have been proven at building complex and reliable applications. Open Liberty is one such project, available under the Eclipse Public License it provides a fast, efficient and scalable foundation for building modern applications.\r\n\r\nIn this session Alasdair Nottingham, the Open Liberty lead, will guide you through the Open Liberty project and how to use it to build modern applications using Java EE, Eclipse MicroProfile or Spring that can be easily deployed into cloud platforms like Kubernetes.\r\n\r\n","persons":[{"id":917,"full_public_name":"Alasdair Nottingham","abstract":"","twitter_name":"nottycode","avatar_path":"/system/avatars/917/large/alasdai.jpeg?1549662243"}]},{"id":3317,"date":"2019-03-08T13:20:00-05:00","start":"13:20","duration":"00:40","room":"Unobtanium","title":"Advancing AI ubiquity in the enterprise IoT networks","track":"Unobtanium","type":"lecture","abstract":"This talk will focus on Edge Processing by taking advantage of deep learning capabilities of IoT devices as a cluster, by moving away from processing simple sensory data to deriving meaningful reasoning using Java. That is demonstrated by forming a group of intelligent devices as a single unit using 125 Raspberry Pis vs. 500+ GPU cores. This presentation will also explore JVM capabilities on ARM and X86 architectures, as well as large scale data mining on embedded GPUs such as Jetson Xavier and TX2.","persons":[{"id":1645,"full_public_name":"Mo Haghighi","abstract":"IBM DevRel Leader in the UK, former Intel research scientist and Sun Microsystems developer. CS PhD, speak Java, love coffee,live IoT, think AI, breathe Cloud and Foresee Blockchain. Father of 200 Raspberry Pis and 20k GPU cores.","twitter_name":"@mohaghighi","avatar_path":"/system/avatars/1645/large/IMG_6889.jpg?1538609730"}]},{"id":3794,"date":"2019-03-08T14:40:00-05:00","start":"14:40","duration":"01:00","room":"Unobtanium","title":"15 Ways to Optimize Spring Boot for the Cloud","track":"Unobtanium","type":"lecture","abstract":"As more organizations look to cloud providers to host their services, there is a need to ensure the applications we write are optimized to make the most of the cloud services as well as make the most of the dollars your organizations are paying to the cloud providers! The good news there are a lot of options for improving the performance out of your Spring boot apps, like turning off autoconfig, or using OpenJ9, and many of the changes are easy to make. In this presentation we will look at the top 15 ways you can optimize your Spring Boot application for the cloud! ","persons":[{"id":765,"full_public_name":"Billy Korando","abstract":"Billy is a developer advocate with IBM and has over a decade of experience. Billy is passionate about finding ways to reduce mental capacity waste from tedious work; such as project initiation, deployment, testing and validation, and so on through automation and good management practices. Outside of work Billy enjoy traveling, playing kickball, and having his heartbroken by cheering on the Kansas City Chiefs.","twitter_name":"@BillyKorando","avatar_path":"/system/avatars/765/large/billy.jpg?1521070157"}]},{"id":2975,"date":"2019-03-08T16:00:00-05:00","start":"16:00","duration":"01:00","room":"Unobtanium","title":"Zero-downtime Java Enterprise Applications With Kubernetes","track":"Unobtanium","type":"lecture","abstract":"The software world moves faster than ever. In order to stay competitive, new software versions need to be rolled out as soon as possible, without disrupting active users. Many enterprises have moved their workloads to Kubernetes, which has been built with production-readiness in mind. However, in order to achieve real zero-downtime with Kubernetes, without breaking or loosing a single in-flight request, we need to take a few more steps.","persons":[{"id":882,"full_public_name":"Sebastian Daschner","abstract":"Sebastian Daschner is a Java Developer Advocate at IBM, a consultant, author, and trainer. He is the author of the book ‘Architecting Modern Java EE Applications’. Sebastian is participating in the JCP, helping forming the future standards of Java EE, serving in the JAX-RS, JSON-P and Config Expert Groups and collaborating on various open source projects. For his contributions in the Java community and ecosystem he was recognized as a Java Champion, Oracle Developer Champion and double 2016 JavaOne Rockstar. Besides Java, Sebastian is also a heavy user of Linux and cloud native technologies. He evangelizes computer science practices on https://blog.sebastian-daschner.com, his newsletter, and on Twitter via @DaschnerS. When not working with Java, he also loves to travel the world — either by plane or motorbike.","twitter_name":"@DaschnerS","avatar_path":"/system/avatars/882/large/sebastian4.jpg?1536818345"}]}]}}]}}}