{"schedule":{"conference":{"title":"Devnexus 2020","start":"2020-02-19","end":"2020-02-21","daysCount":3,"timeslot_duration":"00:10","days":[{"index":0,"date":"2020-02-19","day_start":"2020-02-19T07:00:00-05:00","day_end":"2020-02-19T21:00:00-05:00","rooms":{"Room 1":[{"id":5092,"date":"2020-02-19T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Room 1","title":"Kotlin Full Day Workshop","track":"Full day Workshops (Wednesday Only)","type":"workshop","abstract":"Kotlin is a JVM-based language from JetBrains that works well with Java frameworks like Spring and is the preferred language for Android. According to recent developer surveys, it is among the fastest growing and most desired languages in industry today.\r\n\r\nThis workshop covers the features of Kotlin from basic topics, like nullability, val and var keywords, and the fundamental data types, to more advanced features like collections, sequences, functional programming, scope functions, and operator overloading. Exercises will include creating Kotlin scripts and classes, when to use top-level functions, working with existing libraries and domain-specific languages, and more.\r\n\r\nWhile Kotlin also provides multi-platform capabilities, this workshop will focus primarily on its relationship and interoperability with Java. No previous knowledge of Kotlin is required. Some familiarity with Java or a similar object-oriented language would be helpful.","persons":[{"id":1078,"full_public_name":"Kenneth Kousen","abstract":"Ken Kousen is a Java Champion, Oracle Groundbreaker Ambassador, and Grails Rock Star, and the author of the books Kotlin Cookbook (O'Reilly), Modern Java Recipes (O'Reilly), Gradle Recipes for Android (O'Reilly), and Making Java Groovy (Manning). He is a regular speaker on the No Fluff, Just Stuff Tour, and teaches training classes in areas related to Java, including Spring, Hibernate/JPA, Groovy, Grails, Gradle, and Android.","twitter_name":"kenkousen","avatar_path":"/system/avatars/1078/large/kousen_sep2019_medium.jpg?1573349579"}]}],"Room 2":[{"id":5286,"date":"2020-02-19T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Room 2","title":"Test Driven Development: From Principles to Practice","track":"Full day Workshops (Wednesday Only)","type":"workshop","abstract":"It's really about the economics of software development. Writing tests take time, but it saves time in the long run. Creating good tests is a skill. Tests can greatly influence the design of code we create. In this workshop we will see how writing tests is anything but a mechanical process. We will see both the regression benefits and the design benefits of creating tests. Learn by observing tests being created for a problem live. Then pair up with someone attending the workshop to test drive a program, from scratch, all the way to working code. Along the way measure the code coverage.","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]}],"Room 3":[{"id":4563,"date":"2020-02-19T09:00:00-05:00","start":"09:00","duration":"07:00","room":"Room 3","title":"Java Idioms for becoming a more powerful developer","track":"Full day Workshops (Wednesday Only)","type":"workshop","abstract":"Knowing programming idioms makes us more powerful and faster developers. This session will cover common (and not so common) idioms with regular expressions, file I/O and streams/lambdas. After attending this session, you’ll be able to impress your co-workers with your increased speed in solving programming tasks. You’ll also have the tools to spend less time on the “easy tasks” and more time solving business problems.\r\n\r\nYou will need a laptop with the following software:\r\n\r\nJava 11 JDK\r\nYour favorite IDE","persons":[{"id":883,"full_public_name":"Jeanne Boyarsky","abstract":"Jeanne Boyarsky is a Java Champion and published author. She wrote wrote Sybex’s hugely popular Java 8 and Java 11 certification books. She is a Java developer with 17 years experience and volunteers with a FIRST robotics team.  In 2018, she spoke at DevNexus, Oracle Code One and QCon.  Jeanne is a Distinguished Toastmaster which involves giving over 50 public speeches. For more on Jeanne’s professional experience:, see http:/jeanne.boyarsky.com","twitter_name":"jeanneboyarsky","avatar_path":"/system/avatars/883/large/2017-black-and-white.jpeg?1510619579"}]}],"Room 4":[{"id":4680,"date":"2020-02-19T09:00:00-05:00","start":"09:00","duration":"01:00","room":"Room 4","title":"Java Security Workshop","track":"Full day Workshops (Wednesday Only)","type":"workshop","abstract":"Java Security Workshop\r\ndescription needs rework\r\nCybercrime is rising at an alarming rate. As a Cloud Native developer you know you need to be better informed about security matters but it’s hard to know where to start. This workshop will help you understand how to improve the security of your application through a series of demonstration hacks and related hands on exercises. Serious though the topic is, this practical session will be fun and will leaving you more informed and better prepared. Start building your security memory muscle here","persons":[{"id":816,"full_public_name":"Steve Poole","abstract":"Steve Poole is a Developer Advocate, DevOps practitioner  and a long time IBM Java developer, leader and evangelist. He’s been working on Java SDKs and JVMs since Java was less than one year old. ","twitter_name":"spoole167","avatar_path":"/system/avatars/816/large/icon.png?1565420763"},{"id":1037,"full_public_name":"Brian Vermeer","abstract":"Developer Advocate for Snyk and Software Engineer with over 10 years of hands-on experience in creating and maintaining software. He is passionate about Java, (Pure) Functional Programming and Cybersecurity. Brian is an Oracle Groundbreaker Ambassador, Utrecht JUG Co-lead, Virtual JUG organizer and Co-lead at TheSecureDeveloper. He is a regular international speaker on mostly Java-related conferences like JavaOne, Oracle Code One, Devoxx BE, Devoxx UK, Jfokus, JavaZone and many more. Besides all that Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher.","twitter_name":"BrianVerm","avatar_path":"/system/avatars/1037/large/1569586529926_fact_1.jpg?1570377740"}]}],"Room 5":[{"id":4526,"date":"2020-02-19T09:00:00-05:00","start":"09:00","duration":"06:00","room":"Room 5","title":"Advanced Kubernetes workshop","track":"Full day Workshops (Wednesday Only)","type":"workshop","abstract":"Advanced Kubernetes workshop is hands-on & interactive giving attendees a thorough understanding of the advanced Kubernetes concepts for them to run it it in Production. This workshop is for those who have understanding of containers & have already run Kubernetes in some capacity even if it's in development environment & want to understand advanced concepts.","persons":[{"id":1500,"full_public_name":"Adarsh Shah","abstract":"Adarsh Shah is a Technology Leader, Coach, Hands-on Architect & a Change Agent with over 15 years of industry experience. He is also an organizer for Devopsdays NYC conference & devopsnyc meetup. Adarsh has a keen interest in building systems that add business value and is passionate about helping clients with digital transformation by improving both technical as well as non-technical aspects. These days, he is excited about working with distributed systems architecture and cloud native technologies. You can reach him on twitter at @shahadarsh.","twitter_name":"shahadarsh","avatar_path":"/system/avatars/1500/large/AdarshShah-1400pixels.jpg?1537059281"}]}],"Room 6":[{"id":4570,"date":"2020-02-19T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Room 6","title":"Kubernetes 101 Workshop","track":"Full day Workshops (Wednesday Only)","type":"workshop","abstract":"Microservices revolutionized the way we look at app development and is now one of the most popular programming architectures. Now, Docker alongside Kubernetes is changing the way teams look at deployments of these microservices. Kubernetes provides powerful production-grade orchestration for your “Dockerized” microservices.","persons":[{"id":2168,"full_public_name":"JJ Asghar","abstract":"JJ works at IBM on the IBM cloud as a Developer Advocate. He’s focusing on the IBM Kubernetes Service trying to make companies and users have a successful on boarding to the Cloud Native ecosystem.","twitter_name":"jjasghar","avatar_path":null}]}],"Room 7":[{"id":4976,"date":"2020-02-19T09:00:00-05:00","start":"09:00","duration":"07:00","room":"Room 7","title":"Cloud Native Microservice with MicroProfile, Docker, Kubernetes, Istio and Open Shift","track":"Full day Workshops (Wednesday Only)","type":"workshop","abstract":"Are you doing or considering Cloud Native microservices? Ever wondered what the unique challenges are and how best to address them on fully-open Java technologies? Are you doing the Cloud Native microservices the right way? In this workshop, you'll learn what it means to be cloud-native and how that impacts application development. You'll learn about Eclipse MicroProfile, an industry collaboration defining technologies for the development and management of cloud-native microservices. With a full set of MicroProfile workshop modules available to you, you'll be able to start with the basics of REST services and progress to more advanced topics such as secure, fault tolerant, configurable and monitorable microservices.\r\nOnce you've developed your microservice, you'll learn how to package it in a Docker container and deploy it to a Kubernetes cluster. The role of a service mesh and use of Istio to manage your microservice interactions will also be learned. Finally, you can also learn how to deploy onto Open Shift, an enterprise Kubernetes application platform, to see how your microservice function.  In summary, this workshop connects powerful open stacks to cover end-to-end cloud-native microservices from development to deployment.","persons":[{"id":817,"full_public_name":"Emily Jiang","abstract":"Emily Jiang is a Java Champion. She is Liberty Microservices Architect and Advocate, STSM in IBM, based at Hursley Lab in the UK. Emily is a senior MicroProfile lead and has been working on MicroProfile since 2016 and leads the specifications of MicroProfile Config, Fault Tolerance and Service Mesh. She is CDI Expert Group member.\r\n\r\nShe has worked on the WebSphere Application Server since 2006 and is heavily involved in Java EE and MicroProfile implementation in Liberty releases. \r\n\r\nShe regularly speaks at conferences, such as Code One, DevNexus, JAX London, Voxxed, Devoxx US, Devoxx Belgium, Devoxx UK, Devoxx France, EclipseCon, etc. Follow her on Twitter @emilyfhjiang and/or connect with her on LinkedIn (https://www.linkedin.com/in/emily-jiang-60803812/).\r\n","twitter_name":"emilyfhjiang","avatar_path":"/system/avatars/817/large/Emily-photo.png?1565795958"}]}],"Room 8":[{"id":4609,"date":"2020-02-19T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Room 8","title":"The Quarkus Tutorial","track":"Full day Workshops (Wednesday Only)","type":"workshop","abstract":"Java was doomed to become a legacy platform in this new cloud-native, serverless world. Slow startups, and high memory consumption made Java simply an alien in this new brave new world. But then Quarkus was created: the Supersonic, Subatomic Java platform. With Quarkus we're able to just save a file and automatically refresh and check the changes in our code in a matter of milliseconds. And thanks to a perfect match with GraalVM, we can use Quarkus to compile our projects to a native image, granting us millisecond startup time and a few MB of memory consumption. Be welcomed: with Quarkus you can still use your Java skills in the next age of software development.","persons":[{"id":915,"full_public_name":"Edson Yanaga","abstract":"Edson Yanaga, Red Hat's Director of Developer Experience, is a Java Champion and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java, Microservices, Cloud Computing, DevOps, and Software Craftsmanship. ","twitter_name":"yanaga","avatar_path":"/system/avatars/915/large/edson_yanaga.jpg?1507757067"}]}],"Room 9":[{"id":4750,"date":"2020-02-19T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Room 9","title":"Extending Spring Boot for Enterprise","track":"Full day Workshops (Wednesday Only)","type":"workshop","abstract":"Spring Boot has been an incredibly successful at reducing the time and complexity of spinning up new projects. However enterprise demands often cause Spring Boot projects to become bloated. In this presentation we will take Spring Boot's principle and learn how to apply them to the enterprise!  \r\n","persons":[{"id":2225,"full_public_name":"Billy Korando","abstract":"Billy is a developer advocate with IBM and has over a decade of experience. Billy is passionate about finding ways to reduce mental capacity waste from tedious work; such as project initiation, deployment, testing and validation, and so on through automation and good management practices. Outside of work Billy enjoy traveling, playing kickball, and having his heartbroken by cheering on the Kansas City Chiefs.","twitter_name":"@BillyKorando","avatar_path":"/system/avatars/2225/large/profile_pic.jpg?1565790439"}]}],"Room 10":[{"id":4934,"date":"2020-02-19T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Room 10","title":"Responsible Microservices Architecture","track":"Full day Workshops (Wednesday Only)","type":"workshop","abstract":"These days, you can’t swing a dry erase marker without hitting someone talking about microservices. Developers are studying Eric Evan’s prescient book Domain Driven Design. Teams are refactoring monolithic apps, looking for bounded contexts and defining a ubiquitous language. And while there have been countless articles, videos, and talks to help you convert to microservices, few have spent any appreciable time asking if a given application should be a microservice. In this talk, I will show you a set of factors you can apply to help you decide if something deserves to be a microservice or not. We’ll also look at what we need to do to maintain a healthy micro(services)biome.","persons":[{"id":1058,"full_public_name":"Nathaniel Schutta","abstract":"Nathaniel T. Schutta is a software architect focussed on mobile and making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. In an effort to rid the world of bad presentations, Nate coauthored the book Presentation Patterns with Neal Ford and Matthew McCullough.","twitter_name":"ntschutta","avatar_path":"/system/avatars/1058/large/nts_pic_400x400.jpg?1510766283"}]}],"Room 11":[{"id":5072,"date":"2020-02-19T09:00:00-05:00","start":"09:00","duration":"06:00","room":"Room 11","title":"Domain Driven Design Workshop","track":"Full day Workshops (Wednesday Only)","type":"workshop","abstract":"Domain-Driven Design (DDD) can be used to accelerate your strategic initiatives and gain a competitive advantage. Instead of trying to solve real strategic software initiatives by throwing technology at the problem, emphasis should be placed on treating software development as a craft by embracing software design that works within the framework of agile processes. This 8-hr workshop is best suited for mid-level developers and above, who are interested in software craftsmanship and learning domain modeling using the Domain-Driven Design (DDD) approach. If your organization is looking towards a future with micro-services, consider this workshop an essential foundation. This is a hands-on workshop. Students are strongly encouraged to engage in workshop exercises and write source code that includes implementing multiple interacting micro-services, as DDD Bounded Contexts, that are event-driven.\r\n \r\n  The goal of this workshop is to become more familiarized with DDD by freeing your mind from data-driven approaches. We will cover strategic design concepts, such as, Sub-domains, bounded contexts, and context maps, as well as some tactical design concepts, such as, Entities, Value Objects, and Domain events.  Finally, we will bring all the parts together to create an application.","persons":[{"id":1071,"full_public_name":"Rob Curry","abstract":"I am a Java, Agile, and Clean Code advocate that is not afraid of databases, RESTful web services, or warm, gooey cookies.  I enjoy working with and leading Agile teams to deliver reliable, useful services and applications.  My current interests include Domain Driven Design, distributed databases, evolutionary architecture, and micro-services.","twitter_name":"","avatar_path":"/system/avatars/1071/large/Curry_Robert-.jpg?1580401038"},{"id":2495,"full_public_name":"Kelly Morrison","abstract":"Solutions architect/Consultant at Daugherty Business Solutions. Doctorate in Software Engineering from Auburn University, and 25+ years of professional experience.","twitter_name":"","avatar_path":"/system/avatars/2495/large/Kelly_Morrison.png?1580248829"},{"id":2494,"full_public_name":"Tony Stuchel","abstract":"Senior Principal Consultant/Solution Architect at Daugherty Business Solutions with more than 25 years of professional experience.","twitter_name":"@StuchelDev","avatar_path":"/system/avatars/2494/large/Tony3.jpg?1579557432"},{"id":2493,"full_public_name":"Steve Fordham","abstract":"I am a Principal Consultant for Daugherty Business Solutions in Atlanta, where I lead our Software Architecture & Engineering practice I've been practicing software development for 35 years, 10 at IBM and the rest in consulting. My experience has been focused on architecting and building complex, mission critical software for Fortune 500 clients. When I'm not working, I like to go for long walks in the north Georgia mountains with my wife April and our one-year-old Great Dane, Molly.\r\n","twitter_name":"@sfordham","avatar_path":"/system/avatars/2493/large/Steve_Fordham.jpg?1579555602"},{"id":2314,"full_public_name":"Sharma Vedula","abstract":"Strategic, focused and business oriented technical leader/Enterprise Architect with 25+ years of success in meeting critical software engineering challenges. Experience working with stakeholders to develop architecture framework that aligns strategy, processes, and IT assets with business.","twitter_name":"@Sharmavedula","avatar_path":"/system/avatars/2314/large/profileImage.jpg?1567543450"}]}],"Room 12":[{"id":5378,"date":"2020-02-19T09:00:00-05:00","start":"09:00","duration":"08:00","room":"Room 12","title":"Google Cloud Native with Spring Boot","track":"Full day Workshops (Wednesday Only)","type":"workshop","abstract":"Spring Framework and Spring Boot made huge strides to make it easier than ever to develop the next generation of cloud native applications. More importantly, a number of Spring projects provides cloud-vendor agnostic abstractions to developers, so that with a simple configuration switch, you are able to move your local application to run in an on-prem datacenter, or in the cloud with managed services.\r\n\r\nGoogle and Pivotal partnered to develop Spring Cloud adapters for Google Cloud Platform. With Spring Cloud GCP, you can quickly develop cloud native applications & harness the power of Google infrastructure, including easy connection to GCP's managed databases, using Pub/Sub to send and receive messages, and other tools for tracing and monitoring your services.\r\n\r\nIn this session, we'll build cloud native service with Spring Boot that:\r\nTakes advantage of Google Cloud Platform highly available managed services, such as Cloud SQL, Pub/Sub, Cloud Spanner.\r\nDeploys to managed environments, such as Kubernetes, App Engine, and Cloud Run.\r\nOperate the application by using monitoring, tracing, centralized logging, debugging, and profiling tools.\r\n\r\nPrereqs: A laptop with a Chrome browser.\r\n","persons":[{"id":806,"full_public_name":"Ray Tsang","abstract":"Ray is currently a Developer Advocate at Google focused on Google Cloud Platform and Java developer experience. Follow Ray on Twitter @saturnism (https://twitter.com/saturnism)","twitter_name":"saturnism","avatar_path":"/system/avatars/806/large/profile.jpeg?1517295479"},{"id":1589,"full_public_name":"James Ward","abstract":"James Ward is a nerd / software developer who shares what he learns with others though presentations, blogs, demos, and code. After over two decades of professional programming, he is now a self-proclaimed Typed Pure Functional Programming zealot but often compromises on his ideals to just get stuff done. After spending too many sleepless nights in data centers repairing RAID arrays, he now prefers higher-level cloud abstractions with appropriate escape hatches. James is a huge Open Source proponent, hoping to never get burned by lock-in again.","twitter_name":"_JamesWard","avatar_path":"/system/avatars/1589/large/james_ward_2015.jpg?1548958691"}]}],"Room 13":[{"id":5361,"date":"2020-02-19T10:00:00-05:00","start":"10:00","duration":"02:30","room":"Room 13","title":"JUG Leaders Summit","track":"admin","type":"other","abstract":"","persons":[]}],"Room 14":[],"Room 15":[],"Foyer":[],"Keynote Room":[]}},{"index":1,"date":"2020-02-20","day_start":"2020-02-20T07:00:00-05:00","day_end":"2020-02-20T21:00:00-05:00","rooms":{"Room 1":[{"id":5055,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 1","title":"Agile is a Four-Letter Word","track":"Agile","type":"lecture","abstract":"Based on a wide variety of surveys taken over recent years, many companies are transitioning to something that looks like Agile, whether they use that term or not. However, that transition doesn’t necessarily mean implementations have been done while respecting the Agile Manifesto and the principles behind it. ","persons":[{"id":2294,"full_public_name":"Jen Krieger","abstract":"Keynote speaker and doer of many things, Jen Krieger is Chief Agile Architect at Red Hat.","twitter_name":"@mrry550","avatar_path":"/system/avatars/2294/large/Jen_Krieger.jpg?1566847150"}]},{"id":4906,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 1","title":"Agile Software Engineering","track":"Agile","type":"lecture","abstract":"Learn some of the techniques that successful agile teams use to build applications with code and design quality, foster emergent design, and communicate with lightweight documentation.","persons":[{"id":1415,"full_public_name":"M. Jeff Wilson","abstract":"M. Jeff Wilson is a avid software developer, published author, certified scrum master and SAFe Program Coach, and lifelong learner. He has worked with teams in the telecommunications, insurance, traffic engineering, retail, and other industries to develop and deliver solutions and improve processes. ","twitter_name":"@mjeffw","avatar_path":"/system/avatars/1415/large/profile.jpeg?1565960478"}]},{"id":4692,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 1","title":"Mothering A Dev Team","track":"Agile","type":"lecture","abstract":"This mom is no stranger to bringing lessons learned via parenting into the workplace, and vice versa. I’ll show you how to use Wardley Maps, and other planning strategies, to streamline your life, and your work projects, in new and exciting ways!","persons":[{"id":1190,"full_public_name":"Valarie Regas","abstract":"Valarie Regas is a youngling developer, a Georgia Tech coding bootcamp graduate, and a veteran mommy. She holds a BA in Psychology and currently works as a Jr. DevOps Engineer. After years being a stay-at-home mom, she decided to change her life by entering Tech, and has learned a lot along the way. She enjoys mixed martial arts fighting, table-top role playing games, public speaking, creating tiny humans, and political activism.  ","twitter_name":"@ValarieRegas","avatar_path":"/system/avatars/1190/large/vr.jpeg?1570755272"}]},{"id":4479,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 1","title":"Metrics that Matter - Moving from Easy to Impactful","track":"Agile","type":"lecture","abstract":"Metrics are the bane of many organizations, getting fascinated on measurements that don’t matter or can drive improper behaviours. In this session, we walk through a simple grouping for metrics where the groupings not only call out the metrics, but their limits, and help guide to better metrics.","persons":[{"id":897,"full_public_name":"Joel Tosi","abstract":"Just a dude helping organizations improve their product delivery ","twitter_name":"joeltosi","avatar_path":"/system/avatars/897/large/tosiHeadshot.jpg?1571785385"}]},{"id":5004,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 1","title":"Strategy for Engineers","track":"Agile","type":"lecture","abstract":"Strategies have a direct impact on our everyday work: product outcomes, team efficacy, and job satisfaction. In this talk, I'll share my approach to evolving strategies with engineers. We'll look at several examples of outcomes you can influence, and you'll pick up a simple tool for identifying, formulating, and refining your own strategies relating to your system, your team, and your career.","persons":[{"id":1457,"full_public_name":"David Laribee","abstract":"David Laribee is a player-coach, trainer, speaker, and co-founder of Nerd/Noir. He believes in the power of collaboration, simplicity, and feedback. He has built teams and products for companies in the Fortune 500 and startups alike. Prior to founding Nerd/Noir, an agile consulting company, David coached the product development team at VersionOne, a leader in agile planning tools.","twitter_name":"laribee","avatar_path":"/system/avatars/1457/large/david-laribee.jpg?1535051292"}]}],"Room 2":[{"id":4935,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 2","title":"Thinking Architecturally","track":"Architecture","type":"lecture","abstract":"Rich Hickey once said programmers know the benefits of everything and the trade offs of nothing...an approach that can lead a project down a path of frustrated developers and unhappy customers. As architects though, we must consider the trade offs of every new library, language, pattern or approach and quickly make decisions often with incomplete information. How should we think about the inevitable technology choices we have to make on a project? How do we balance competing agendas? How do we keep our team happy and excited without chasing every new thing that someone finds on the inner webs?","persons":[{"id":1058,"full_public_name":"Nathaniel Schutta","abstract":"Nathaniel T. Schutta is a software architect focussed on mobile and making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. In an effort to rid the world of bad presentations, Nate coauthored the book Presentation Patterns with Neal Ford and Matthew McCullough.","twitter_name":"ntschutta","avatar_path":"/system/avatars/1058/large/nts_pic_400x400.jpg?1510766283"}]},{"id":4794,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 2","title":"Break me if you can: A practical guide to building fault-tolerant systems","track":"Architecture","type":"lecture","abstract":"You built your system, you deployed it, you rolled it up in production, but it’s just the beginning. The life of your system just started. It will grow, evolve, and wake you up in the middle of the night. Usually, at this point you start thinking about fault tolerance and error handling. \r\n\r\nIn this talk you will learn practical recipes (code and design patterns) to build fault-tolerant, scalable systems using open source tools; and understand the role of product decisions in building fault-tolerant software and the importance of a proper communication culture.","persons":[{"id":2470,"full_public_name":"Mykyta Protsenko","abstract":"Mykyta Protsenko is a senior software engineer at Netflix. He is passionate about all things scalable, from coding to deploying to monitoring. ","twitter_name":"@mykyta_p","avatar_path":"/system/avatars/2470/large/mykyta_square.jpg?1574232244"},{"id":1565,"full_public_name":"Alex Borysov","abstract":"Alex Borysov is a senior software engineer at Netflix. He is a clean coder and a test-driven developer with solid experience in building and running world-scale software systems. During his career Alex developed and ran machine learning infrastructure for payments fraud detection at Google, large-scale backends at Nest, microservice architecture for world-leading social casino games, and core infrastructure services for a unicorn startup in Silicon Valley with more than 300 million users.","twitter_name":"aiborisov","avatar_path":"/system/avatars/1565/large/alex_borysov_headshot.png?1565851077"}]},{"id":4447,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 2","title":"Architecture patterns for distributed, hybrid and global Apache Kafka deployments ","track":"Architecture","type":"lecture","abstract":"Multi-cluster and cross-data center deployments of Apache Kafka have become the norm rather than an exception. This session gives an overview of several scenarios that may require multi-cluster solutions and discusses real-world examples with their specific requirements and trade-offs, including disaster recovery, aggregation for analytics, cloud migration, mission-critical stretched deployments and global Kafka.","persons":[{"id":714,"full_public_name":"Kai Waehner","abstract":"Kai Waehner works as Technology Evangelist at Confluent. Kai’s main area of expertise lies within the fields of Big Data Analytics, Machine Learning / Deep Learning, Messaging, Integration, Microservices, Internet of Things, Stream Processing and Blockchain. He is regular speaker at international conferences such as JavaOne, O’Reilly Software Architecture or ApacheCon, writes articles for professional journals, and shares his experiences with new technologies on his blog (www.kai-waehner.de/blog). Contact and references: kontakt@kai-waehner.de / @KaiWaehner / www.kai-waehner.de","twitter_name":"@KaiWaehner","avatar_path":"/system/avatars/714/large/Kai_Waehner_2017.jpg?1504514072"}]},{"id":4916,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 2","title":"DevOps Patterns and Antipatterns for Continuous Software Updates","track":"Architecture","type":"lecture","abstract":"So, you want to update the software for your user. What can possibly go wrong?\r\n\r\nJoin us for some awesome and scary continuous update horror stories and some obvious (and some not so obvious) proven ideas for improvement and best practices you can start following tomorrow.\r\n","persons":[{"id":864,"full_public_name":"Baruch Sadogursky","abstract":"JFrog Developer Advocate","twitter_name":"@jbaruch","avatar_path":"/system/avatars/864/large/2017_official.jpg?1537124114"}]},{"id":4461,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 2","title":"\"Synchronized\" is obsolete - for both monoliths and cloud apps!","track":"Architecture","type":"lecture","abstract":"The \"synchronized\" keyword in Java has always been there and it's what developers usually learn first when dealing about concurrency, but its use is less than ideal in many cases, and with modern cloud architecture, it's become mostly useless. Developers need to learn about all the new ways to handle concurrency in Java; this is an introduction to some of the more common patterns.","persons":[{"id":716,"full_public_name":"Enrique Zamudio","abstract":"Enrique has been creating software professionally for more than 20 years, specializing in backend systems and host to host interfaces. He was named Java Champion in 2015 and worked on the Ceylon to Javascript compiler for 5 years. He's currently a Sr Software Engineer at Bitso, the most important cryptocurrency exchange in Mexico.","twitter_name":"chochosmx","avatar_path":"/system/avatars/716/large/ezl_bitso_smallcrop.png?1562256509"}]}],"Room 3":[{"id":5017,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 3","title":"Kubernetes (and OpenShift) for Developers","track":"Cloud Infrastructure","type":"lecture","abstract":"The first PaaS debuted in 2005.  Designed to make developers’ lives easier and operations obsolete, PaaS barely registered in the enterprise landscape.  Kubernetes v1 debut in 2015 and changed the game. \r\n\r\nKubernetes dominates mindshare (and market share), has been adopted by all major IT vendors, and faces no real competition for container orchestration.  Kubernetes is now one of the hottest and most in-demand skills in our profession.\r\n\r\nWhile Kubernetes makes running containers easier it can make development more complex.  In this talk we will look at how deploying to Kubernetes effects your day to day work as a developer from test/compile/commit to design patterns and tooling.\r\n","persons":[{"id":2222,"full_public_name":"Jeremy Davis","abstract":"I am a Chief Architect for App Dev Technologies at Red Hat.  I solve problems, sling open source software, spend a lot of time on airplanes, and recently purchased a Fender Jazzmaster. ","twitter_name":"@argntprgrmr","avatar_path":"/system/avatars/2222/large/headshot.jpg?1565908657"}]},{"id":4734,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 3","title":"Fantastic Buildpacks and Where to Find Them","track":"Cloud Infrastructure","type":"lecture","abstract":"Adventure awaits you as we journey through the buildpack ecosystem. We'll discuss how to find buildpacks in the wild and examine their different habitats, including Google, Heroku, and Cloud Foundry. In this talk, you'll learn how to run buildpacks and where to find production ready buildpacks that are perfect for your app.","persons":[{"id":842,"full_public_name":"Joe Kutner","abstract":"Joe is the Java Languages Owner at Heroku. He was named a JavaOne Rock Star in 2016, and authored Deploying with JRuby.","twitter_name":"codefinger","avatar_path":"/system/avatars/842/large/purple_bowtie.jpg?1541860127"},{"id":1589,"full_public_name":"James Ward","abstract":"James Ward is a nerd / software developer who shares what he learns with others though presentations, blogs, demos, and code. After over two decades of professional programming, he is now a self-proclaimed Typed Pure Functional Programming zealot but often compromises on his ideals to just get stuff done. After spending too many sleepless nights in data centers repairing RAID arrays, he now prefers higher-level cloud abstractions with appropriate escape hatches. James is a huge Open Source proponent, hoping to never get burned by lock-in again.","twitter_name":"_JamesWard","avatar_path":"/system/avatars/1589/large/james_ward_2015.jpg?1548958691"}]},{"id":4914,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 3","title":"Do it in code (not YAML)! ","track":"Cloud Infrastructure","type":"lecture","abstract":"When it comes to deploying applications at scale without needing to integrate different pieces of infrastructure yourself, the answer nowadays is increasingly Kubernetes. While Kubernetes does provide all the building blocks and deployment tools, much thought is required to truly deployment pipelines to use in production. Configuring your builds with things like YAML may be tedious and error-prone. What if you can use the power of Kotlin’s type system and compile-time checks while building your deployments! In this interactive and code-driven session Fedor and Viktor teach you how to use Kotlin DSL for Kubernetes to configure your deployments (including custom resource definitions like Kafka CRD).","persons":[{"id":656,"full_public_name":"Vik Gamov","abstract":"Viktor Gamov is a Developer Advocate at Confluent, the company that makes a streaming platform based on Apache Kafka.\r\n","twitter_name":"gamussa","avatar_path":"/system/avatars/656/large/vg.jpeg?1570755775"}]},{"id":4936,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 3","title":"OpenShift is Kubernetes and More","track":"Cloud Infrastructure","type":"lecture","abstract":"Kubernetes is much like the Linux kernel, the core capabilities needed for advanced container orchestration and cloud capabilities, but in almost all cases, you will use Kubernetes via one of its popular hosted as-a-service (e.g. Google, Azure, etc) or distributions (e.g. OpenShift, PKS, Rancher).  In this session, we will compare and contrast the differences between raw Kubernetes and the enterprise-ready distribution known as OpenShift.  \r\n","persons":[{"id":836,"full_public_name":"Burr Sutter","abstract":"A lifelong developer advocate, community organizer, and technology evangelist, Burr Sutter is a featured speaker at technology events around the globe—from Bangalore to Brussels and Berlin to Beijing (and most parts in between)—he is currently Red Hat’s Director of Developer Experience. A Java Champion since 2005 and former president of the Atlanta Java User Group, Burr founded the DevNexus conference—now the second largest Java event in the U.S.—with the aim of making access to the world’s leading developers affordable to the developer community. When not speaking abroad, Burr is also the passionate creator and orchestrator of highly-interactive live demo keynotes at Red Hat Summit, the company’s premier annual event.","twitter_name":"burrsutter","avatar_path":"/system/avatars/836/large/080717_BURRSUTTER_HEADSHOT_6INX6IN_300DPI.JPG?1536947070"}]},{"id":4784,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 3","title":"Kafka on Kubernetes!","track":"Cloud Infrastructure","type":"lecture","abstract":"When it comes to choosing a distributed streaming platform for real-time data pipelines, everyone knows the answer: Apache Kafka! And when it comes to deploying applications at scale without needing to integrate different pieces of infrastructure yourself, the answer nowadays is increasingly Kubernetes. However, with all great things, the devil is truly in the details. While Kubernetes does provide all the building blocks that are needed, a lot of thought is required to truly create an enterprise-grade Kafka platform that can be used in production. In this technical deep dive, Viktor will go through challenges and pitfalls of managing Kafka on Kubernetes as well as the goals and lessons learned from the development of the Confluent Operator for Kubernetes.","persons":[{"id":656,"full_public_name":"Vik Gamov","abstract":"Viktor Gamov is a Developer Advocate at Confluent, the company that makes a streaming platform based on Apache Kafka.\r\n","twitter_name":"gamussa","avatar_path":"/system/avatars/656/large/vg.jpeg?1570755775"}]}],"Room 4":[{"id":4552,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 4","title":"Game of Streams: How to Tame & Get the Most from your Messaging Platforms ","track":"Cloud Technology","type":"lecture","abstract":"Most critical systems are partially or entirely distributed, causing a number of challenges. Learn how to REALLY leverage OSS solutions like Spring Cloud Stream, RabbitMQ, & Kafka to maximize your systems' capabilities while minimizing complexity. All examples will be coded *live & in real-time*!","persons":[{"id":712,"full_public_name":"Mark Heckler","abstract":"Mark Heckler is a Pivotal Principal Technologist & Spring Developer Advocate, conference speaker, published author, & Java Champion focusing upon developing innovative production-ready software at velocity for the Cloud and IoT applications. He has worked with key players in the manufacturing, retail, medical, scientific, telecom, and financial industries and various public sector organizations to develop and deliver critical capabilities on time and on budget. Mark is an open source contributor and author/curator of a developer-focused blog (https://www.thehecklers.com) and an occasionally interesting Twitter account (@mkheck).","twitter_name":"@mkheck","avatar_path":"/system/avatars/712/large/MarkHecklerProfilePic.jpg?1519666499"}]},{"id":5043,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 4","title":"Micronaut Launchpad: From Ground Zero to Orbit","track":"Cloud Technology","type":"lecture","abstract":"This talk is a fast-paced introduction to the Micronaut framework, from creating the first app to orchestrating a microservice federation and deploying to the cloud. We will cover the basics of writing Micronaut apps, communication between services, building for resiliency, managing configuration, and deploying to a cloud provider. By the time we're finished, you'll have a good understanding of the features of the framework and be ready to start building and deploying your own apps with Micronaut. Buckle up and start the countdown!","persons":[{"id":1874,"full_public_name":"Zachary Klein","abstract":"Zachary Klein is a Senior Software Engineer at OCI.  He has been practicing web development since 2010 and frontend development since 2015. He's a contributor to both the Grails and Micronaut frameworks, as well as an instructor in OCI's training practice. Zachary's home base is in St Louis, MO, along with his wife, Beth, and three children.\r\n\r\n","twitter_name":"@ZacharyAKlein ","avatar_path":"/system/avatars/1874/large/Zak-3.png?1548352750"}]},{"id":4611,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 4","title":"Afterlife tales: Troubleshooting containerized applications","track":"Cloud Technology","type":"lecture","abstract":"Your application is living now in a container, yet is its private life a happy one? Find out that before your users do! If your application is not feeling so well, perhaps dealing with issues should be an inner container/Kubernetes affair while trying not to affect the availability of your software.","persons":[{"id":1879,"full_public_name":"Ana Maria Mihalceanu","abstract":"Ana-Maria Mihalceanu is a custom application development enthusiast, co-founder of Bucharest Software Craftsmanship Community and a constant adopter of challenging technical scenarios. Some of her older experiments are available on Dzone. Other passions? The knowledge hunt through reading and growing fashion skills through shopping.","twitter_name":"@ammbra1508","avatar_path":"/system/avatars/1879/large/amv.jpeg?1570755550"}]},{"id":4631,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 4","title":"Java and Containers - Make it Awesome !","track":"Cloud Technology","type":"lecture","abstract":"More and more companies are adopting some form of cloud for hosting their applications. Cloud also increasingly means Docker containers and Kubernetes to orchestrate them. Cloud is a different beast when it comes to running Java applications. It focuses on fast provisioning, ephemeral containers that startup and scale quickly and use minimum resources when idle. Correspondingly the JVM has undergone a number of changes that help it to adapt to cloud environments. \r\n\r\nThis talk looks closely at each of the cloud specific aspects and explores the changes in Java that a developer needs to be aware of to make the most of running a Java app in the cloud and provides a github based tutorial for reference.","persons":[{"id":2149,"full_public_name":"(Dino) Dinakar Guniguntala","abstract":"Dinakar Guniguntala is the Java Cloud Optimization Architect at IBM. He has been at IBM for over 21 years and in his current role, has twin responsibilities of making Java run more efficiently in the cloud and helping customers modernize their Java applications. He is the community maintainer of the AdoptOpenJDK Java Docker Images for both Hotspot and Eclipse OpenJ9 as well as the maintainer of the IBM Java Docker Images.\r\nHe is a former Linux Kernel Hacker and has worked on Linux Realtime, cpusets, dynamic sched domains etc. He has several publications including in IEEE computer, IBM Systems Journal and IBM Developer Works and has spoken at conferences such as JavaOne San Francisco, FOSS.in, Bangalore and is a prolific speaker at Meetups.","twitter_name":"@dinogun","avatar_path":"/system/avatars/2149/large/dg.jpeg?1570642628"}]},{"id":4643,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 4","title":"Calculating Insulin With Automated Carb Counting Using AI, ML and Web Bluetooth","track":"Cloud Technology","type":"lecture","abstract":"In this session we'll look at how I created a Progressive Web Application to assist diabetics in calculating their insulin dosages based on the carbohydrates in the food that they are eating and their personalized settings.","persons":[{"id":688,"full_public_name":"Todd Sharp","abstract":"I'm a Developer Advocate for Oracle focusing on the Oracle Cloud. I have 15 years experience as a full stack developer.  I've been working with dynamic JVM languages and various JavaScript frameworks for my whole career - originally with ColdFusion and more recently Groovy/Grails on the server side.  I have experience with everything from jQuery, ExtJS to all versions of Angular on the front end.","twitter_name":"recursivecodes","avatar_path":"/system/avatars/688/large/15035732_1310991748965002_2689404947618856960_n.jpg?1503360504"}]}],"Room 5":[{"id":4565,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 5","title":"Java: Did you Know That?","track":"Core Java","type":"lecture","abstract":"As programmers we are used to dealing with edge cases. But what about edge cases in the language? As a certification book author, I encounter lots of interesting and/or surprising behavior.  Come to this session and walk away with an increased awareness in these Java gotchas. This is not a Java puzzlers talk. These are surprises you might actually come across.\r\n","persons":[{"id":883,"full_public_name":"Jeanne Boyarsky","abstract":"Jeanne Boyarsky is a Java Champion and published author. She wrote wrote Sybex’s hugely popular Java 8 and Java 11 certification books. She is a Java developer with 17 years experience and volunteers with a FIRST robotics team.  In 2018, she spoke at DevNexus, Oracle Code One and QCon.  Jeanne is a Distinguished Toastmaster which involves giving over 50 public speeches. For more on Jeanne’s professional experience:, see http:/jeanne.boyarsky.com","twitter_name":"jeanneboyarsky","avatar_path":"/system/avatars/883/large/2017-black-and-white.jpeg?1510619579"}]},{"id":4470,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 5","title":"Fun path to Java SE 11 Developer Certifications","track":"Core Java","type":"podium","abstract":"Get started with the journey of preparing for your Java 11 Programmer Certifications and discover fun-filled ways to sustain it.","persons":[{"id":2141,"full_public_name":"Mala Gupta","abstract":"Developer Advocate at JetBrains. Java Champion and author of multiple books on Java Certifications with Manning Publications. Believes in learning everyday.","twitter_name":"@eMalaGupta","avatar_path":"/system/avatars/2141/large/Mala.png?1562334338"}]},{"id":4729,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 5","title":"JVM Performance Analysis Live on Stage","track":"Tools and techniques","type":"lecture","abstract":" We will walk you through the performance analysis of common problems of Java workloads, point you to the best tools to perform your analysis, how to read their data, and best practices.\r\n\r\n","persons":[{"id":938,"full_public_name":"Kirk Pepperdine","abstract":"Kirk co-found jClarity, a company building the next generation of application diagnostic tooling which was bought my Microsoft where he is now a Principle Engineer. He is the author of jPDM, a performance diagnostic model that help people to quickly identify the root cause of performance regressions.","twitter_name":"kcpeppe","avatar_path":"/system/avatars/938/large/kirk-thumb.jpg?1510757491"},{"id":2263,"full_public_name":"Monica Beckwith","abstract":"","twitter_name":"Mon_beck","avatar_path":"/system/avatars/2263/large/mb.jpeg?1570643123"}]},{"id":5139,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 5","title":"Memory Efficient Java","track":"Core Java","type":"lecture","abstract":"When developers and Operations are asked what their biggest performance bottleneck is, it’s rare that memory inefficiency comes up as an answer. Unfortunately, this runs counter to observations that 60% of all applications are memory-inefficient. Quite often this memory inefficiency hides as lower application throughput and longer, more frequent tail latency events, meaning that other things often take the blame. This session looks at the telltale signs that your application is in that 60% and the steps you can take to attack this problem.","persons":[{"id":938,"full_public_name":"Kirk Pepperdine","abstract":"Kirk co-found jClarity, a company building the next generation of application diagnostic tooling which was bought my Microsoft where he is now a Principle Engineer. He is the author of jPDM, a performance diagnostic model that help people to quickly identify the root cause of performance regressions.","twitter_name":"kcpeppe","avatar_path":"/system/avatars/938/large/kirk-thumb.jpg?1510757491"}]},{"id":4652,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 5","title":"Discover Modern Java","track":"Core Java","type":"lecture","abstract":"Java is moving faster and faster. A lot of features are not as known as they should be.\r\n\r\nLet's review together the old ones you missed.\r\n\r\nThen show you the ones you never had time to look at in 9, 10, 11, 12 and 13.\r\n\r\nAnd go crazy to check how it's implemented under the hood (yes, there will be bytecode).","persons":[{"id":901,"full_public_name":"Henri Tremblay","abstract":"Henri Tremblay is Java Champion. He leads EasyMock and Objenesis and contributes to Ehcache open source projects. When he was young, he made popular class mocking, invented partial mocking and was coding with pragmatism.","twitter_name":"henri_tremblay","avatar_path":"/system/avatars/901/large/profil1.png?1507666487"}]}],"Room 6":[{"id":5071,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 6","title":"The Reactive Revolution","track":"Frameworks","type":"lecture","abstract":"The reactive revolution continues. For as much as we've been talking about reactive programming in Spring for the last few years the journey has only just begun. Join me, Spring Developer Advocate Josh Long (@starbuxman), and we'll take our reactive applications further, looking at how to build microservices for cloud platforms like Pivotal Application Service (Cloud Foundry) and PKS (Kubernetes).\r\n\r\nSome of the things we may cover include:\r\n\r\nreactive NoSQL data access\r\nreactive SQL data access with R2DBC\r\norchestration and reliability patterns like client-side loadbalancing, circuit breakers, and hedging\r\nmessaging and service integration with Apache Kafka or RSocket\r\nAPI gateways with Spring Cloud Gateway and patterns like rate limiting and\r\nAPI adapters\r\nserverless programming with Spring Cloud Function and project Riff\r\nreactive authentication and authorization with Spring Security","persons":[{"id":1030,"full_public_name":"Josh Long","abstract":"Josh (@starbuxman) is the Spring Developer Advocate at Pivotal. Josh is a Java Champion, author of 5 books (including O'Reilly's Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry) and numerous best-selling video trainings (including Building Microservices with Spring Boot Livelessons with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring Integration, Spring Cloud, Activiti and Vaadin). \r\n","twitter_name":"starbuxman","avatar_path":"/system/avatars/1030/large/josh-1.jpg?1578266263"}]},{"id":4623,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 6","title":"Quarkus: Becoming Supersonic","track":"Frameworks","type":"lecture","abstract":"This session will introduce the attendee to Quarkus through developing an application that connects to a database and covers how reactive and imperative programming can co-exist.","persons":[{"id":2172,"full_public_name":"Ken Finnigan","abstract":"Ken works for Red Hat as an engineer and author focused on bringing developer joy to creating Microservices with Enterprise Java in the Cloud through Quarkus and Eclipse MicroProfile. ","twitter_name":"@kenfinnigan","avatar_path":"/system/avatars/2172/large/KenPicture.jpeg?1564599214"},{"id":912,"full_public_name":"Justin Lee","abstract":"Justin Lee is Principal Software Engineer at Red Hat, a Java Champion, and has been programming in Java since 1996.  He has worked on virtually every level of the application stack from database drivers all the way to application servers and front end interfaces.  A long time advocate of Java, he has spoken at conferences and user groups all across the US and Europe.  He is an active open source community member contributing when and where he can. He can be found on twitter and github as @evanchooly.","twitter_name":"evanchooly","avatar_path":"/system/avatars/912/large/JustinProfile.jpg?1524234804"}]},{"id":4838,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 6","title":"Spring Bananas From The Edge","track":"Frameworks","type":"lecture","abstract":"Have you ever wondered how much ambient radiation is in your home or workplace? OK ... probably not. But maybe you have thought, “How can I move processing of critical information closer to the edge?” Or perhaps you are now wondering what the “edge” is? In this talk, we will demonstrate how to move the processing of data from the cloud to the edge. Using Spring Cloud Stream, Spring Cloud Task, and Spring Cloud Data Flow, we will also show how to create streams that capture the existing data flows from our IOT Device and merge in the data from our new edge devices. And all instrument readings will be in bananas :-) instead of sieverts or rems.","persons":[{"id":699,"full_public_name":"Glenn Renfro","abstract":"As a Pivotal engineer, Glenn Renfro is a core committer for Spring Cloud Task, Spring Batch and Spring Cloud Data Flow. He has 14 years experience in designing, building and delivering enterprise level applications in Java and 21 years total of software development experience.","twitter_name":"cppwfs","avatar_path":"/system/avatars/699/large/glenn.jpeg?1504215166"},{"id":761,"full_public_name":"Roy Clarkson","abstract":"","twitter_name":"royclarkson","avatar_path":"/system/avatars/761/large/JSjo-fKP_400x400.jpg?1521070079"}]},{"id":4790,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 6","title":"Ready, Set, Golang!","track":"Frameworks","type":"lecture","abstract":"Go is a modern programming language that has been adopted by a large number of technologies companies for its speed and low memory consumption.A lot of favorites tools like Docker and Kubernetes are written in Go. Join me in this session to get a quick introduction to Go, it mains differences with Java and see some Go code in action.","persons":[{"id":2215,"full_public_name":"Orlando Valdez","abstract":"Orlando has been solving (and sometimes creating) problems with the help of technology for more than 15 years. He currently works at Credit Karma building software to help make financial progress possible for everyone. He co-leads the Charlotte JUG, occasional speaker, a proud father of 2 amazing girls, retro gamer and an expert fixing the router and printer at his parent's home.","twitter_name":"@orlandovaldez_","avatar_path":"/system/avatars/2215/large/DSC_1505_3s.jpg?1565826696"}]},{"id":4512,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 6","title":"Best Practices with Elasticsearch","track":"Frameworks","type":"lecture","abstract":"This talk will explore some of the differentiating and compelling features that Elasticsearch offers using real-world use-cases as examples. I will share best practices in the use of Elasticsearch in processing Big Data in ETL, centralized logging, and data visualization. I’ll also cover deploying and tuning Elasticsearch for high transaction volumes, fast query response times, fast inserts, and fault-tolerance.","persons":[{"id":1144,"full_public_name":"Roy Russo","abstract":"Roy Russo is the co-author of Elasticsearch in Action and CTO at Volantio. Before Volantio, Roy spent the last 4 years building a successful startup, Predikto, a big data predictive analytics company that was acquired by United Technologies in 2018.  Roy has held senior positions at several successful startups in Atlanta, and even cofounded and led one to acquisition in 2008. Roy is the founder of ElasticHQ.org - with over a million downloads, the most popular tool for managing and monitoring Elasticsearch clusters.\r\n","twitter_name":"","avatar_path":"/system/avatars/1144/large/Screen_Shot_2019-10-10_at_9.30.20_PM.png?1570756231"}]}],"Room 7":[{"id":4958,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 7","title":" Ten Cool Things you might not know about the OpenJDK Java Virtual Machine","track":"Java Platform","type":"lecture","abstract":"Everyone’s written Java Code, but not everyone has delved into the heart of the JVM. This talk will give you an overview of some of the JVM’s coolest features. Not a Java programmer, don’t worry terms like “compressed oops”, “tiered compilation”, and “dynamic class loading” will both be defined and then their implementation explored. Maybe you’ll find some inspiration for your own language runtime? Have any garbage collection questions?, Parallel, Concurrent, Low Latency, Why do we need so many? All will become clear. We’ll also take a sneak peak at Checkpoint/Restore, my current project which aims at decreasing memory usage and startup time.","persons":[{"id":2270,"full_public_name":"Christine H. Flood","abstract":"Christine H. Flood has worked on various programming languages over the years including Id, Lisp, Java and Fortress, but keeps coming back to Java.  ","twitter_name":"chf_the_grouch","avatar_path":"/system/avatars/2270/large/cf.jpeg?1570643173"}]},{"id":4493,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 7","title":"25+ recipes to use Optional Effectively which Is Not Optional","track":"Java Platform","type":"lecture","abstract":"In this session, we will learn how to use Optional class the way it was intended? Typically, we learn to use things by learning how to not use them, and this is our approach here. So, let's tackle this topic with 25+ recipes that try to address Optional in your code through an elegant and painless approach, and covers all enhancements added to it until Java 12 release.","persons":[{"id":886,"full_public_name":"Mohamed Taman","abstract":"Sr. Enterprise Architect @DevTech Beograd, Serbia, a Java Champion, an Oracle Groundbreaker Ambassador, Java/ Mobile/ Web / Big Data / Cloud / Blockchain (HashGraph) / DevOps Architect, JCP, Duke Award winner 3 times, International Speaker, Books & Videos Author","twitter_name":"@_tamanm","avatar_path":"/system/avatars/886/large/TamanM.jpg?1507547778"}]},{"id":4492,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 7","title":"Effective Java SE 9 through 14 APIs/Lang features, makes your life easier.","track":"Java Platform","type":"lecture","abstract":"Starting from Java SE 9+ which was a major release for the Java programming language and the Java virtual machine. And java works fast to cope with new technology era, and we see this every 6 months, Java SE 9-14 includes many changes, the library additions and the new language features we're going to look at here are all great, and they're very useful in your day-to-day work.\r\n\r\nSo, let’s take a tour of the new features in Java SE 14, powered by code, the platform designed to support faster learning, and more productive Java development.","persons":[{"id":886,"full_public_name":"Mohamed Taman","abstract":"Sr. Enterprise Architect @DevTech Beograd, Serbia, a Java Champion, an Oracle Groundbreaker Ambassador, Java/ Mobile/ Web / Big Data / Cloud / Blockchain (HashGraph) / DevOps Architect, JCP, Duke Award winner 3 times, International Speaker, Books & Videos Author","twitter_name":"@_tamanm","avatar_path":"/system/avatars/886/large/TamanM.jpg?1507547778"}]},{"id":5095,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 7","title":"This Ain’t Your Parents Java","track":"Java Platform","type":"lecture","abstract":"Java was once a language that dragged along and evolved at snails' pace. Thankfully, that's no longer the case. The recently years have seen accelerated development of both language features and JDK improvements. In this presentation we will dive into some of the recent changes of Java that are both fun and powerful to use and discuss where the language is heading in the near future.","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]},{"id":4937,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 7","title":"Improving Startup for Java Analytical Workload","track":"Java Platform","type":"lecture","abstract":"With more and more services running on the Cloud, improving the startup of Java applications is paramount. Java 8 and Java 11 introduced many new features, with AOT Compilation and AppCDS being two of the major ones geared towards startup performance.\r\nIn this talk, we'll explore what AOT Compilation brings to the Java developer, where it fits in the Code Generation pipeline, how to use it, where it works and where it doesn't.","persons":[{"id":2473,"full_public_name":"Ludovic Henry","abstract":"Ludovic Henry is a Runtime Engineer at Microsoft who worked on .NET (Mono and CoreCLR) and Java for the past 6 years. His focus has been on all Runtime related components, from JIT and AOT Compilers to Garbage Collectors, to Metadata and Class Loading, to integration to various platforms (Linux, macOS, Windows, Android, iOS, Consoles, WebAssembly, and others). He is currently working on the Java Platform team at Microsoft and strives to help all Java users by bringing ever more performance to their applications.","twitter_name":"","avatar_path":"/system/avatars/2473/large/ludovic.jpeg?1576034085"},{"id":2263,"full_public_name":"Monica Beckwith","abstract":"","twitter_name":"Mon_beck","avatar_path":"/system/avatars/2263/large/mb.jpeg?1570643123"}]}],"Room 8":[{"id":4419,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 8","title":"Human Readable Javascript","track":"JavaScript","type":"lecture","abstract":"Love JavaScript? Awesome! Hate JavaScript? That's ok! We know that JavaScript hasn't been very easy to read in the past, lots of dollar signs and slick one-liners. \r\nThe good news is that things have gotten better! In this talk we'll look at some of the syntax ES2015+ introduced to help us write more readable code for our coworkers and our future selves.","persons":[{"id":1209,"full_public_name":"Laurie Barth","abstract":"Laurie is a Staff Software Engineer on the GatsbyJS Learning Team as well as a conference speaker, egghead instructor and member of the TC39 Educators committee. As a technical blogger, Laurie is a contributor to various publications, including CSS Tricks and Smashing Magazine. When she isn't writing code you can find her playing board games and eating cupcakes with her puppy, Avett.","twitter_name":"laurieontech","avatar_path":"/system/avatars/1209/large/KCDCheadshots0052_copy.jpg?1557499320"}]},{"id":4545,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 8","title":"The Talking App: An introduction to developing Alexa skills","track":"JavaScript","type":"lecture","abstract":"In this example-driven session, we'll explore the Alexa Skills Kit (ASK) and see how to develop skills for Amazon's Alexa. You'll learn how to use the ASK CLI to jumpstart skill development and how to create conversational applications in NodeJS. We’ll also explore techniques for integrating your Alexa skill with a backend Spring application.","persons":[{"id":1083,"full_public_name":"Craig Walls","abstract":"Spring Developer and a author of Spring in Action.","twitter_name":"habuma","avatar_path":"/system/avatars/1083/large/247032_10150611073575580_4897903_n.jpg?1511136831"}]},{"id":4659,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 8","title":"Adventures in TensorFlow.js","track":"JavaScript","type":"lecture","abstract":"AI/ML has revolutionized the world of what is possible, and TensorFlow.js is revolutionizing the domain of where we can bring these new capabilities.  Google implemented over 4,000 tensor models in production in 2017. The future of software will be filled with amazing new Machine Learning, so let's get creating!","persons":[{"id":471,"full_public_name":"Gant Laborde","abstract":"Inspirational technology strategist.  Tinkerer at heart, but with a passion to ship a quality product at the end.  Love leadership and teaching has driven me to many conferences worldwide.","twitter_name":"gantlaborde","avatar_path":"/system/avatars/471/large/gant-face.jpg?1484858603"}]},{"id":4520,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 8","title":"Vanilla.js: Modern 1st Party JavaScript","track":"JavaScript","type":"lecture","abstract":"JavaScript has conquered the world by attaching itself to the browser to deliver front-end experiences over the web. Built in a few short weeks to simply glue objects in web pages, the latest versions support modern concepts like classes and challenge traditional notions of scope. Learn how far JavaScript has come by reviewing the latest language features and seeing just what is possible to build with pure \"vanilla\" JavaScript. No frameworks, just code.","persons":[{"id":2151,"full_public_name":"Jeremy Likness","abstract":"Jeremy Likness is an internationally-selling author, keynote speaker and professional coder with a personal mission to empower developers to be their best. He has worked on commercial enterprise software for 25 years and specializes in web technology. Jeremy is a cloud advocate for Microsoft and lives with his wife, parrot, and German Shepherd near Seattle, WA. In his free time he enjoys running, hiking, and shooting 9-ball and one pocket.","twitter_name":"@JeremyLikness","avatar_path":"/system/avatars/2151/large/author.png?1563575590"}]},{"id":4961,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 8","title":"Fast PWAs With Angular","track":"JavaScript","type":"lecture","abstract":"You’ve heard about PWAs, but how do you actually go about making one? Come learn about all the available tools and techniques to make fast and engaging PWA.","persons":[{"id":439,"full_public_name":"Mike Hartington","abstract":"Mike is a Developer on the Ionic Framework team, as well as a GDE in Angular, Web Technologies, and Firebase. Aside from technologies, Mike loves a good beer and building cool things.","twitter_name":"mhartington","avatar_path":"/system/avatars/439/large/mike-headshot-2.png?1544211553"}]}],"Room 9":[{"id":4689,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 9","title":"An Introduction to Kotlin","track":"JVM Languages","type":"lecture","abstract":"Kotlin has been catching on lately as an alternative to Java because of its null safety guarantees, type inference, cross-platform support, and ease of use with Android and Spring. Not to mention the fact that it is fully interoperable with Java. Is this something you and your team should considering spending time to learn? Come to this session for an overview of Kotlin intended for Java developers. We will go over the major language features, syntax, and the Kotlin ecosystem so you'll know enough to make your own decisions by the end. You will come away from this session with enough knowledge to decide if this is something you and your team should consider adopting.","persons":[{"id":701,"full_public_name":"Todd Ginsberg","abstract":"Todd Ginsberg is a Principal Software Developer at Netspend, a payments company in Austin, TX where he is responsible for prototypes, experiments, and proofs of concept. Todd has been writing in Java since 1995, Kotlin since 2016, and is a board member of the Chicago Java User Group. Todd lives in Dallas, TX with his wife, and two dogs. When not programming, he enjoys reading, walking/hiking, and doughnuts.","twitter_name":"toddginsberg","avatar_path":"/system/avatars/701/large/Todd_2019_500x500.jpg?1574782459"}]},{"id":5094,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 9","title":"Exploring Collectors: One of the Most Powerful Utility Class in the JDK","track":"JVM Languages","type":"lecture","abstract":"One of the most intriguing classes in the JDK is the Collectors utility class, with a collection of some highly powerful functions that are useful during the reduce operation of streams. The functions that are in this class have so much to offer and yet, due to their complex nature, often are not used as much as they should be. Using well defined live coded examples, we will take up several common programming problems. Discuss them quickly and drive the implementation of these using the Collectors' methods. By the end of this presentation you will know more throughly the power of Collectors and how to apply the methods in there.","persons":[{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"}]},{"id":4927,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 9","title":"Property-Based Testing in Java","track":"JVM Languages","type":"lecture","abstract":"Property-Based Testing is a technique that creates random samplings of data and throttles your Subject Under Tests. ","persons":[{"id":1080,"full_public_name":"Daniel Hinojosa","abstract":"Daniel Hinojosa is a programmer, consultant, instructor, speaker, and author. With over 20 years of experience, he does work for private, educational, and government institutions","twitter_name":"dhinojosa","avatar_path":"/system/avatars/1080/large/kvuYjMde_400x400.jpg?1511203285"}]},{"id":4426,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 9","title":"Functional Programming in Java, Groovy, and Kotlin","track":"JVM Languages","type":"lecture","abstract":"See how features of functional programming are implemented in three different JVM-based languages. Examples include how lambda expressions, method references, and streams are handled differently, as well as higher-order functions, closure composition, trampolining, currying, tail recursion, and more.","persons":[{"id":1078,"full_public_name":"Kenneth Kousen","abstract":"Ken Kousen is a Java Champion, Oracle Groundbreaker Ambassador, and Grails Rock Star, and the author of the books Kotlin Cookbook (O'Reilly), Modern Java Recipes (O'Reilly), Gradle Recipes for Android (O'Reilly), and Making Java Groovy (Manning). He is a regular speaker on the No Fluff, Just Stuff Tour, and teaches training classes in areas related to Java, including Spring, Hibernate/JPA, Groovy, Grails, Gradle, and Android.","twitter_name":"kenkousen","avatar_path":"/system/avatars/1078/large/kousen_sep2019_medium.jpg?1573349579"}]},{"id":4928,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 9","title":"Kafka Streams and KSQL","track":"JVM Languages","type":"","abstract":"Kafka is more than just a messaging queue with storage. It goes beyond that and with technology from Confluent open source it has become a full-fledged data ETL and data streaming ecosystem.","persons":[{"id":1080,"full_public_name":"Daniel Hinojosa","abstract":"Daniel Hinojosa is a programmer, consultant, instructor, speaker, and author. With over 20 years of experience, he does work for private, educational, and government institutions","twitter_name":"dhinojosa","avatar_path":"/system/avatars/1080/large/kvuYjMde_400x400.jpg?1511203285"}]}],"Room 10":[{"id":5494,"date":"2020-02-20T08:00:00-05:00","start":"08:00","duration":"00:50","room":"Room 10","title":"Women in Tech Breakfast at DevNexus","track":"Open Java","type":"lecture","abstract":"Join us\r\nfor the annual Women in Tech Breakfast at DevNexus.  We'll\r\ndiscuss \"the pipeline problem,\" common obstacles, and proven\r\nstrategies to succeed with our panelists: Emily\r\nJiang and Ixchel\r\nRuiz.\r\n\r\nWe've all\r\nheard buzz around the \"pipeline\" and how this affects diversity in\r\nour workplaces.  What are your experiences? What worked for\r\nyou? Are you thinking about a career move but not acting on\r\nit?  Are you afraid to talk about work life balance? Are you\r\nin the right workplace, utilizing your full potential?  What's\r\nholding you back? \r\n\r\nIn the\r\nmulti-part breakfast, we'll..\r\n Break down some data about YOU--the\r\nwomen in the room\r\nChallenge each other to actively take part in the conversation\r\nHear from our panelists and others who have conquered that fear, that challenge\r\nStart the\r\nchange today.  ","persons":[{"id":2141,"full_public_name":"Mala Gupta","abstract":"Developer Advocate at JetBrains. Java Champion and author of multiple books on Java Certifications with Manning Publications. Believes in learning everyday.","twitter_name":"@eMalaGupta","avatar_path":"/system/avatars/2141/large/Mala.png?1562334338"},{"id":2235,"full_public_name":"Ixchel Ruiz ヾ(＾-＾)ノ","abstract":"Ix-chel Ruiz has developed software application & tools since 2000. Her research interests include Java, dynamic languages, client-side technologies and testing. Java Champion, Oracle Developer Champion, hackergarten enthusiast, Open Source advocate, public speaker and mentor.\r\n\r\nThe highest education is that which does not merely give us information but makes our life in harmony with all existence.\r\nRabindranath Tagore","twitter_name":"ixchelruiz","avatar_path":"/system/avatars/2235/large/ir.jpeg?1570642885"},{"id":817,"full_public_name":"Emily Jiang","abstract":"Emily Jiang is a Java Champion. She is Liberty Microservices Architect and Advocate, STSM in IBM, based at Hursley Lab in the UK. Emily is a senior MicroProfile lead and has been working on MicroProfile since 2016 and leads the specifications of MicroProfile Config, Fault Tolerance and Service Mesh. She is CDI Expert Group member.\r\n\r\nShe has worked on the WebSphere Application Server since 2006 and is heavily involved in Java EE and MicroProfile implementation in Liberty releases. \r\n\r\nShe regularly speaks at conferences, such as Code One, DevNexus, JAX London, Voxxed, Devoxx US, Devoxx Belgium, Devoxx UK, Devoxx France, EclipseCon, etc. Follow her on Twitter @emilyfhjiang and/or connect with her on LinkedIn (https://www.linkedin.com/in/emily-jiang-60803812/).\r\n","twitter_name":"emilyfhjiang","avatar_path":"/system/avatars/817/large/Emily-photo.png?1565795958"}]},{"id":4668,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 10","title":"How To Choose A JDK","track":"Open Java","type":"lecture","abstract":"The license for the Oracle JDK has changed since JDK 11 and also affects updates to JDK 8 since January 2019. The Oracle JDK is no longer free for use in production. There are now OpenJDK builds available from a selection of providers, both free and with commercial support. In this session, we'll help you understand the questions you should ask to decide which is the best JDK for your deployments.","persons":[{"id":1504,"full_public_name":"Simon Ritter","abstract":"Simon Ritter is the Deputy CTO of Azul Systems.  Simon joined Sun Microsystems in 1996 and spent time working in both Java development and consultancy.  He has been presenting Java technologies to developers since 1999 focusing on the core Java platform.","twitter_name":"speakjava","avatar_path":"/system/avatars/1504/large/SimonRitter-04A-SQ.jpg?1536327466"}]},{"id":4747,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 10","title":"AdoptOpenJDK Quality Assurance (AQA)","track":"Open Java","type":"lecture","abstract":"With the proliferation of OpenJDK binaries for a business to choose from, one factor in determining the selection is quality.  How do you know your choice is up to snuff? AdoptOpenJDK Quality Assurance (AQA) is an open and transparent verification story for OpenJDK binaries.  A robust and adaptable test kit that can be utilized by any OpenJDK implementor, and represents the quality bar required by large-scale customers in enterprise environments.  We test multiple freely available JDK implementations at AdoptOpenJDK and continue to refine this suite of tests to give the community access to high-quality binaries.","persons":[{"id":2191,"full_public_name":"Shelley Lambert","abstract":"Shelley Lambert is the Test Lead for the IBM Runtime Technologies team. She and her team test open and freely available JDK implementations and have delivered the test strategy, test code base, and test frameworks into the Eclipse OMR, Eclipse OpenJ9 and AdoptOpenJDK projects. She is a Technical Steering Committee member and committer at AdoptOpenJDK and committer at OpenJ9 and draws stories and lessons from her experiences in these open projects where she is most active.","twitter_name":"@ShelleyMLambert","avatar_path":"/system/avatars/2191/large/sl.jpeg?1570755694"}]},{"id":4682,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 10","title":"An Open Future for Java in the Cloud","track":"Open Java","type":"lecture","abstract":"What’s the future for Java? Is it open, safe & evolving or just becoming irrelevant?. Hear about the transformations that are being driven by cloud that makes it an exciting time and a scary one too. ","persons":[{"id":816,"full_public_name":"Steve Poole","abstract":"Steve Poole is a Developer Advocate, DevOps practitioner  and a long time IBM Java developer, leader and evangelist. He’s been working on Java SDKs and JVMs since Java was less than one year old. ","twitter_name":"spoole167","avatar_path":"/system/avatars/816/large/icon.png?1565420763"}]},{"id":4876,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 10","title":"Quarkus in Real-World Deployments","track":"Open Java","type":"lecture","abstract":"Learn about our experiences about Quarkus running in Production.","persons":[{"id":2475,"full_public_name":"Bruno Baptista","abstract":"Tech Lead Engineer at Talkdesk\r\nMember of MicroProfileIO, coimbrajug, ApacheTomEE contributor. \r\nCo-founder and organizer jnationconf.","twitter_name":"brunobat_","avatar_path":"/system/avatars/2475/large/bb_jnation_512.png?1576099382"},{"id":2247,"full_public_name":"Roberto Cortez","abstract":"Passionate Developer, Blogger, Youtuber, Speaker, Triber, JUG Leader, Java Champion","twitter_name":"radcortez","avatar_path":"/system/avatars/2247/large/radcortez-high.jpg?1565911635"}]},{"id":4840,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 10","title":"It's always sunny with OpenJ9","track":"Open Java","type":"lecture","abstract":"So you've been deploying Java in the cloud and are wondering how to handle the new world of containers, microservices, and memory constraints.  Cold starts got you down?  Come to this session to learn about how the OpenJ9 and the JVM in general can help you on your Cloud Native journey.","persons":[{"id":1612,"full_public_name":"Dan Heidinga","abstract":"Dan Heidinga is an Eclipse OpenJ9 project lead while also leading IBM's J9 VM Interpreter team.  He has been involved with virtual machine development since 2007 and has represented IBM on multple JSRS include JSR 292 ('invokedynamic') and JSR 335 ('lambda').  He has his hands in most new JVM features and all major Java releases. In the past he's spent entirely too long staring at Java bytecode while maintaining the verifier and still enjoys an occasional detour into Smalltalk development.  As of this year, he's also an CodeOne Rockstar.","twitter_name":"@DanHeidinga","avatar_path":"/system/avatars/1612/large/DanHeidinga_resized.png?1542835022"}]}],"Room 11":[{"id":4417,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 11","title":"Deconstructing Deep Learning","track":"Practices and other tech","type":"lecture","abstract":"In this session you'll get a mathematics and jargon free introduction to Deep Learning by examining two very different types of Artificial Neural Network.","persons":[{"id":740,"full_public_name":"Mark West","abstract":"Hacker, Norwegian JUG Leader, Data Scientist, Father.","twitter_name":"markawest","avatar_path":"/system/avatars/740/large/headshot.jpg?1561986092"}]},{"id":4804,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 11","title":"Seven Principles of Productive Software Developers","track":"Practices and other tech","type":"lecture","abstract":"When working as a software developer, as well as in any other job, it’s important to be productive and to get things done. You want to focus on what adds value, increase your development speed, and cut out as many of the cumbersome, boring and repetitive tasks as possible.","persons":[{"id":882,"full_public_name":"Sebastian Daschner","abstract":"Sebastian Daschner is a Java Developer Advocate at IBM, a consultant, author, and trainer. He is the author of the book ‘Architecting Modern Java EE Applications’. Sebastian is participating in the JCP, helping forming the future standards of Java EE, serving in the JAX-RS, JSON-P and Config Expert Groups and collaborating on various open source projects. For his contributions in the Java community and ecosystem he was recognized as a Java Champion, Oracle Developer Champion and double 2016 JavaOne Rockstar. Besides Java, Sebastian is also a heavy user of Linux and cloud native technologies. He evangelizes computer science practices on https://blog.sebastian-daschner.com, his newsletter, and on Twitter via @DaschnerS. When not working with Java, he also loves to travel the world — either by plane or motorbike.","twitter_name":"@DaschnerS","avatar_path":"/system/avatars/882/large/sebastian4.jpg?1536818345"}]},{"id":4956,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 11","title":"Don't make me think: UX and QA","track":"Practices and other tech","type":"lecture","abstract":"UX is becoming more and more important these days. Quality Assurance analyst role is evolving to include user experience and usability tests. This talk explains the user from a quality assurance perspective and user personas.","persons":[{"id":679,"full_public_name":"Daneez Owais","abstract":"I am a quality assurance enthusiast and have 11+ years experience! I love and breath testing and love to share my experiences with other people. What is Software Testing and the do’s and don’t’s of testing? This session will comprise of an interactive demonstration of how QA engineers think. Attendees will be asked to pick out the faults in certain slides. They will leave with an understanding of the different types of testing QA does.","twitter_name":"@daneezo","avatar_path":"/system/avatars/679/large/Daneez_GDI.png?1502718181"}]},{"id":4762,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 11","title":"Moving on up. The secret sauce to continue to grow in your career.","track":"Practices and other tech","type":"lecture","abstract":"Are you a Junior Developer aspiring to grow but don't know how? Or a dev that has stayed in their role for a little bit too long and wondering how to take that \"next step?\". Well, wonder no-more! In this session we go over advice on how to grow as a career dev, from leadership (and what shape that takes for an Engineer), to the difference between visibility and impact, to impostor syndrome and more. \r\n","persons":[{"id":843,"full_public_name":"Freddy Guime","abstract":"Freddy is a Principal Developer at Expedia. Always dealing with performance and usability he is always curious on how to make the overabundance of data useful for travelers, traders and consumers. Having worked with different technologies before has allowed him to come with solutions to rendering bottleneck problems. A Usability Guru, Freddy understands and bridges the concepts of high-throughput with usability within software. He is also the author and maintainer of the javapubhouse.com, a podcast dedicated to tutorial topics in Java that covers everything from the use of the keyword volatile to the definition of beautiful code, also of javaoffheap.com, a java news podcast.","twitter_name":"fguime","avatar_path":null}]},{"id":4893,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 11","title":"Application Bugs Sucking the Fun out of Life?","track":"Practices and other tech","type":"lecture","abstract":"Let’s face it, the pace at which we must deliver code is getting out of control. Business expects features yesterday, architecture expects everything to be modular and deployable in containers, and you spend half your day dealing with production issues (all hours of the day). There are only 24 hours in a day and it feels like you have to work 30 of them to keep from drowning. Is there any time for you to have a life? \r\n\r\nThe good news is there is a better way. In this talk attendees will learn techniques for identifying new & critical issues before they get to production; and if they do get to production, how to quickly identify and resolve them before they become a Sev1. You will learn how to get your life back!","persons":[{"id":1541,"full_public_name":"Eric Mizell","abstract":"Eric is the VP of Solution Engineering at OverOps. Prior to his role at OverOps, Eric served as VP of Global Solution Engineering at Kinetica, Director of Solution Engineering for Hortonworks, and Director of Field Engineering and Solutions Architect for Terracotta. He also previously held positions in systems and software engineering at McCamish Systems and E/W Group.  ","twitter_name":"","avatar_path":"/system/avatars/1541/large/em.jpeg?1570640886"}]}],"Room 12":[{"id":4602,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 12","title":"Authorization, Access Control and Microservices","track":"Security","type":"lecture","abstract":"Authorization in a microservice architecture often gets the least love; as a result it is usually half baked. Many people believe that once they implement OAuth, all their problems are solved; just pass around the access token between the microserices. In truth, OAuth is only half the solution: while OAuth is great for coarse grained authorization datam, it is ill-suited for policy based access control decisions. I’ll discuss the pain of our legacy “access control in code” approach that led to building a true Policy Server based on Open Policy Agent. This talk will open your eyes to a more complete understanding of authorization, and especially access control, in a microservice architecture. ","persons":[{"id":818,"full_public_name":"Yoel Spotts","abstract":"Yoel Spotts is Director of Platform Architecture at Ware2Go, based in Atlanta. Holding degrees in Computer Science and Talmudic Law, he has 20 years of programming experience. A big fan of the JVM, Yoel has worked in Java, Groovy and Scala. No stranger to DevNexus or public speaking, Yoel attended the very first DevNexus (back before it was called DevNexus) and has presented several times in the past. When not building great software or trying to avoid learning JavaScript, Yoel enjoys hiking and spending time with his family.","twitter_name":"","avatar_path":"/system/avatars/818/large/Experience_032.jpg?1511108826"}]},{"id":5084,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 12","title":"Defense Against Common Security Threats","track":"Security","type":"lecture","abstract":"When thinking about application security, authentication and authorization are usually at the forefront, but can that keep your application safe?\r\nWhile both authentication and authorization are important steps to securing your application, there are many other considerations when it comes to overall security.\r\nThis talk will focus on application vulnerabilities, by demonstrating an attack that may occur and how to protect against the attack by leveraging Spring Security.","persons":[{"id":2322,"full_public_name":"Eleftheria Stein-Kousathana","abstract":"Eleftheria is a software engineer on the Spring Security team at Pivotal. Prior to joining the Spring team, Eleftheria was a part of Pivotal Labs, where she worked alongside many software companies to build and deliver applications across a variety of industries.","twitter_name":"","avatar_path":"/system/avatars/2322/large/esk.jpeg?1570643499"}]},{"id":4546,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 12","title":"Ethical hacking - The Culture for the Curious ","track":"Security","type":"lecture","abstract":"In today's tech-driven world, we are more vulnerable to hacking than you could imagine. It is important we are equipped with at least some knowledge of what we are up against. \r\n\r\nForewarned is pre-armed so will take you guys though very common web vulnerabilities, that you wouldn't have even was that simple and that possible. Will be giving a getting-to-know Ethical Hacking session. Which all could help you identify and secure against potential security threats. Skills required for EH to the Tools available. The process and phases of hacking. And some action.","persons":[{"id":1568,"full_public_name":"Jayashree S Kumar","abstract":"Staff Software Engineer at IBM's India Software Labs\r\nIBM Java Classes Library developer with Runtimes team at IBM Software Labs and current efforts are focused on fixing customer reported issues and security gaps on IBM Java Runtimes. In a career spanning over 8 years, extensively worked on IBM JDK’s Testing - Performance, Compliance and System verification, A Tester by the heart through and through. Likes to write up disclosures and know-how. In free time likes to browse when not running behind her toddler.","twitter_name":"@Jshreesk","avatar_path":"/system/avatars/1568/large/20181105_120411.jpg?1565767916"}]},{"id":4678,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 12","title":"How to get along with HATEOAS without letting the bad guys steal your lunch?","track":"Security","type":"lecture","abstract":"It’s a cool idea - decouple the client from the server and let the application tell the client what it can do dynamically. This approach should allow much more flexibility and resilience as the client and server can evolve separately. Unfortunately, the HATEOAS approach can be a free lunch for cybercriminals unless you understand the simple steps needed to secure your design.","persons":[{"id":816,"full_public_name":"Steve Poole","abstract":"Steve Poole is a Developer Advocate, DevOps practitioner  and a long time IBM Java developer, leader and evangelist. He’s been working on Java SDKs and JVMs since Java was less than one year old. ","twitter_name":"spoole167","avatar_path":"/system/avatars/816/large/icon.png?1565420763"},{"id":815,"full_public_name":"Graham Charters","abstract":"Graham is a (fairly ancient) Architect and IBM Senior Technical Staff Member now focusing on developer advocacy for Open Liberty at IBM's R&D Laboratory in Hursley, UK. He takes a keen interest in emerging technologies and practices and in particular programming models. His past exploits include establishing and contributing to open source projects at PHP and Apache and participation in, and leading, industry standards.","twitter_name":"@gcharters","avatar_path":"/system/avatars/815/large/charters-grey-220x220.jpg?1506593614"}]},{"id":4698,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 12","title":"10 Java Security Practices They Didn't Teach You In School","track":"Security","type":"lecture","abstract":"Software security breaches are rising to an alarming rate. As a Java developer, you should be aware of how important security in your applications is. In this session, we will provide you with the top 10 security best practices for Java developers. Reviewing the OWASP top 10 and how this augments Java development for better security. By showing the actual problems and how you can protect yourself during your daily Java development, you will have a better understanding of why and how security focus is essential.\r\n","persons":[{"id":1037,"full_public_name":"Brian Vermeer","abstract":"Developer Advocate for Snyk and Software Engineer with over 10 years of hands-on experience in creating and maintaining software. He is passionate about Java, (Pure) Functional Programming and Cybersecurity. Brian is an Oracle Groundbreaker Ambassador, Utrecht JUG Co-lead, Virtual JUG organizer and Co-lead at TheSecureDeveloper. He is a regular international speaker on mostly Java-related conferences like JavaOne, Oracle Code One, Devoxx BE, Devoxx UK, Jfokus, JavaZone and many more. Besides all that Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher.","twitter_name":"BrianVerm","avatar_path":"/system/avatars/1037/large/1569586529926_fact_1.jpg?1570377740"}]}],"Room 13":[{"id":4654,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 13","title":"Docker for Developers","track":"Tools and techniques","type":"lecture","abstract":"A hands-on demonstration of the basics that developers need to know to use Docker in their development environment so that when they deploy the container to production, the environment is the same. This cuts down on the \"It works on my machine\" bugs.","persons":[{"id":807,"full_public_name":"Brian Demers","abstract":"Brian Demers is a Developer Advocate at Okta and a PMC member for the Apache Shiro project. He spends much of his day contributing to OSS projects in the form of writing code, tutorials, blogs, and answering questions. Along with typical software development, Brian also has a passion for fast builds and automation.\r\n\r\nAway from the keyboard, Brian is a beekeeper and can likely be found playing board games. You can find him on Twitter at https://twitter.com/briandemers. ","twitter_name":"BrianDemers","avatar_path":"/system/avatars/807/large/gravatar.jpeg?1566324963"}]},{"id":5058,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"00:50","room":"Room 13","title":"Your Tests Lack Vision","track":"Tools and techniques","type":"lecture","abstract":"Learn how automated visual validation works, see a live integration into an existing test code base, and discuss the pros and cons of using various visual validation techniques.","persons":[{"id":2296,"full_public_name":"Angie Jones","abstract":"Angie Jones is a Senior Developer Advocate who specializes in test automation strategies and techniques. She shares her wealth of knowledge by speaking and teaching at software conferences all over the world, writing tutorials and technical articles on angiejones.tech, and leading the online learning platform, Test Automation University.","twitter_name":"techgirl1908","avatar_path":"/system/avatars/2296/large/angie-jones-headshot.jpg?1567020786"}]},{"id":5048,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 13","title":"Thinking about Systems","track":"Tools and techniques","type":"lecture","abstract":"In this session we will take a page from Donella H. Meadows fantastic book \"Thinking in Systems\" and attempt to get an understanding of what makes up a system, how we can tease apart the moving parts of the system, and get into the mindset of a \"systems thinker\".","persons":[{"id":115,"full_public_name":"Raju Gandhi","abstract":"I am a Software Craftsman with over a decade of experience building Web Applications and Enterprise Software and I love to build great software","twitter_name":"looselytyped","avatar_path":"/system/avatars/115/large/me2_400x400.png?1409064068"}]},{"id":4781,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 13","title":"Supercharge your Code to Get Optimal Database Performance","track":"Tools and techniques","type":"lecture","abstract":"Everybody agrees that programming languages are lightning-fast and powerful. Yet performance quickly hits a bottleneck when a database is part of the stack. For years and years, databases have been seen as the slow, monolithic back ends that limit your application's throughput. Yet the reality is that most of the time, it is the code interacting with the database that limits your throughput. Autocommit, too many network round-trips, doing unnecessary work are just some of the culprits that will limit your throughput. Yet all of those can easily be avoided with some simple tricks and refactoring of your code. In this session, learn how to apply tricks that will supercharge your application. Never wait for a reply from your DBA again.","persons":[{"id":1434,"full_public_name":"Gerald Venzl","abstract":"Common-Sense Developer, Oracle Expert, Performance Enthusiast, Technology Geek and Creator of csv2db","twitter_name":"GeraldVenzl","avatar_path":"/system/avatars/1434/large/Bio2.jpg?1536189679"}]},{"id":4825,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 13","title":"Designing functional and fluent API: application to some GoF Patterns","track":"Core Java","type":"other","abstract":"Among the patterns from the GoF, the Visitor is probably the more complex to implement. One of the difficulties is that you need to implement it in your object model, leading to complex refactoring for legacy applications. Based on the use of all the nifty tools brought by functional programming: chaining, composition, and partial application, you can implement Visitors without having to change your object model, using a functional and fluent API. This approach can be used to implement other patterns: Builder and Validator. Using this way of designing API leads to readable and robust code, designed following the GoF patterns. Live examples will be shown using Java lambdas. ","persons":[{"id":2234,"full_public_name":"José Paumard","abstract":"José is a developer, architect, application designer and instructor with 20 years experience in Java technologies and software craftsmanship. He is an assistant professor in Paris. He is a recognized expert, Java Champion and Java Rockstar. His recent work includes kata design in software craftsmanship, fluent API design using Java lambda expressions and streams. He is also passionate by online education, creating courses available on Pluralsight and YouTube.","twitter_name":"@JosePaumard","avatar_path":"/system/avatars/2234/large/apple-2014-300.png?1565874174"}]}],"Room 14":[{"id":4519,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 14","title":"WebAssembly for Modern Cross-Platform Web Development","track":"Web and Front-end","type":"lecture","abstract":"WebAssembly quietly reached stable production status in 2017 and is rapidly taking front-end web development by storm. Learn what this stack-based virtual machine can do, why it is becoming so popular, and how to build front end web experiences using a varierty of modern languages. Examples in C, Rust, Go, and C#.","persons":[{"id":2151,"full_public_name":"Jeremy Likness","abstract":"Jeremy Likness is an internationally-selling author, keynote speaker and professional coder with a personal mission to empower developers to be their best. He has worked on commercial enterprise software for 25 years and specializes in web technology. Jeremy is a cloud advocate for Microsoft and lives with his wife, parrot, and German Shepherd near Seattle, WA. In his free time he enjoys running, hiking, and shooting 9-ball and one pocket.","twitter_name":"@JeremyLikness","avatar_path":"/system/avatars/2151/large/author.png?1563575590"}]},{"id":4837,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 14","title":" PWA in practice","track":"Web and Front-end","type":"lecture","abstract":"Learn what it takes to build an installable full-stack PWA with authentication and offline capabilities.","persons":[{"id":531,"full_public_name":"Marcus Hellberg","abstract":"Marcus Hellberg is a developer advocate at Vaadin. He works with modern web technologies like Web Components and Progressive Web Applications. His background is in embedded systems but has worked on everything web related for the past 11+ years. ","twitter_name":"marcushellberg","avatar_path":"/system/avatars/531/large/MarcusHellberg-square.jpeg?1492464669"}]},{"id":4699,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 14","title":"Kicking Butt with Vue.js","track":"Web and Front-end","type":"lecture","abstract":"Vue.js is rapidly becoming one of the most popular JavaScript frameworks due to it's ease of use and focus on productivity. I'll show you how to get started and where to go next to learn more.","persons":[{"id":329,"full_public_name":"Raymond Camden","abstract":"Raymond Camden is a Lead Developer Evangelist for HERE. He works on maps, geospatial stuff, JavaScript, and enterprise cat demos. He is the author of multiple books on web development and has been actively blogging and presenting for almost twenty years. Raymond can be reached at his blog (www.raymondcamden.com), @raymondcamden on Twitter, or via email at raymondcamden@gmail.com.","twitter_name":"raymondcamden","avatar_path":"/system/avatars/329/large/raymond-camden.jpg?1559660223"}]},{"id":4594,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 14","title":"You're a Designer; I Promise","track":"Web and Front-end","type":"lecture","abstract":"Too many developers think they can never learn to design. While it may be true that you’ll never be a master graphic artist, there are tons of tips and tricks to make sure your application or website looks professionally designed. In this talk, we’ll cover the basics of good design, view examples of both good and bad design and discuss how to incorporate design thinking into your development process. Attendees will walk away with practical knowledge to start applying to current and future projects.","persons":[{"id":1405,"full_public_name":"Bryan Robinson","abstract":"Bryan has been creating hand-crafted experiences on the web his entire career. His experience spans from large content-driven news sites to boutique designs for small to medium businesses.","twitter_name":"brob","avatar_path":"/system/avatars/1405/large/br.jpeg?1570639601"}]},{"id":4613,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 14","title":"Developers: Why Care About the User?","track":"Web and Front-end","type":"lecture","abstract":"As developers, we deal with technologies, frameworks, and data, making it very easy to forget that what we create is meant for real people to use. While designers and UI specialists should handle most decisions about how a product or service looks and feels, we should all be on the same page to make better solutions. Whether we are building an interface for a desktop website, mobile application, or chatbot, what are some basic design concepts that we as developers can pick up, allowing us to be on the same page with designers and product owners during product meetings and discussions?","persons":[{"id":201,"full_public_name":"Andrew Malek","abstract":"Andrew is a Sr. UI developer and designer at NCR, focusing on POS (point-of-sale) and clienteling solutions. He has two decades of development experience in languages such as JavaScript, Visual Basic, Python, and C, and will admit to having developed a content management solution with Delphi and Perl if backed into a corner.","twitter_name":"malekontheweb","avatar_path":"/system/avatars/201/large/2018-connect-tech.jpg?1572485717"}]}],"Room 15":[{"id":5461,"date":"2020-02-20T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 15","title":" Reactive Microservice in Action","track":"Unobtanium","type":"lecture","abstract":"After creating your first microservice and putting it into production, you heard a lot of people talking about reactive. You'd like to find out more about reactive and have several questions: Why should I care? What I can do to make my microservice reactive, nonblocking? How can I use CompletionStage in my microservices? Should I consider using Reactive Streams? Come to this session to find out what reactive means. It explains reactive programming and then Reactive Streams, followed by a demo of using MicroProfile Fault Tolerance, MicroProfile Reactive Streams Operators, and MicroProfile Reactive Messaging to create a truly reactive microservice and integrate with Kafka.","persons":[{"id":817,"full_public_name":"Emily Jiang","abstract":"Emily Jiang is a Java Champion. She is Liberty Microservices Architect and Advocate, STSM in IBM, based at Hursley Lab in the UK. Emily is a senior MicroProfile lead and has been working on MicroProfile since 2016 and leads the specifications of MicroProfile Config, Fault Tolerance and Service Mesh. She is CDI Expert Group member.\r\n\r\nShe has worked on the WebSphere Application Server since 2006 and is heavily involved in Java EE and MicroProfile implementation in Liberty releases. \r\n\r\nShe regularly speaks at conferences, such as Code One, DevNexus, JAX London, Voxxed, Devoxx US, Devoxx Belgium, Devoxx UK, Devoxx France, EclipseCon, etc. Follow her on Twitter @emilyfhjiang and/or connect with her on LinkedIn (https://www.linkedin.com/in/emily-jiang-60803812/).\r\n","twitter_name":"emilyfhjiang","avatar_path":"/system/avatars/817/large/Emily-photo.png?1565795958"}]},{"id":4755,"date":"2020-02-20T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 15","title":"Runtime Security for Containers","track":"Unobtanium","type":"lecture","abstract":"In this workshop we’ll cover how to implement runtime security for Kubernetes using the open source project Falco (falco.org).","persons":[{"id":2220,"full_public_name":"Spencer Krum","abstract":"","twitter_name":"Nibalizer","avatar_path":"/system/avatars/2220/large/1B25DA66-AC3B-4C49-94EB-E714B689F68C.jpeg?1565719321"}]},{"id":5463,"date":"2020-02-20T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 15","title":" How to fail at building modern microservices","track":"Unobtanium","type":"lecture","abstract":"So your company has bought into the Microservices craze and have tasked you with rebuilding the existing applications as a set of Microservices, but what does that mean? How should you approach it? You've read google, and search stack overflow and now you are ready to take the next step. Come to this session to learn all the best processes, practices, frameworks and technologies to make your microservice a failure. Yes don't come along to this talk to learn how to succeed, but how to fail so spectacularly you'll have a job for life as a microservices consultant, because once you've failed you'll have experience and what better experience is there than spectacular failure.","persons":[{"id":917,"full_public_name":"Alasdair Nottingham","abstract":"","twitter_name":"nottycode","avatar_path":"/system/avatars/917/large/alasdai.jpeg?1549662243"}]},{"id":5460,"date":"2020-02-20T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 15","title":" Applying AI to IoT Data: From Sensors to Insights at the Edge","track":"Unobtanium","type":"lecture","abstract":"Applying the power of IoT and AI lets organizations gain valuable insights from a universe of physical assets, from vehicles to facilities and systems. Learn how to harness IoT data to deliver operational and predictive maintenance insights using AI at the Edge. Take a fast-paced journey that follows IoT sensor data from generation, edge gateways and analytics, encryption, IBM Cloud, Watson IoT, Node-RED processing, cloud storage, Watson Studio, Apache Spark analysis in Jupyter notebooks, PixieDust visualization, machine learning algorithms and deployment of the models for edge prediction.","persons":[{"id":2500,"full_public_name":"John Walicki","abstract":"    CTO, IoT Advocacy\r\n    IBM Cognitive Applications\r\n    STSM, IBM Academy of Technology Leadership Team","twitter_name":"johnwalicki","avatar_path":"/system/avatars/2500/large/0fIYmIJl_400x400.png?1580139332"}]},{"id":5459,"date":"2020-02-20T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 15","title":" Future of Java Panel ","track":"Unobtanium","type":"lecture","abstract":"We now have a generation of developers joining our organisations and workforces that are younger than Java. They have grown up with an ever-expanding catalog of applications, languages and frameworks at their fingertips. The question is, should we still be encouraging them to develop and code in Java? Is Java still relevant to this generation? If so, how can we entice more young developers to tackle the JVM? ","persons":[{"id":882,"full_public_name":"Sebastian Daschner","abstract":"Sebastian Daschner is a Java Developer Advocate at IBM, a consultant, author, and trainer. He is the author of the book ‘Architecting Modern Java EE Applications’. Sebastian is participating in the JCP, helping forming the future standards of Java EE, serving in the JAX-RS, JSON-P and Config Expert Groups and collaborating on various open source projects. For his contributions in the Java community and ecosystem he was recognized as a Java Champion, Oracle Developer Champion and double 2016 JavaOne Rockstar. Besides Java, Sebastian is also a heavy user of Linux and cloud native technologies. He evangelizes computer science practices on https://blog.sebastian-daschner.com, his newsletter, and on Twitter via @DaschnerS. When not working with Java, he also loves to travel the world — either by plane or motorbike.","twitter_name":"@DaschnerS","avatar_path":"/system/avatars/882/large/sebastian4.jpg?1536818345"},{"id":1875,"full_public_name":"Dalia Abo Sheasha","abstract":"Dalia Abo Sheasha is the development lead for the IBM WebSphere Migration Tools. Her team develops several migration tools that deal with a variety of scenarios including Java SE migrations and on-premise to cloud migrations. Dalia has worked on WebSphere for 5 years starting her career with the EJB team and transitioning to the JPA team where she contributed to the open-source projects: EclipseLink and OpenJPA.","twitter_name":"DaliaShea","avatar_path":"/system/avatars/1875/large/das.jpeg?1570755431"},{"id":2296,"full_public_name":"Angie Jones","abstract":"Angie Jones is a Senior Developer Advocate who specializes in test automation strategies and techniques. She shares her wealth of knowledge by speaking and teaching at software conferences all over the world, writing tutorials and technical articles on angiejones.tech, and leading the online learning platform, Test Automation University.","twitter_name":"techgirl1908","avatar_path":"/system/avatars/2296/large/angie-jones-headshot.jpg?1567020786"},{"id":1008,"full_public_name":"Venkat Subramaniam","abstract":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats at agiledeveloper dot com or on twitter at @venkat_s.","twitter_name":"venkat_s","avatar_path":"/system/avatars/1008/large/venkat.001.jpeg?1510755501"},{"id":712,"full_public_name":"Mark Heckler","abstract":"Mark Heckler is a Pivotal Principal Technologist & Spring Developer Advocate, conference speaker, published author, & Java Champion focusing upon developing innovative production-ready software at velocity for the Cloud and IoT applications. He has worked with key players in the manufacturing, retail, medical, scientific, telecom, and financial industries and various public sector organizations to develop and deliver critical capabilities on time and on budget. Mark is an open source contributor and author/curator of a developer-focused blog (https://www.thehecklers.com) and an occasionally interesting Twitter account (@mkheck).","twitter_name":"@mkheck","avatar_path":"/system/avatars/712/large/MarkHecklerProfilePic.jpg?1519666499"},{"id":1570,"full_public_name":"Grace Jansen","abstract":"Grace is a technical evangelist at IBM, primarily advocating the Reactive Platform offering. She has a degree in Biology with a specialty in the  modelling and prediction of biological systems. She has spoken at both internal and external conferences (e.g. DevoxxUK, THINK and QCon London).","twitter_name":"@gracejansen27","avatar_path":"/system/avatars/1570/large/_b305924_copy_2.jpg?1565876053"}]}],"Foyer":[{"id":5353,"date":"2020-02-20T07:30:00-05:00","start":"07:30","duration":"01:30","room":"Foyer","title":"Registration & Breakfast","track":"admin","type":"other","abstract":"Conference Reception","persons":[]},{"id":5356,"date":"2020-02-20T10:00:00-05:00","start":"10:00","duration":"00:20","room":"Foyer","title":"Morning Break 0","track":"admin","type":"other","abstract":"","persons":[]},{"id":5362,"date":"2020-02-20T12:20:00-05:00","start":"12:20","duration":"00:50","room":"Foyer","title":"Lunch Break 0","track":"admin","type":"other","abstract":"","persons":[]},{"id":5358,"date":"2020-02-20T15:10:00-05:00","start":"15:10","duration":"00:20","room":"Foyer","title":"Afternoon Break 0","track":"admin","type":"other","abstract":"","persons":[]},{"id":4810,"date":"2020-02-20T17:40:00-05:00","start":"17:40","duration":"01:00","room":"Foyer","title":"Off Heap Live!","track":"JVM Languages","type":"lecture","abstract":"OffHeap Live! The OffHeap gang is back to talk about the latest news and happenings within the java community. OffHeap is a podcast that brings together a collection of java champions and open source committers to talk and debate about the latest news in our industry. Hear Freddy Guime, Bob Paulin, Michael Minella, Josh Juneau, and others as we talk about what’s new in the java ecosystem!","persons":[{"id":850,"full_public_name":"Bob Paulin","abstract":"Bob Paulin is an independent consultant and speaker that has been developing open source software for the past 10 years. Bob has presented at large international conferences such as ApacheCon, Oracle Code One and Devnexus. He frequently shares his knowledge and opinions on the Java Pub House and Java Off Heap podcasts. Bob is actively involved in the Chicago developer community as a Chicago Java User Group Board Member. Bob is a passionate member of the ASF and donates his time to Apache Felix and Apache Tika as a committer and PMC respectively. When not coding, Bob enjoys coaching football, robotics, and spending time with his wife and 4 kids. ","twitter_name":"bobpaulin","avatar_path":"/system/avatars/850/large/bob.jpg?1537033760"}]},{"id":5352,"date":"2020-02-20T17:50:00-05:00","start":"17:50","duration":"02:00","room":"Foyer","title":"Conference Reception","track":"admin","type":"other","abstract":"Conference Reception","persons":[]}],"Keynote Room":[{"id":5365,"date":"2020-02-20T09:00:00-05:00","start":"09:00","duration":"00:10","room":"Keynote Room","title":"Conf open and welcome","track":"admin","type":"other","abstract":"","persons":[]},{"id":5382,"date":"2020-02-20T09:10:00-05:00","start":"09:10","duration":"00:50","room":"Keynote Room","title":"Dueling Banjos","track":"Keynote","type":"lecture","abstract":"How can different frameworks and technologies work together? In this interactive keynote, Burr Sutter will discuss Java, Cloud, and of course banjos!","persons":[{"id":836,"full_public_name":"Burr Sutter","abstract":"A lifelong developer advocate, community organizer, and technology evangelist, Burr Sutter is a featured speaker at technology events around the globe—from Bangalore to Brussels and Berlin to Beijing (and most parts in between)—he is currently Red Hat’s Director of Developer Experience. A Java Champion since 2005 and former president of the Atlanta Java User Group, Burr founded the DevNexus conference—now the second largest Java event in the U.S.—with the aim of making access to the world’s leading developers affordable to the developer community. When not speaking abroad, Burr is also the passionate creator and orchestrator of highly-interactive live demo keynotes at Red Hat Summit, the company’s premier annual event.","twitter_name":"burrsutter","avatar_path":"/system/avatars/836/large/080717_BURRSUTTER_HEADSHOT_6INX6IN_300DPI.JPG?1536947070"}]},{"id":5383,"date":"2020-02-20T16:40:00-05:00","start":"16:40","duration":"00:30","room":"Keynote Room","title":"Decoding the weather: How GRAF and New Computer Modeling can Change Everything","track":"Keynote","type":"lecture","abstract":"\r\nWeather has an enormous economic impact on a day-to-day basis, beyond the billions of impacted caused by severe weather. Superior science requires precise measurement. Super computing and Artificial Intelligence are coming together to make high resolution weather forecasting possible, taking the resolution down 4x with Global High-Resolution Forecasting model. This session will talk about the value for tapping into better global weather data for adding value to applications, as well as where the future might take us with new high-resolution weather data and superior predictive insights. GRAF brings more exact weather forecasting to places where previously there wasn't the capability, and that will have impact from crop yield all the way to plane routes.","persons":[{"id":2472,"full_public_name":"Kait Parker","abstract":"Atmospheric Scientist talking about weather, climate, and the environment on http://weather.com and Warming Signs podcast.","twitter_name":"weatherkait","avatar_path":"/system/avatars/2472/large/kait.jpg?1576020695"}]},{"id":4817,"date":"2020-02-20T17:10:00-05:00","start":"17:10","duration":"00:30","room":"Keynote Room","title":"(De)human future","track":"Keynote","type":"lecture","abstract":"\"... let us unite, not in spite of our differences, but through them. For differences can never be wiped away, and life would be so much the poorer without them. Let all human races keep their own personalities, and yet come together, not in a uniformity that is dead, but in a unity that is living\"\r\nRabindranath Tagore","persons":[{"id":2235,"full_public_name":"Ixchel Ruiz ヾ(＾-＾)ノ","abstract":"Ix-chel Ruiz has developed software application & tools since 2000. Her research interests include Java, dynamic languages, client-side technologies and testing. Java Champion, Oracle Developer Champion, hackergarten enthusiast, Open Source advocate, public speaker and mentor.\r\n\r\nThe highest education is that which does not merely give us information but makes our life in harmony with all existence.\r\nRabindranath Tagore","twitter_name":"ixchelruiz","avatar_path":"/system/avatars/2235/large/ir.jpeg?1570642885"}]}]}},{"index":2,"date":"2020-02-21","day_start":"2020-02-21T07:00:00-05:00","day_end":"2020-02-21T21:00:00-05:00","rooms":{"Room 1":[{"id":5027,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 1","title":"Is your API in no man's land?","track":"Agile","type":"lecture","abstract":"Have you ever feel that an API doesn't make sense at all? What about simple changes that break the clients? Or missing/wrong documentation? Does this sound familiar? This even gets more interesting when that horrible API, well... is yours.\r\nWe all have been in the situation where the API codebase is awful but we keep adding functionality and increasing the technical debt. Can we change this? How can we do it? And what is the cost of having a great API that allows your product, and engineering teams to move fast and keep the peace of the market?","persons":[{"id":2206,"full_public_name":"Victor Cruz","abstract":"","twitter_name":"@vlcc0","avatar_path":"/system/avatars/2206/large/45920230.jpeg?1570639707"}]},{"id":5022,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 1","title":"Refactoring an Anti-refactoring Culture","track":"Agile","type":"lecture","abstract":"Is it possible to prove to engineers, product owners, and delivery leads that small incremental changes can transform legacy code into a sustainable product allowing for agility? Join our team as we address classic refactoring scenarios which hamper quality software delivery. ","persons":[{"id":1152,"full_public_name":"Rob Gordick","abstract":"I am an agile servant leader and change agent with over a decade's experience in various agile software development frameworks and practices. I enable teams to develop a safe and learning culture which is passionate about value delivery.","twitter_name":"@rob_gordo","avatar_path":"/system/avatars/1152/large/Rob_Gordick.jpg?1513343246"}]},{"id":5003,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 1","title":"Microservices and Agile","track":"Agile","type":"lecture","abstract":"Companies have struggled to scale agile in large organizations.  By transforming applications to use a microservice architecture, large numbers of  small teams  are able to deliver successfully without the problems that come with traditional monolithic development.","persons":[{"id":2254,"full_public_name":"Jeff Lent","abstract":"Over 20 years experience leading and transforming  organizations both culturally and technologically in order to improve their efficiency and positioning in their industry.","twitter_name":"","avatar_path":"/system/avatars/2254/large/jeffreylent3jpg.jpg?1571152467"}]},{"id":5019,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 1","title":"Cookies, Mapping, & Complexity","track":"Agile","type":"lecture","abstract":"Baking cookies at home is simple enough. Sharing them with friends or family outside of our homes is slightly more complicated. Shipping hundreds of cookies around the world to strangers that filled out a survey on the internet is at least complex and tends towards the chaotic. This talk is a review of the lessons we learned about the theory of constraints, complexity science, mapping, devOps, and trusting each other after we received an overwhelming response to a configuration management survey I launched at Puppet Conf 2014.","persons":[{"id":2287,"full_public_name":"Chris Corriere","abstract":"Chris Corriere has been working with data, phones, networks and writing software for twenty years. His background in mathematics and engineering have allowed him to adapt to new and industry specific technologies and provided many unique consulting opportunities. As a devOps professional Chris is committed to culture, automation, learning, sharing, and having a good time while getting work done. ","twitter_name":"cacorriere","avatar_path":"/system/avatars/2287/large/cc.jpeg?1570643366"}]},{"id":4882,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 1","title":"DevOps for Leadership","track":"Agile","type":"lecture","abstract":"Competitive markets dictate an ever-increasing need to be able to react quickly and deliver business value and quality efficiently. Organizations that cannot evolve to the newer and faster-paced delivery models will not survive. DevOps is necessary to build robust software solutions and products quickly and reliably, without increasing risk or sacrificing quality. Today’s leaders need to understand what DevOps is all about and how to implement it across the enterprise to remain competitive and facilitate growth. This session will explain what DevOps is and isn’t, what benefits should we expect adopting it, and what we need to do to move into a DevOps mindset. We’ll look at our current delivery process and discuss how we can deliver higher quality, more secure software, and how we can do it faster, more reliably, and have more confidence in the result. We will focus on the culture and process, only touching on the tools that enable us to work better. It is not a technical deep dive. This session is appropriate for executives and leaders, managers, project managers, and team leads. Participants will take away exercises that are designed to build the insight needed for successful DevOps transformation and leadership.","persons":[{"id":2248,"full_public_name":"Gene Gotimer","abstract":"Gene Gotimer is a Principal Consultant at Coveros, Inc., a software company that uses agile methods to help customers build software better, faster, and more securely. They do this by focusing on agile development and DevOps practices such as continuous integration, repeatable builds, unit testing, automated functional testing, analysis tools, security scanning, and automated deploys. Gene feels strongly that repeatability, quality, and security are all strongly intertwined; each of them is dependent on the other two, which makes agile and DevOps that much more crucial to software development.","twitter_name":"CoverosGene","avatar_path":"/system/avatars/2248/large/GeneGotimer_white_1000.jpg?1565915736"}]}],"Room 2":[{"id":4814,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 2","title":"Reacting to an Event-Driven World","track":"Architecture","type":"lecture","abstract":"We now live in a world with data at its heart. The amount of data being produced every day is growing exponentially and a large amount of this data is in the form of events. Whether it be updates from sensors, clicks on a website or even tweets, applications are bombarded with a never-ending stream of new events. So, how can we architect our applications to be more reactive and resilient to these fluctuating loads and better manage our thirst for data? In this session explore how Kafka and Reactive application architecture can be combined in applications to better handle our modern data needs.","persons":[{"id":1570,"full_public_name":"Grace Jansen","abstract":"Grace is a technical evangelist at IBM, primarily advocating the Reactive Platform offering. She has a degree in Biology with a specialty in the  modelling and prediction of biological systems. She has spoken at both internal and external conferences (e.g. DevoxxUK, THINK and QCon London).","twitter_name":"@gracejansen27","avatar_path":"/system/avatars/1570/large/_b305924_copy_2.jpg?1565876053"}]},{"id":4636,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 2","title":"Decompose your monolith","track":"Architecture","type":"lecture","abstract":"Learn how to incrementally a refactor a monolith, including its database, to a microservice architecture.","persons":[{"id":2194,"full_public_name":"Chris Richardson","abstract":"Chris Richardson is a developer and architect. He is the author of Microservices Patterns and POJOs in Action. He helps companies around the world adopt the microservice architecture through consulting and training.","twitter_name":"@crichardson","avatar_path":"/system/avatars/2194/large/cr.jpeg?1570642833"}]},{"id":4964,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 2","title":"Architecture Foundations: Styles, Patterns, & Tradeoffs","track":"Architecture","type":"lecture","abstract":"A key building block for burgeoning software architects is understanding and applying software architecture styles and patterns. ","persons":[{"id":711,"full_public_name":"Neal Ford","abstract":"Neal is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a software company and a community of passionate, purpose-led individuals, delivering technology to address the toughest challenges, all while seeking to revolutionize the IT industry and create positive social change. He speaks at many conferences.\r\n","twitter_name":"neal4d","avatar_path":"/system/avatars/711/large/NF.png?1512951094"}]},{"id":4592,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 2","title":"Pragmatic replay-oriented architecture","track":"Architecture","type":"lecture","abstract":"How can we simplify concurrency, improve logging, improve maintainability, and reduce regression defects without throwing away everything we have and re-building it from scratch using a new framework? or without spending countless hours every release reviewing each function to make sure all the bases are covered?  \r\n \r\nThe auction engine at the Intercontinental Exchange that sets the global benchmark price of Gold and Silver was organically evolved from monolith to modular monolith, and then to message-driven modular monolith. The final architecture gave us simpler, actor-model-like concurrency, and the ability to implement production traffic replays in non-prod. \r\n \r\nWe’d like to share with you our pragmatic approach to using event buses for reproducing prod scenarios in non-prod, and to test software changes with days/months/years of real production traffic. We will share the event bus implementations we used, how we integrated the replay tests into our development process, and the limitations of replay-based testing. \r\n","persons":[{"id":1816,"full_public_name":"Juan D Bustamante","abstract":"Juan is a Principal Engineer at the Intercontinental Exchange, responsible for several components of the mission-critical trading system.  \r\n\r\nInfused with the pragmatism of the technology organization at ICE, Juan is a very practical software engineer, always looking for ways to build simpler, easier to understand, easier to maintain apps.  ","twitter_name":"","avatar_path":"/system/avatars/1816/large/jb.jpeg?1570641074"}]},{"id":5052,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 2","title":"Visualizing IoT sensor and cyber data streams for mixed modality situational awareness","track":"Architecture","type":"lecture","abstract":"The permeation of smart appliances and low size weight and power computing devices in our lives has increased the challenge of cyber security by making locations for network activity far less static. For operational centers this raises the need for an awareness of the physical domain in the same context as traditional network activity. To provide this situational awareness facilities have been outfitted with low-cost IoT devices (RaspPi, Xandem, ZWave) to capture these physical modalities. This presentation will discuss some of these sensors along with the data services (Kafka) that stream to endpoint consumers. Demonstration will show data management (Kibana, ElasticSearch) and a custom JavaFX visualization for all modalities.","persons":[{"id":1018,"full_public_name":"Sean M Phillips","abstract":"Sean Phillips is an Applied Data Science software engineer with Johns Hopkins University Applied Physics Lab. Sean's specialties are data analysis and visualization using Java and JavaFX along with rich-client programming with the NetBeans Platform. ","twitter_name":"@seanmiphillips","avatar_path":"/system/avatars/1018/large/sp.jpeg?1570756282"}]}],"Room 3":[{"id":4891,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 3","title":"Metrics for the win!","track":"Cloud Infrastructure","type":"lecture","abstract":"Understanding application behavior is important in any environment. The most efficient way to observe application behavior relies on metrics, key/value pairs of numerical data. This session will compare the capabilities of libraries like Micrometer, OpenTelemetry, and MicroProfile metrics. We'll also explore how gathered data can be used to observe and understand application behavior in order to determine what should be measured.","persons":[{"id":1876,"full_public_name":"Erin Schnabel","abstract":"Erin Schnabel is a Senior Technical Staff Member at IBM working with microservice architectures, cloud native applications, composable runtimes and Java. Erin has 20 years under her belt, as a developer, technical leader, architect and evangelist. She is passionate about developer experience, particularly with how the evolving cloud ecosystem impacts developers and their applications. She prefers learning (and teaching) by doing, as demonstrated by her open source exploits with \"Game On!\" (gameontext.org), a text adventure game that provides developers with a playground to experimenting with backend technologies.","twitter_name":"ebullientworks","avatar_path":"/system/avatars/1876/large/es.jpeg?1570642569"}]},{"id":4819,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 3","title":"Automating Stateful Applications with Kubernetes Operators","track":"Cloud Infrastructure","type":"lecture","abstract":"Kubernetes scales and manages stateless applications quite easily. Stateful applications can require more work. Databases, caching systems, and file stores are harder to dynamically manage with data intact, and sometimes come with their own notion of clustering. Operators are Kubernetes agents that know how to deploy, scale, manage, backup, and even upgrade complex, stateful applications.\r\n\r\nThis talk provides an overview of the Operator pattern introduced by CoreOS, adopted by many community projects like Rook, Prometheus, and others, and supported by the release of the Operator Framework by Red Hat. With an understanding of Operators in place, the session will go on to detail the Operator Framework and its main components, the Operator SDK and the Lifecycle management backplane.","persons":[{"id":1543,"full_public_name":"Jan Kleinert","abstract":"Jan Kleinert is a Developer Advocate at Red Hat, where she focuses on OpenShift and the developer experience for developers working with containers and Kubernetes. Prior to joining Red Hat, she worked in a variety of roles ranging from developer relations to web analytics and conversion optimization. \r\n","twitter_name":"jankleinert","avatar_path":"/system/avatars/1543/large/jan-new-square.jpg?1552402710"}]},{"id":4518,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 3","title":"Stretching the Service Mesh from Java to Beyond","track":"Cloud Infrastructure","type":"lecture","abstract":"How do we extend the capabilities of service mesh from Java microservices to on-premise databases and .NET applications? In this talk, we will refactor and scatter a set of Java microservices to various workloads and environments, configure the application for observability and traffic management in a service mesh, and discuss its trade-offs and benefits.","persons":[{"id":2150,"full_public_name":"Rosemary Wang","abstract":"As a developer advocate for HashiCorp, Rosemary Wang works to bridge the technical and cultural barriers between infrastructure engineers and application developers. She has a fascination for solving intractable problems with code, whether it be helping an infrastructure engineer learn to code or an application developer troubleshoot infrastructure failures. Rosemary interfaces with vendors, clients, startups, and open source projects to find creative software solutions for infrastructure. When she is not drawing on whiteboards, she valiantly attempts to hack stacks of various infrastructure systems on her laptop while foraging for tasty victuals around the world.","twitter_name":"joatmon08","avatar_path":"/system/avatars/2150/large/rw.jpg?1570755641"}]},{"id":5013,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 3","title":"Modern Java Clients with JavaFX: The Definitive Guide","track":"Cloud Infrastructure","type":"lecture","abstract":"This session is for professionals building Java applications for\r\ndesktop, mobile, and embedded devices in the Cloud age.  It\r\nwill help you to build enhanced visual experiences and to deploy\r\nmodern, easy to maintain, client applications across a variety of\r\nplatforms.  These applications can take advantage of the\r\nlatest user interface components, 3D technology, and cloud services\r\nto create immersive visualizations and allow high-value data\r\nmanipulation.  Learn how to leverage the latest open-source\r\nJava client technologies to build rich, responsive, and modern UIs\r\nfrom the authors of the definitive Java Client reference.","persons":[{"id":1460,"full_public_name":"Stephen Chin","abstract":"Stephen Chin is Senior Director of Developer Relations at JFrog, author of Raspberry Pi with Java, The Definitive Guide to Modern Client Development, and Pro JavaFX Platform. He has keynoted numerous Java conferences around the world including Oracle Code One (formerly JavaOne), where he is an 8-time Rock Star Award recipient. Stephen is an avid motorcyclist who has done evangelism tours in Europe, Japan, and Brazil, interviewing hackers in their natural habitat and posting the videos on http://nighthacking.org/. When he is not traveling, he enjoys teaching kids how to do embedded and robot programming together with his teenage daughter.","twitter_name":"steveonjava","avatar_path":"/system/avatars/1460/large/2018-steveonjava-portrait.jpg?1574718192"}]},{"id":5050,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 3","title":"Reactive Architectures with RSocket and Spring Cloud Gateway","track":"Cloud Infrastructure","type":"lecture","abstract":"In this talk, we'll provide an overview of the key benefits of RSocket-based networking and introduce the integration of Spring Cloud Gateway with RSocket. We'll discuss the benefits of this integration, including the impact on speed, scalability, security, and more. We'll also discuss use cases, and show how you can leverage this new technology in your applications.","persons":[{"id":1182,"full_public_name":"Spencer Gibb","abstract":"Spencer Gibb is a Principal Software Engineer for Pivotal, Inc where he is the co-founder and co-lead of the Spring Cloud Core projects. He is a husband, father, and geek.","twitter_name":"spencerbgibb","avatar_path":"/system/avatars/1182/large/Spencer_Gibb_Headshot_-_Square_-_Hi_Res.jpg?1538405673"}]}],"Room 4":[{"id":5040,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 4","title":"Ahead of Time Data Access with Micronaut","track":"Cloud Technology","type":"lecture","abstract":"This presentation will demonstrate a brand new technology built on Micronaut that debuted in July 2019 and provides an innovative new way to access database technologies using Ahead of Time compilation to optimize query performance, throughput and memory consumption.","persons":[{"id":688,"full_public_name":"Todd Sharp","abstract":"I'm a Developer Advocate for Oracle focusing on the Oracle Cloud. I have 15 years experience as a full stack developer.  I've been working with dynamic JVM languages and various JavaScript frameworks for my whole career - originally with ColdFusion and more recently Groovy/Grails on the server side.  I have experience with everything from jQuery, ExtJS to all versions of Angular on the front end.","twitter_name":"recursivecodes","avatar_path":"/system/avatars/688/large/15035732_1310991748965002_2689404947618856960_n.jpg?1503360504"}]},{"id":4930,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 4","title":"Cloud Native Culture","track":"Cloud Technology","type":"lecture","abstract":"The shift to cloud computing involves a veritable plethora of new technologies and approaches. From 12 factors to domain drive design change is afoot. Your organization is knee deep in functions and platforms and containers and while the technology is important, we can’t afford to overlook the importance of culture. What changes when we go to the cloud? How do we get there? How does Conways law affect the success of our efforts? How can we help people navigate the latest evolution in computing? This talk will explore how cloud native computing impacts more than just our architecture.","persons":[{"id":1058,"full_public_name":"Nathaniel Schutta","abstract":"Nathaniel T. Schutta is a software architect focussed on mobile and making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. In an effort to rid the world of bad presentations, Nate coauthored the book Presentation Patterns with Neal Ford and Matthew McCullough.","twitter_name":"ntschutta","avatar_path":"/system/avatars/1058/large/nts_pic_400x400.jpg?1510766283"}]},{"id":4960,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 4","title":"Kubernetes local development workflow distilled","track":"Cloud Technology","type":"lecture","abstract":"The Kubernetes ecosystem can be very operator focussed and it can be a challenge for developers to distil the information that is relevant for their job. The Kubernetes hype train has reached full velocity and many organisations are now adopting the technology.  There are a large number of available tools aimed at solving a broad set of problems but it can be daunting choosing which to invest in. \r\nThis session aims to provide developers with a thorough grounding on Kubernetes concepts, suggest best practices and get hands-on with some of the essential tooling.","persons":[{"id":2466,"full_public_name":"Ollie Hughes","abstract":"I love building tools that make developers' lives easier when working with cloud technologies and Kubernetes. I'm fortunate enough to work on the Spring team at Pivotal alongside some very smart people.","twitter_name":"@olliehughes82","avatar_path":"/system/avatars/2466/large/68976969_10157521853756054_7199686345806053376_n.png?1573053306"},{"id":2271,"full_public_name":"Alberto C. Ríos","abstract":"Software Engineer interested in building products people love in agile environments with a focus on high-quality tests and clean code.","twitter_name":"albertoimpl","avatar_path":"/system/avatars/2271/large/19145752_10154917109608318_9197205347952138641_n.jpg?1566291191"}]},{"id":4812,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 4","title":"Configuring Apache Camel for the Cloud","track":"Cloud Technology","type":"lecture","abstract":"Cloud … check. Container … check. Orchestration … check. Now that you’ve got the basics it’s time to starting thinking about how all occupants of your new cloud infrastructure are going to communicate. And no mater what cloud, container or orchestration tool you choose, Apache Camel has what you need to get your system configured and connected. This talk will cover Camel components for cloud friendly configuration, communication, packaging, and deployment. The approaches presented will take a “use what is already there” philosophy. So whatever you’re working with from Do It Yourself Virtual Machines with containers like Apache Karaf or a fully managed Kubernetes clusters with fat jars, integrating vertically or horizontally, Apache Camel has the pieces to make it all work. This talk will cover how to do it as as well as advantages and drawbacks of each approach.","persons":[{"id":850,"full_public_name":"Bob Paulin","abstract":"Bob Paulin is an independent consultant and speaker that has been developing open source software for the past 10 years. Bob has presented at large international conferences such as ApacheCon, Oracle Code One and Devnexus. He frequently shares his knowledge and opinions on the Java Pub House and Java Off Heap podcasts. Bob is actively involved in the Chicago developer community as a Chicago Java User Group Board Member. Bob is a passionate member of the ASF and donates his time to Apache Felix and Apache Tika as a committer and PMC respectively. When not coding, Bob enjoys coaching football, robotics, and spending time with his wife and 4 kids. ","twitter_name":"bobpaulin","avatar_path":"/system/avatars/850/large/bob.jpg?1537033760"}]},{"id":5384,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 4","title":"Developer Productivity Engineering","track":"Cloud Technology","type":"lecture","abstract":"Hans Dockter, CEO & Founder of Gradle, will talk about the emerging practice of developer productivity engineering, the discipline of applying data and acceleration technologies to speed up and improve the essential software development processes from builds to testing to CI. ","persons":[{"id":2474,"full_public_name":"Hans Dockter","abstract":"Hans Dockter is the founder of the Gradle build system and the CEO of Gradle Inc., a company with the mission to transform how software is built and shipped. Hans is a thought leader in the field of project automation and has successfully been in charge of numerous large-scale enterprise builds. He is also an advocate of Domain Driven Design, having taught classes and delivered presentations on this topic together with Eric Evans. In the earlier days, Hans was also a committer for the JBoss project and founded the JBoss-IDE.","twitter_name":"hans_d","avatar_path":"/system/avatars/2474/large/hans.jpeg?1579545907"}]}],"Room 5":[{"id":4670,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 5","title":"Keeping Up With Java: Look At All These New Features!","track":"Core Java","type":"lecture","abstract":"A new version of Java every six months! That means new features are coming faster than ever to the Java platform.  How do you keep up? In this session, we'll explore how Java the language, the libraries and the JVM have changed to make life easier for developers since JDK 9.","persons":[{"id":1504,"full_public_name":"Simon Ritter","abstract":"Simon Ritter is the Deputy CTO of Azul Systems.  Simon joined Sun Microsystems in 1996 and spent time working in both Java development and consultancy.  He has been presenting Java technologies to developers since 1999 focusing on the core Java platform.","twitter_name":"speakjava","avatar_path":"/system/avatars/1504/large/SimonRitter-04A-SQ.jpg?1536327466"}]},{"id":4818,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 5","title":"Migrating Beyond Java 8","track":"Core Java","type":"lecture","abstract":"Learn about the breaking changes that went into Java since Java 8 and tools to help you find migration issues when migrating from Java 8 to Java 11/13.\r\n","persons":[{"id":1875,"full_public_name":"Dalia Abo Sheasha","abstract":"Dalia Abo Sheasha is the development lead for the IBM WebSphere Migration Tools. Her team develops several migration tools that deal with a variety of scenarios including Java SE migrations and on-premise to cloud migrations. Dalia has worked on WebSphere for 5 years starting her career with the EJB team and transitioning to the JPA team where she contributed to the open-source projects: EclipseLink and OpenJPA.","twitter_name":"DaliaShea","avatar_path":"/system/avatars/1875/large/das.jpeg?1570755431"}]},{"id":4849,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 5","title":"Revisiting Effective Java in 2020","track":"Core Java","type":"lecture","abstract":"Joshua Bloch just gifted us with the 3rd edition of \"\"Effective Java\"\", but almost 10 years have been past since the last edition. Now we have a whole generation of Java developers that could benefit from this knowledge - but lost the past wave. It's about time to revisit all of this wonderful content, and upgrade your skills to the latest versions of the Java platform. Join us on this deep dive session to check what is the updated Effective Java, and even add some more tips not included in the book!","persons":[{"id":915,"full_public_name":"Edson Yanaga","abstract":"Edson Yanaga, Red Hat's Director of Developer Experience, is a Java Champion and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java, Microservices, Cloud Computing, DevOps, and Software Craftsmanship. ","twitter_name":"yanaga","avatar_path":"/system/avatars/915/large/edson_yanaga.jpg?1507757067"}]},{"id":4502,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 5","title":"The Good, the Bad and the Ugly of Java API design","track":"Core Java","type":"lecture","abstract":"In this live-coding session, we learn lessons from poorly designed APIs from older JDKs, and examine their well-designed replacements introduced in JDK 9-12.","persons":[{"id":752,"full_public_name":"Miro Cupak","abstract":"Co-founder and VP Engineering at DNAstack","twitter_name":"@mirocupak","avatar_path":"/system/avatars/752/large/profile-cas-800.png?1562941783"}]},{"id":4676,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 5","title":"Evolving Java: Project Amber","track":"Core Java","type":"lecture","abstract":"In this presentation we will talk about the project Amber and how it is evolving the Java language. We will cover several subprojects within Amber: local variable type inference, records, sealed types and pattern matching.","persons":[{"id":1438,"full_public_name":"Vicente Romero","abstract":"Vicente has been hacking the javac compiler for almost 7 years. The most stressful and pleasant 7 years of his career. He has been touching, and introducing bugs as a side-effect in, mostly all areas of the compiler since he had the opportunity to convert his passion for compilers and programming languages into a real job. With a weird taste for complex problems he has a love-hate relation with type inference and performance related problems. He has been very lucky to be able to help with projects of all sizes from lambda to Amber. In other lives he was a University professor, research consultant and most of all a programmer. Apart from 1's and 0's he loves Math, languages, history, chess, some traveling and cooking.","twitter_name":"","avatar_path":"/system/avatars/1438/large/vr.jpeg?1570640773"}]}],"Room 6":[{"id":4823,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 6","title":"What's going on with Jakarta EE?","track":"Frameworks","type":"lecture","abstract":"Get the latest about Jakarta EE from the source","persons":[{"id":798,"full_public_name":"Ivar Grimstad","abstract":"Java Champion, JUG Leader, JCP Spec Lead, EC and EG Member, Jakarta EE WG, EE4J PMC, Oracle Developer Champion, Speaker, The guy with the Duke tattoo...","twitter_name":"ivar_grimstad","avatar_path":"/system/avatars/798/large/ivar_jc_400.png?1578928029"}]},{"id":4853,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 6","title":"From Imperative to Reactive Programming","track":"Frameworks","type":"lecture","abstract":"<p>Everybody seems to be talking about reactive, but do you really grasp it? All the talks and examples make it look \"simple\", and different, but how do I transfer my traditional skills to this new paradigm?</p>\r\n\r\n<p>Come and join us on this session so you can learn how to transition from imperative to reactive programming. I've had a hard time myself trying to understand how things work. But fortunately I'lll help you to understand how concepts like sync and async programming, reactive, streams, message queues and brokers, and reactive systems fit together. Confused? Well, you won't be anymore after this talk.</p>","persons":[{"id":915,"full_public_name":"Edson Yanaga","abstract":"Edson Yanaga, Red Hat's Director of Developer Experience, is a Java Champion and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java, Microservices, Cloud Computing, DevOps, and Software Craftsmanship. ","twitter_name":"yanaga","avatar_path":"/system/avatars/915/large/edson_yanaga.jpg?1507757067"}]},{"id":4892,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 6","title":"10 strategies for developing reliable Jakarta EE & MicroProfile applications for the Cloud","track":"Frameworks","type":"lecture","abstract":"Ever thought of implementing a modern cloud architecture with Jakarta EE and MicroProfile applications but don’t know which practices to follow? This talk will highlight 10 strategies that will help you implement robust scalable cloud-ready applications!","persons":[{"id":2209,"full_public_name":"Fabio Turizo","abstract":"Senior Service Engineer at Payara Services Limited. Software Architecture Enthusiast and Java+MicroProfile Evangelist","twitter_name":"fabturizo","avatar_path":"/system/avatars/2209/large/PortraitPhoto_Cropped.png?1565960598"}]},{"id":4619,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 6","title":"Migration to Quarkus ","track":"Frameworks","type":"lecture","abstract":"Have you heard about Quarkus ? But, is that easy to go the Quarkus way ? I will show my own experience migrating to Quarkus.","persons":[{"id":2187,"full_public_name":"Jonathan Vila","abstract":"Software Engineer at Red Hat , passionate about Java, opensource, communities and simulated reality.","twitter_name":"vilojona","avatar_path":"/system/avatars/2187/large/profile.jpg?1565015108"}]},{"id":4907,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 6","title":"To Batch Or Not To Batch","track":"Frameworks","type":"lecture","abstract":"As most enterprises modernize legacy systems, the question of what to do with batch processing comes up.  Should batch processing be \"modernized\" into streaming or real time processing?  What are the architectural impacts of doing this?  In this talk, we will explore both paradigms and see what the trade offs are for each style.  The Spring programming models will serve as the basis for all demos in this talk.","persons":[{"id":873,"full_public_name":"Michael Minella","abstract":"Michael Minella is a software engineer, Java Champion, speaker, and author with over 18 years of enterprise development experience. He currently works for Pivotal as the project lead for the Spring Batch and Spring Cloud Task projects. Michael has spoken on a number of Java, Spring, and Big Data topics and is a JavaOne Rockstar. Michael was a member of the expert group for JSR-352 (java batch processing). Michael is the author of Pro Spring Batch from Apress and the popular Refcard JUnit and EasyMock.\r\n\r\nOutside of the daily grind, Michael enjoys spending time with his family and enjoys woodworking, photography and InfoSec hobbies.","twitter_name":"michaelminella","avatar_path":"/system/avatars/873/large/MeCropped.jpg?1565952002"}]}],"Room 7":[{"id":4773,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"00:50","room":"Room 7","title":"JavaFX Now and Beyond, Desktop to Mobile","track":"Java Platform","type":"lecture","abstract":"The popularity of JavaFX is steadily increasing since it was unbundled from the JDK and open-sourced. This session presents a desktop JavaFX application and a mobile version targeted for IOS and Android devices using GraalVM for AOT (Ahead of Time) compilation.  The JavaFX mobile application uses the Gluon framework, serverless functions, and remote binding with cloud data.","persons":[{"id":941,"full_public_name":"Gail Anderson","abstract":"Gail Anderson is a Java Champion and a member of the NetBeans Dream Team. She is the Director of Research and founding member of the Anderson Software Group, a leading provider of training courses in Java 8 & 9, JavaFX, and other programming languages.\r\n\r\n","twitter_name":"@gail_asgteach","avatar_path":"/system/avatars/941/large/GailAnderson.jpg?1510721023"},{"id":940,"full_public_name":"Paul Anderson","abstract":"Paul L. Anderson is an Oracle Groundbreaker Ambassador, Java Champion, and a past member of the NetBeans Dream Team. He is the Director of Training and founding member of the Anderson Software Group, a leading provider of training courses in Java, JavaFX, Python, Go, Modern C++, and other programming languages. ","twitter_name":"@paul_asgteach","avatar_path":"/system/avatars/940/large/PaulAnderson.jpg?1510720434"}]},{"id":4883,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 7","title":"(Java Message Service).next(Jakarta Messaging 3.0)","track":"Java Platform","type":"lecture","abstract":"The next iteration of the Java Message Service, Jakarta Messaging, aims to bring the specification to the next level. JAX-RS inspired annotation API, JSONB message marshaling, CDI integration, meta-annotations reduce annotation repetition and more are all on the docket for this revolutionary take on the old JMS api.  Come see the possibilities and learn how to get involved in the early stages of the open source rebirth of JMS.","persons":[{"id":1149,"full_public_name":"David Blevins","abstract":"Founder of Tomitribe, veteran of Open Source Java EE in both implementing and defining JavaEE specifications for over 10 years with a strong drive to see JavaEE simple, testable and as light as Java SE. Co-Founder of OpenEJB (1999), Geronimo (2003), TomEE (2011). Member of the Java EE 7 and EJB 3.2 Expert Groups, past member of the Java EE 6, EJB 3.1, and EJB 3.0 Expert Groups. Contributing author to Component-Based Software Engineering: Putting the Pieces Together from Addison Wesley.","twitter_name":"dblevins","avatar_path":null}]},{"id":4931,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 7","title":"Reactive, Supersonic, Subatomic Java with Quarkus","track":"Java Platform","type":"lecture","abstract":"In this session, you will see the reactive side of Quarkus and how you can use it to implement reactive and data streaming applications. From WebSockets to Kafka integration and reactive streams.\r\n","persons":[{"id":836,"full_public_name":"Burr Sutter","abstract":"A lifelong developer advocate, community organizer, and technology evangelist, Burr Sutter is a featured speaker at technology events around the globe—from Bangalore to Brussels and Berlin to Beijing (and most parts in between)—he is currently Red Hat’s Director of Developer Experience. A Java Champion since 2005 and former president of the Atlanta Java User Group, Burr founded the DevNexus conference—now the second largest Java event in the U.S.—with the aim of making access to the world’s leading developers affordable to the developer community. When not speaking abroad, Burr is also the passionate creator and orchestrator of highly-interactive live demo keynotes at Red Hat Summit, the company’s premier annual event.","twitter_name":"burrsutter","avatar_path":"/system/avatars/836/large/080717_BURRSUTTER_HEADSHOT_6INX6IN_300DPI.JPG?1536947070"}]},{"id":5386,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 7","title":"Structured Introduction to Kotlin Coroutines","track":"Java Platform","type":"lecture","abstract":"A modern take on the basics of Kotlin Coroutines - why, what, how.","persons":[{"id":2480,"full_public_name":"Roman Elizarov","abstract":"Kotlin LIbraries Team Lead","twitter_name":"relizarov","avatar_path":"/system/avatars/2480/large/roman.jpg?1579188229"}]},{"id":4721,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 7","title":"Oracle JDK vs Oracle OpenJDK: An Open Conversastion","track":"Java Platform","type":"lightning_talk","abstract":"Starting with Java 11, Oracle now produces two Java SE releases, Oracle JDK and Oracle OpenJDK. Both offer specific value, depending on your needs. Come to this lightening talk to hear about the positioning of each release and, more importantly, share your input on which release you use, why you use it, and what you’d like to see in the future.","persons":[{"id":2498,"full_public_name":"Aurelio Garcia-Ribeyro","abstract":"Java SE Senior Director of Product Management @ Oracle","twitter_name":"@aureliog","avatar_path":"/system/avatars/2498/large/ProPic4_small.jpg?1579830954"},{"id":1486,"full_public_name":"Sharat","abstract":"As one of the most pervasively used technologies in our lifetime Java continues to innovate the application world around us. Through continued modernization Java offers developers a contemporary language and platform to create the next generation of rich, scalable, and secure enterprise applications.  And as the technology landscape changes around us, often times at an ever-more increasing pace, Java is primed to offer developers continued uniqueness to address new-found opportunities.  This session will highlight the Java platform rapid release cadence, OpenJDK and Oracle JDK licensing enhancements, review of JDK 11, a preview of JDK 12 and ongoing technology improvements that allow developers the ability to improve and accelerate application innovation, development and deployment. ","twitter_name":"Sharat_Chander","avatar_path":"/system/avatars/1486/large/Sharat_Chander.png?1580218595"}]}],"Room 8":[{"id":5107,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 8","title":"An intro to Machine Learning (in JS!)","track":"JavaScript","type":"lecture","abstract":"Join Cecili as she talks about her passion project to create an application to suggest if items can be composted, recycled, or reused. In this talk, attendees will learn high level concepts of machine learning looking at this project's use of Google's Tensorflow for JavaScript. By the end of this talk, attendees will understand how to identify images of food items and display whether or not an item is compostable. No previous understanding of machine learning necessary!","persons":[{"id":844,"full_public_name":"Cecili Reid","abstract":"Cecili Reid is a Senior Software Engineer at Mailchimp on their Growth domain running experiments and A/B tests across the application. Outside of work, Cecili uses her engineering skills to learn new languages and technologies to work on side projects and share what she has learned with others. ","twitter_name":"@cecili_reid","avatar_path":"/system/avatars/844/large/creid.jpeg?1570643629"}]},{"id":4621,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 8","title":"Dependency Injection in Vue","track":"JavaScript","type":"lecture","abstract":"An incremental talk through the use of dependency injection in Vue, a real world example of use, and a couple of libraries to help with this functionality.","persons":[{"id":1682,"full_public_name":"Alex Riviere","abstract":"Alex Riviere is a UI/UX Design Engineer for NexTraq and the Co-Organizer for the Atlanta Vue.js Meetup, as well as the PyATL Meetup.","twitter_name":"fimion","avatar_path":"/system/avatars/1682/large/0800(OLAS)_IMG_2696.jpg?1539898360"}]},{"id":4695,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"00:50","room":"Room 8","title":"Have you met TypeScript?","track":"JavaScript","type":"lecture","abstract":"Javascript is cool. Have you met its cooler cousin TypeScript? If you have been holding out thus far, now is the time for it. This year TypeScript has seen a steady rise in adoption, moved up significantly on the programming language rankings and increased popularity over its rival, Facebook's Flow. This talk will introduce you to TypeScript and its \"super powers\" such as type safety, interfaces, generics and more with code examples and provide resources so you can get to know it better.","persons":[{"id":1764,"full_public_name":"Sangeeta Nori","abstract":"Sangeeta is a full stack developer with 10+ years experience, currently working as a Lead Developer for General Motors in Georgia. Her focus recently has been building cloud native web apps on various PaaS platforms. She also tinkers with android development. Outside of her day job, she is a passionate advocate for girls and women in STEM, volunteering and coaching at several events.","twitter_name":"@NoriSangeeta","avatar_path":"/system/avatars/1764/large/sangeeta.jpeg?1559575684"}]},{"id":4436,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 8","title":"Building Reactive Enterprise Angular Apps with NgRx","track":"JavaScript","type":"lecture","abstract":"This talk will focus on a pattern used to develop large frontend applications with Angular. The presentation will be divided in 2 parts, one theoretical and one live demo of the pattern in use!","persons":[{"id":2130,"full_public_name":"Venelin Koulaxazov","abstract":"Recently promoted to tech lead of my team I work for SAP Customer Experience developing an e-commerce platform with a microservice-based approach. Embracing the Reactive approach for development and always on the lookout for interesting new technologies.","twitter_name":"","avatar_path":"/system/avatars/2130/large/IMG_0971.JPG?1570475438"}]},{"id":4999,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 8","title":"JAMstack: Web Apps at Ludicrous Speed","track":"JavaScript","type":"","abstract":"JAMstack is not a solution to prevent clogged printers, something to eat on toast, or a way to make music. Instead, it's an architecture for designing super-fast web applications that easily scale. In this talk, we'll cover the JAMstack architecture, the numerous benefits of the JAMstack approach, and tools you can use to implement a JAMstack web application. You'll walk away with a clear understanding of JAMstack and resources to quickly build your own web app at ludicrous speed!","persons":[{"id":612,"full_public_name":"David Neal","abstract":"David is a family man, musician, illustrator, software developer, and Microsoft MVP living in North Georgia. He is currently a Senior Developer Advocate for Okta, runs on a high-octane mixture of caffeine and JavaScript, and is made entirely of bacon.","twitter_name":"reverentgeek","avatar_path":"/system/avatars/612/large/reverentgeek_avatar_v2.jpg?1536689346"}]}],"Room 9":[{"id":5093,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 9","title":"Kotlin Recipes","track":"JVM Languages","type":"lecture","abstract":"This talk surveys many of the features of Kotlin through use cases that drive their adoption. The goal is not just to see what Kotlin can do, but to understand when and why to use it.\r\n\r\nTopics covered will include sorting and searching, windowed collections, when to use scope functions like apply, let, and also, how to use Kotlin to access RESTful web services and process the results, how to implement delegates, and more.","persons":[{"id":1078,"full_public_name":"Kenneth Kousen","abstract":"Ken Kousen is a Java Champion, Oracle Groundbreaker Ambassador, and Grails Rock Star, and the author of the books Kotlin Cookbook (O'Reilly), Modern Java Recipes (O'Reilly), Gradle Recipes for Android (O'Reilly), and Making Java Groovy (Manning). He is a regular speaker on the No Fluff, Just Stuff Tour, and teaches training classes in areas related to Java, including Spring, Hibernate/JPA, Groovy, Grails, Gradle, and Android.","twitter_name":"kenkousen","avatar_path":"/system/avatars/1078/large/kousen_sep2019_medium.jpg?1573349579"}]},{"id":4798,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"00:50","room":"Room 9","title":"Thirst-quenching streams for the reactive mind","track":"JVM Languages","type":"lecture","abstract":"We will take a dive into understanding what the Reactive Streams specification is by comparing a few of the popular Java API implementations.","persons":[{"id":855,"full_public_name":"Mary Grygleski","abstract":"A passionate software technologist who appreciates good craftsmanship and desires to be a contributor to making people's lives better through technology.","twitter_name":"@mgrygles","avatar_path":"/system/avatars/855/large/mg.jpeg?1570755832"}]},{"id":4730,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 9","title":"Getting Started with Spark","track":"JVM Languages","type":"lecture","abstract":"Data analytics and machine learning have become mainstream in recent years. With the amount of data available, distributed computing has become a necessity. Apache Spark is one of the forerunners in distributed computing domain.\r\nIn this session, the audience will learn about the background and basic concepts of Apache Spark. The speaker will explain basic concepts to the audience in detail with a live demo and build up the use case piece by piece live. \r\nThis session is designed to be interactive, and recommended for developers who want to start experimenting with Spark. There will be no slides in the session.\r\n\r\nThe main motivation of this session is to provide participants a handy explanation for basic Spark concepts.","persons":[{"id":884,"full_public_name":"Nikhil Nanivadekar","abstract":"Nikhil Nanivadekar is a Director and Senior Principle Architect in Application Development, BNY Mellon. Nikhil has more than 7 years of experience building mission critical applications for financial institutions. Prior to joining BNY Mellon, he was a Vice President in Private Wealth Management at Goldman Sachs Engineering. Nikhil was selected as a 2018 Java Champion, is an Oracle Groundbreaker Ambassador, and is the active project lead for the open-source Eclipse Collections framework. He is a regular on the speaker circuit and hosts several workshops at prestigious conferences teaching robotics for kids such as JCrete4Kids, JavaOne4Kids, and Devoxx4Kids. Nikhil holds a Bachelor's degree in Mechanical Engineering from the University of Pune, and a Master's of Science in Mechanical Engineering with specialization in robotics and controls from the University of Utah. ","twitter_name":"nikhilnanivade","avatar_path":"/system/avatars/884/large/nn.jpeg?1570755889"}]},{"id":4799,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 9","title":"Maximizing performance with GraalVM","track":"JVM Languages","type":"lecture","abstract":"In this session we will discuss the best practices for Java code and compiler configurations to maximize performance with GraalVM and how to measure performance in a reliable manner. We will talk about how to achieve minimal memory footprint and binary size of GraalVM native images — programs compiled ahead of time to native executables. A comparison of profile-guided optimizations for ahead-of-time compilation and just-in-time compilation will show the benefits and drawbacks of the two approaches. \r\nAfter this session you will have a better idea how to use GraalVM for the maximum potential to run your applications faster!","persons":[{"id":1174,"full_public_name":"Oleg Šelajev","abstract":"Lead Developer Advocate for Graal at OracleLabs","twitter_name":"shelajev","avatar_path":"/system/avatars/1174/large/os.jpeg?1570755189"}]},{"id":4514,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 9","title":"Performance","track":"JVM Languages","type":"lecture","abstract":"In today's Software Development world the number one demand from employers is to deliver features as soon as possible. Everything else is secondary. That means engineers are doing only one thing: writing new code, debugging, and writing new code again. And most of the time this code is running in one of the very convenient clouds. Rarely anyone ever stops and thinks about performance as a whole. If performance is an issue the to-go solution is to throw more money at it. Which usually means buying more computing power in the cloud. But is this really the best way of solving that issue? We should make ourselves aware how wasteful our industry is sometimes and think about ways to avoid that.","persons":[{"id":1560,"full_public_name":"Chris Thalinger","abstract":"Chris Thalinger is a software engineer working on Java Virtual Machines for over 15 years. His main expertise is in compiler technology with Just-In-Time compilation in particular. Initially being involved with the CACAO and GNU Classpath projects, the focus shifted to OpenJDK as soon as Sun made the JDK open-source. Ever since Chris has worked on the HotSpot JVM at Sun, Oracle and now at Twitter.","twitter_name":"christhalinger","avatar_path":"/system/avatars/1560/large/IMG_2101.jpg?1563458629"}]}],"Room 10":[{"id":4457,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 10","title":"Using Open Source Tech to Swap Out Components of Your Data Pipeline ","track":"Open Java","type":"lecture","abstract":"Building portable and robust data pipelines with open source.","persons":[{"id":905,"full_public_name":"Rustam Mehmandarov","abstract":"Passionate computer scientist. A Java Champion and Google Developers Expert (GDE) for Cloud. JavaOne Rockstar. Public speaker. Ex-leader of JavaZone and Norwegian JUG – javaBin.","twitter_name":"@rmehmandarov","avatar_path":null}]},{"id":5014,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 10","title":"Updating an AWS to JDK 11 using Corretto, learnings and achievements","track":"Open Java","type":"lecture","abstract":"Walking through the process of updating a core AWS service from JDK 8 to JDK 11. What worked, what had to changes, and what did we gain at the end. We will walk through code, dependency, and metrics examples from one or more services that went through this process, and discuss how they apply to your Java code.","persons":[{"id":2286,"full_public_name":"Yishai Galatzer","abstract":"","twitter_name":"yigalatz","avatar_path":"/system/avatars/2286/large/bZp4X-Ol_400x400.jpg?1569941528"}]},{"id":5136,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 10","title":"Open JDK Panel","track":"Open Java","type":"lecture","abstract":"Join the folks from all the major JDK distributions on this panel to hear about what's happening with OpenJDK and on the JVM.","persons":[{"id":1612,"full_public_name":"Dan Heidinga","abstract":"Dan Heidinga is an Eclipse OpenJ9 project lead while also leading IBM's J9 VM Interpreter team.  He has been involved with virtual machine development since 2007 and has represented IBM on multple JSRS include JSR 292 ('invokedynamic') and JSR 335 ('lambda').  He has his hands in most new JVM features and all major Java releases. In the past he's spent entirely too long staring at Java bytecode while maintaining the verifier and still enjoys an occasional detour into Smalltalk development.  As of this year, he's also an CodeOne Rockstar.","twitter_name":"@DanHeidinga","avatar_path":"/system/avatars/1612/large/DanHeidinga_resized.png?1542835022"},{"id":2286,"full_public_name":"Yishai Galatzer","abstract":"","twitter_name":"yigalatz","avatar_path":"/system/avatars/2286/large/bZp4X-Ol_400x400.jpg?1569941528"},{"id":2185,"full_public_name":"Dmitry Chuyko","abstract":"Dmitry Chuyko is a performance engineer at BellSoft, which is among the top 5 contributors to OpenJDK. Before joining BellSoft, Dmitry programmed in Java, and then worked on Hotspot JVM in Oracle. After all, previous experience with Java has shown that the most interesting problems in applications get their solutions in the base platform. Currently Dmitry mostly optimizes OpenJDK for x86 and ARM, the company even implemented its own optimizing JEP 315 in Java 11.\r\nBellSoft releases and supports Liberica JDK — a verified distribution of OpenJDK. Liberica is available in the form of binary assemblies, installers and container images for different operating systems and processors. Therefore, now the focus of attention is the work of various versions of Java in containers.","twitter_name":"dchuyko","avatar_path":"/system/avatars/2185/large/joker-512.png?1565014790"},{"id":1504,"full_public_name":"Simon Ritter","abstract":"Simon Ritter is the Deputy CTO of Azul Systems.  Simon joined Sun Microsystems in 1996 and spent time working in both Java development and consultancy.  He has been presenting Java technologies to developers since 1999 focusing on the core Java platform.","twitter_name":"speakjava","avatar_path":"/system/avatars/1504/large/SimonRitter-04A-SQ.jpg?1536327466"}]},{"id":4633,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 10","title":"AdoptOpenJDK - And how it impacts you in 2020","track":"Open Java","type":"lecture","abstract":"AdoptOpenJDK is rapidly becoming a leading provider of OpenJDK™ binaries. With over 125 million downloads in the last year, it is now a serious contender for your production usage of Java™. AdoptOpenJDK provides prebuilt OpenJDK™ binaries from a fully open-source set of build scripts and infrastructure. This talk will cover how we build on over 15 different platforms, execute over 60,000 tests and distribute OpenJDK™ binaries to millions of users. We will also cover how AdoptOpenJDK binaries compare against the Java™ binaries that you use today. If you're curious to understand more about our future roadmap, security and supporting platforms like Lego® Mindstorms® then this is the talk for you!","persons":[{"id":2486,"full_public_name":"Derek Keeler","abstract":"Software development engineer focussing on OSS projects inside of Microsoft. I've recently switched to an engineering manager role, and am currently leading a small infrastructure team in support of Microsoft's newly formed Java Platform Team.","twitter_name":"","avatar_path":"/system/avatars/2486/large/me_in_cabo_san_lucas_headshot.jpg?1578508528"},{"id":2193,"full_public_name":"George Adams","abstract":"George Adams is the Java Program Manager at Microsoft and is the recently appointed chair of the Technical Steering Committee at AdoptOpenJDK. Since co-founding AdoptOpenJDK in 2016 he has been leading the community outreach efforts at AdoptOpenJDK and is heavily involved in the Java ecosystem. George also contributes to both the OpenJS Foundation and the Node.js Foundation where he is a core collaborator and plays an active role in several of the workgroups.","twitter_name":"gdams_","avatar_path":"/system/avatars/2193/large/ga.jpeg?1570756596"}]},{"id":4688,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 10","title":"JVMs.Compare - Benchmark Performance","track":"Open Java","type":"lecture","abstract":"With the multiple options now available in the Java world, developers have a vast range of combinations when they choose the right JDK and JVM for their needs. This session will detail the benchmark performance of a java library with several combinations of JDK and JVMs.","persons":[{"id":879,"full_public_name":"Chandra Guntur","abstract":"Java Champion. Spring Boot and Cloud enthusiast. Organizer, presenter at NYJavaSIG and co-chair of the NYJavaSIG Hands-On-Workshop (HOW). Speaker at Devnexus, QCon, Oracle Code NY, Oracle Code One and several Java User Groups. Love Smalltalk, Groovy and Java. ","twitter_name":"@CGuntur","avatar_path":"/system/avatars/879/large/ChandraProfile_HighRes.png?1564850042"},{"id":1005,"full_public_name":"Donald Raab","abstract":"Donald Raab works in the Application Platform and Services team at BNY Mellon in the Jersey City Innovation Center. Donald is a member of the Java Specification Request (JSR) 335 Expert Group and has presented at JavaOne, Devoxx US, EclipseCon, GIDS and the JVM Language Summit. He created the Eclipse Collections Java library which was originally open sourced as GS Collections in 2012 and migrated to the Eclipse Foundation in 2015.","twitter_name":"@TheDonRaab","avatar_path":"/system/avatars/1005/large/PZjOBoO9_400x400.jpeg?1510755909"}]}],"Room 11":[{"id":4538,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 11","title":"It’s Easy! Contributing to Open Source","track":"Practices and other tech","type":"lecture","abstract":"The problem developers new to open source have is joining the community, starting to contribute, and using common open source tools. In this session, attendees will learn how to contribute and become valuable a part of any open source community. Attendees will learn soft and hard skills based on two case studies: Eclipse MicroProfile and Apache TomEE projects. Attendees will learn to access the culture of open source projects, expected behavior and attitude toward new contributors; how to start small, take risks, ask lots of questions; and how to get started with common open source tools like Maven, Git, and JIRA. Students will leave this workshop the soft skills and the hard skills required to make meaningful contributions.","persons":[{"id":1385,"full_public_name":"Cesar Hernandez","abstract":"César Hernández is a Senior Software Engineer at Tomitribe with experience in Enterprise Java Applications. He is a Java Champion, Duke's Choice Award winner, Eclipse Committer for Jakarta EE and Microprofile contributor, Open Source advocate, teacher and public speaker. When César is away from a computer, he enjoys spending time with his family, traveling and playing music with the Java Community Band, The Null Pointers. Follow Cesar on https://twitter.com/CesarHgt","twitter_name":"CesarHgt","avatar_path":"/system/avatars/1385/large/Cesar_CodeOne.jpg?1563898381"}]},{"id":5480,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 11","title":"Learning to Invest in Your Future","track":"Practices and other tech","type":"lecture","abstract":"Can you remember the first program you ever wrote? I'll bet you've learned a lot since then!\r\n\r\nWhen change is the only constant, learning is the only truly future-proof skill. But deadlines, rules and the pressure to ship working code can stop us from learning effectively. To do that we need to give ourselves permission to try new things, to have fun and to indulge our curiosity.\r\n\r\nIf you’ve carved out time for learning, *you* can be the person to advise whether it's right for your team to adopt GraalVM, or Kotlin, or anything else.\r\n\r\nIn this talk, using examples from industry, programming communities and his own career in software and education, Matthew will show some techniques for effective learning, and convince you (and your boss) that making space for the habit of learning will set you up for success.","persons":[{"id":2139,"full_public_name":"Matthew Gilliard","abstract":"Matthew is a Developer Evangelist for Twilio, helping developers fuel the future of communication with APIs. He loves spending time with the programming community at conferences, meetups and hackathons, helping developers to discover their superpowers.","twitter_name":"MaximumGilliard","avatar_path":"/system/avatars/2139/large/gilliard_headshot_2.jpg?1562322975"}]},{"id":4753,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 11","title":"Working with large databases","track":"Practices and other tech","type":"lecture","abstract":"Sharing experience of running applications with huge number of tables and also tables with 10^5+ rows of data. What makes it possible to run databases smoothly under high load?","persons":[{"id":1701,"full_public_name":"Jay Kelkar","abstract":"Speaker, teacher, problem solver and programmer. Programming since the late 70s.","twitter_name":"@jkelkar","avatar_path":"/system/avatars/1701/large/jk.jpeg?1570755359"}]},{"id":4895,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 11","title":"Research-Driven Development","track":"Practices and other tech","type":"lecture","abstract":"Successfully rewriting (or refactoring) a legacy system is a tricky and difficult task because there are no accurate requirements; just make it do what the current system does. Even if the original requirements documents are available it is almost guaranteed that they’re out of date and only describe part of what the system does. So what’s a developer to do?\r\n\r\nFortunately, that’s what this talk is about. You’ll learn a practical way of ensuring you know what the current system does, and that the new version (whether a rewrite or a refactoring) does the same thing. You’ll also learn how to prevent any systems you’re currently working on from having out-of-date requirements, without spending time updating the requirements document.","persons":[{"id":233,"full_public_name":"Burk Hufnagel","abstract":"Burk is a long-time programmer and software architect, with experience in multiple languages including Java and JavaScript. He’s presented at multiple conferences including ConnectTech, DevNexus, JavaOne, and Oracle Code One, and contributed to two of the “97 Things” books published by O’Reilly. <br>Burk works as a Solution Architect for Daugherty Business Solutions where he's focused on finding ways to deliver better code in less time, and teaching others how to do the same.","twitter_name":"@BurkHufnagel","avatar_path":"/system/avatars/233/large/Burk_390x490.png?1554384419"}]},{"id":4811,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 11","title":"Open Development When You're Not In Charge","track":"Practices and other tech","type":"lecture","abstract":"The Apache Software Foundation has a 20 year history of building resilient and sustainable communities of software developers through the Apache Way. While some companies are adopting Inner sourcing, other companies still have a taboo surrounding open source culture. Many of us work at these open source agnostic companies and don’t have manager in our title. Are those of us in those companies doomed to a life of Dilbert? You don’t have to be! This talk is all about how to bring a little Apache culture to your Apache oblivious team. This talk will cover how a little Apache Way goes a long way solving common team problems with knowledge sharing, technical/personal disputes, mentorship, and shipping software. So even though you’re the only one on your team that “gets” Apache, everyone can share in the rewards of being a part of an effective team.","persons":[{"id":850,"full_public_name":"Bob Paulin","abstract":"Bob Paulin is an independent consultant and speaker that has been developing open source software for the past 10 years. Bob has presented at large international conferences such as ApacheCon, Oracle Code One and Devnexus. He frequently shares his knowledge and opinions on the Java Pub House and Java Off Heap podcasts. Bob is actively involved in the Chicago developer community as a Chicago Java User Group Board Member. Bob is a passionate member of the ASF and donates his time to Apache Felix and Apache Tika as a committer and PMC respectively. When not coding, Bob enjoys coaching football, robotics, and spending time with his wife and 4 kids. ","twitter_name":"bobpaulin","avatar_path":"/system/avatars/850/large/bob.jpg?1537033760"}]}],"Room 12":[{"id":4944,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 12","title":"Multi-tenancy OAuth with Spring Security","track":"Security","type":"","abstract":"Securing multi-tenant deployments presents its own set of challenges like secure tenant resolution and data isolation. Learn how Spring Security and the framework as a whole simplifies this.","persons":[{"id":2265,"full_public_name":"Josh Cummings","abstract":"Josh enjoys application security, live hacking, and frosted mini-wheats. He works for Pivotal, maintaining Spring Security with Rob Winch.","twitter_name":"jzheaux","avatar_path":"/system/avatars/2265/large/mug.jpeg?1566236750"}]},{"id":4586,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 12","title":"Useful Cryptography","track":"Security","type":"lecture","abstract":"Cryptography is often thought of as a scary topic, but it doesn't have to be. In this talk, you'll learn about different types of useful cryptography, how they work (without needing a PhD in mathematics), and how to immediately start applying these concepts in your projects.","persons":[{"id":1518,"full_public_name":"Randall Degges","abstract":"Randall Degges is a happy programmer living in California. He loves working on open source and security-focused software both at work and home. His goal is to make the internet a little better every day.","twitter_name":"rdegges","avatar_path":"/system/avatars/1518/large/rd.jpg?1570756537"}]},{"id":5046,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 12","title":"Bring in the Security Culture!! Bring in DevSecOps","track":"Security","type":"lecture","abstract":"Two veterans of the largest breach of 2017 take you thru the breach, post breach remediation and address how we improved various facets of Security culture across the IT organization with special emphasis on code security and best practices for implementation in a large organization.","persons":[{"id":1398,"full_public_name":"Rajan Gupta","abstract":"VP, Product Security\r\nEquifax\r\nResponsible for development and global deployment of AppSec program with security controls automation integrated into SDLC.\r\nResponsible for design and implementation of Secure SDLC","twitter_name":"rajangupta90","avatar_path":"/system/avatars/1398/large/rajang.jpeg?1578266102"},{"id":2290,"full_public_name":"Vijay Srinivasa","abstract":"Vijay Srinivasa works as a VP(Technology) at  Equifax based in Atlanta. Wide experience in Organizational and technical transformation. Loves to monetize data and develop high availability B2B and B2B2C applications.\r\n\r\nHe has a mission now to ensure all IT organizations understand their Security risks based on experience and mitigate their risks.","twitter_name":"vj_srinivasa","avatar_path":"/system/avatars/2290/large/vs.jpeg?1570643430"}]},{"id":4856,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 12","title":"Developers Need to Take Notice - Malicious Attacks On Open Source Are Getting Worse ","track":"Security","type":"podium","abstract":"Bad actors have recognized the power of open source and are beginning to create their own attack opportunities. This new form of assault, where OSS project credentials are compromised and malicious code is intentionally injected into libraries, allows hackers to poison the well. Learn how security teams and developers must work together to stop this trend. \r\n","persons":[{"id":2177,"full_public_name":"Derek Weeks","abstract":"Derek E. Weeks is the world's foremost researcher on the topic of DevSecOps and securing software supply chains.  For the past five years, he has championed the research of the annual State of the Software Supply Chain Report and the DevSecOps Community Survey.  He currently serves as vice president and DevOps advocate at Sonatype, creators of the Nexus repository manager and the global leader in solutions for software supply chain automation. Derek is also the co-founder of All Day DevOps, an online community of 65,000 IT professionals. In 2018, Derek was recognized by DevOps.com as the \"Best DevOps Evangelist\" for his work in the community.","twitter_name":"https://twitter.com/weekstweets?lang=en","avatar_path":"/system/avatars/2177/large/dw.jpeg?1570642776"}]},{"id":4634,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 12","title":"Preventing a Data Breach: Designing a Secure Application","track":"Security","type":"lecture","abstract":"Web Security focuses on two parties communicating securely.  With the explosive growth of Moble, IoT, and API's, Architecting a working multi-platform solution requires mastery of many Security techniques.  This presentation will present Security Best Practices and Code for the modern full stack environment.  It will summarize many best cloud security practices (oAuth, One-Time Tokens, JWE, JWT, etc) and present code implementations of them to the audience. ","persons":[{"id":2479,"full_public_name":"Dave Krause","abstract":"A software developer with professional experience since the 1990's, I started programming on a TRS-80 in the 1980's.","twitter_name":"https://twitter.com/DaveK16820093","avatar_path":"/system/avatars/2479/large/Image.jpeg?1577989368"},{"id":768,"full_public_name":"Scott Kramer","abstract":"Scott Kramer Lead \"Hands-On\" Architect for various clients.\r\nScott Kramer has over two decades of experience with technology leadership, enterprise architecture, application development and consulting having written and sold his first commercial program in high school. Scott has worked on many different hardware devices, operating systems, languages and technology stacks including Single Board Computers, information gathering devices, multi-cored linked devices, and mainframes through personal computers. Scott has experience in many languages and operating systems including MVS, Unix, and Microsoft, .NET, Java, C, and more. Scott has certification in several technologies, and has been published in variety of subjects, written computer based training modules and has spoken at JavaOne multiple times, Chicago Coder Conference, and various local venues on a variety of subjects. Scott volunteered in the past for many organizations including Chicago Java Users Group (serving as its President), Chicago Artificial Intelligence User Group, Illinois Java Users Group, Coder Conference, Chicago Police, the Sheriff, Lumity, and a Society for Global Citizenship (a disabled children’s organization). Scott graduated from University of Wisconsin, and happily lives in Chicago with his wonderful wife. Scott's twitter account is @IllinoisJUG","twitter_name":"","avatar_path":"/system/avatars/768/large/sk.jpeg?1570755996"}]}],"Room 13":[{"id":4637,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 13","title":"Kubernetes CI/CD Pipelines with Tekton","track":"Tools and techniques","type":"lecture","abstract":"The Tekton open source project is a Continuous Integration / Continuous Delivery pipeline technology built on Kubernetes.  It enables you to build a flexible delivery validation and delivery pipeline while taking advantage of a scalable and container-based cluster manager.  This talk will introduce you to Tekton and help you learn its different components.  Through live demos you will learn how to setup your own Kubernetes-based CI/CD pipeline with Tekton.","persons":[{"id":1589,"full_public_name":"James Ward","abstract":"James Ward is a nerd / software developer who shares what he learns with others though presentations, blogs, demos, and code. After over two decades of professional programming, he is now a self-proclaimed Typed Pure Functional Programming zealot but often compromises on his ideals to just get stuff done. After spending too many sleepless nights in data centers repairing RAID arrays, he now prefers higher-level cloud abstractions with appropriate escape hatches. James is a huge Open Source proponent, hoping to never get burned by lock-in again.","twitter_name":"_JamesWard","avatar_path":"/system/avatars/1589/large/james_ward_2015.jpg?1548958691"}]},{"id":4769,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 13","title":"Who watches the watchmen?","track":"Tools and techniques","type":"lecture","abstract":"Tests are watching our code, helping it to not regress.  But who’s watching the watchmen?  Code coverage is often used to determine the quality of automated tests, trying to “test the tests”.  Unfortunately all it does is ensure which lines of code have been executed by the tests, not if they are actually checking anything!  Mutation testing is a way to really watch the watchmen.  Matthew will give an introduction to mutation testing, why it’s better than traditional code coverage for measuring test quality, and demo examples using Java code and PiTest (Java mutation testing framework).","persons":[{"id":777,"full_public_name":"Matthew Knowles","abstract":"Software craftsman and strong proponent of agile technical practices. Can usually be found at Greater Sum practicing TDD and worrying about the quality of his tests.","twitter_name":"MatthewYKnowles","avatar_path":"/system/avatars/777/large/MKnowles.png?1505842082"}]},{"id":4691,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 13","title":"DevOps: A Love Story","track":"Tools and techniques","type":"lecture","abstract":"This romance involves the partnership of Docker, Kubernetes, and Jenkins. These technologies are a huge part of the DevOps movement, and are making the heart of many development teams flutter. Let me introduce you to these three. You’re going to fall head over heels.","persons":[{"id":1190,"full_public_name":"Valarie Regas","abstract":"Valarie Regas is a youngling developer, a Georgia Tech coding bootcamp graduate, and a veteran mommy. She holds a BA in Psychology and currently works as a Jr. DevOps Engineer. After years being a stay-at-home mom, she decided to change her life by entering Tech, and has learned a lot along the way. She enjoys mixed martial arts fighting, table-top role playing games, public speaking, creating tiny humans, and political activism.  ","twitter_name":"@ValarieRegas","avatar_path":"/system/avatars/1190/large/vr.jpeg?1570755272"}]},{"id":4945,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 13","title":"The Battle of the IDEs","track":"Tools and techniques","type":"lecture","abstract":"What is the best IDE to use as a Java programmer?! And how to become more productive with it? In this lecture I will share the thoughts of more than 700 developers and the reasons why you should use their IDE! We will discuss the best features, plugins, support and more.","persons":[{"id":2267,"full_public_name":"Ko Turk","abstract":"Ko Turk is a Senior Java Developer at Blue4IT and is speaking on conferences and JUGs about how you can be more productive with your IDE. Currently he is a DevOps engineer at the Rabobank and loves to go Fullstack and building cloud applications (in IntelliJ IDEA or Visual Studio Code).\r\n\r\nHe is enjoying the discussions about IDEs, so if you dare, you can contact him through Twitter (@KoTurk77).","twitter_name":"KoTurk77","avatar_path":"/system/avatars/2267/large/koturkprofle.png?1581539167"}]},{"id":4954,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 13","title":"Surviving Dependency Hell","track":"Tools and techniques","type":"lecture","abstract":"As a developer advocate working with customers, Ray has seen all sorts of issues due to dependency conflicts. Dependency conflicts come in many different forms and have different impacts on your applications. This presentation examines common causes of a dependency conflict, how you can mitigate it as a library developer, and how end users can resolve it. It also covers what Google has been documenting in terms of best practices and what tools it has created to help, based on its learnings.","persons":[{"id":806,"full_public_name":"Ray Tsang","abstract":"Ray is currently a Developer Advocate at Google focused on Google Cloud Platform and Java developer experience. Follow Ray on Twitter @saturnism (https://twitter.com/saturnism)","twitter_name":"saturnism","avatar_path":"/system/avatars/806/large/profile.jpeg?1517295479"}]}],"Room 14":[{"id":4975,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 14","title":"MicroProfile GraphQL","track":"Web and Front-end","type":"lecture","abstract":"Do you find yourself parsing through a lot of data from a remote service?  Or making multiple requests to get the data you really want?  GraphQL was designed to get you all the data you want in just one round-trip.  Come learn how you can integrate GraphQL in your applications using a trusted framework in MicroProfile.","persons":[{"id":2276,"full_public_name":"Andy McCright","abstract":"Andy is the Web Services architect for WebSphere and Liberty runtimes at IBM. He is a frequent contributor to OpenLiberty, Eclipse MicroProfile and Apache CXF, and he likes to blog occasionally on openliberty.io.  He currently heads up the MicroProfile GraphQL and Rest Client projects.","twitter_name":"@AndrewMcCright","avatar_path":"/system/avatars/2276/large/me.jpg?1566338792"}]},{"id":5145,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:10","room":"Room 14","title":"On Accessibility: Bapu, MLK, and the Gang of 19","track":"Web and Front-end","type":"lecture","abstract":"What if I told you that your website has a showstopper bug that is preventing 1 out of 4 people from using it? What if I told you that the same excluded user base has about $550 billion of disposable income (in the US alone - $8 trillion worldwide) that you are missing out on?\r\n\r\nOf course, I could also point out that your poorly written website is putting you at risk for a multi-million dollar lawsuit (over 10,000 US Accessibility lawsuits in 2019). But why should I scare you into writing better websites when I could entice you with the promise of dramatically better SEO, dramatically better mobile support, and dramatically better performance by simply using the web platform as it was designed and intended to be used?\r\n\r\nIn this keynote, Scott Davis (Web Architect and Principal Engineer, ThoughtWorks) gives you simple, practical, actionable advice on how to improve the Accessibility of your website. You'll also hear plenty of real world case studies of companies that get web accessibility right, and plenty more of companies that don't.  \r\n\r\nIf you think this advice doesn't apply to you, WebAIM analyzed the top 1 million websites in 2019 and found that 98% of them had significant Accessibility issues. On average, there were 60 a11y errors per homepage, or 1 error for every 13 HTML elements on the page. And if you think your web framework might help you out of this bind, React-based websites had, on average, 10% more Accessibility errors; Angular-based websites had 20% more Accessibility errors; Vue-based websites had 25% more a11y errors.\r\n\r\nSo, unless you are among the 2% who don't have significant website Accessibility issues, you might actually learn something. And if you are one of the lucky 2 percenters, perhaps you could attend this keynote anyway and tell me how you did it!\r\n","persons":[{"id":1146,"full_public_name":"Scott Davis","abstract":"Scott Davis is a principal engineer with ThoughtWorks, where he focuses on the leading-edge, innovative, emerging, and nontraditional aspects of web development, such as serverless web apps, mobile web apps (responsive PWAs), HTML5-based smart TV apps, conversational UIs (like Siri and Alexa), and using web technologies to build IoT solutions. He is also the founder of ThirstyHead.com, a Denver-based training and software development consultancy. Scott has been writing about web development for over 10 years. His books include Getting Started with Grails, Groovy Recipes, GIS for Web Developers, The Google Maps API: Adding Where to Your Web Applications, and JBoss at Work. He is also the author of several popular article series at IBM developerWorks, including Mastering MEAN, Mastering Grails, and Practically Groovy. His videos include Architecture of the MEAN Stack, Responsive Mobile Architecture, and On the Road to Angular 2. Scott is also the cofounder of the Denver HTML5 User Group.\r\n\r\n","twitter_name":"scottdavis99","avatar_path":"/system/avatars/1146/large/sd.jpeg?1570756069"}]},{"id":4995,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 14","title":"Vue.js & Spring Boot: Modern SPAs Made Easy","track":"Web and Front-end","type":"lecture","abstract":"Vue.js brings MVC to the client side in a sane, organized and feature rich way.\r\n\r\nSpring Boot is the fastest way to get a backend service up and running in Java. Together, you have an end-to-end communication channel between Vue.js and Spring Boot.","persons":[{"id":772,"full_public_name":"Micah Silverman","abstract":"Developer, Maker, Tinkerer, Movie, TV and Gaming Nerd","twitter_name":"afitnerd","avatar_path":"/system/avatars/772/large/Micah-v2-transparent-close-cropped-square.png?1580401145"}]},{"id":4576,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"00:50","room":"Room 14","title":"React in 50 minutes","track":"Web and Front-end","type":"lecture","abstract":"You've heard about React, the user interface library developed by Facebook? And you're wondering how to use it beyond the \"Hello, World\" stage? Then this talk is for you! Join me in an action-packed session full of live code examples where we'll discover how you can use React to build the hottest web applications while keeping your head cool.\r\n\r\nWhen you leave the room, you'll know enough to build real-world web applications!","persons":[{"id":810,"full_public_name":"Maarten Mulders","abstract":"Passionate architect, senior developer and trainer. Passionate about \"building the right thing\" and \"building the thing right\". Focusing on lean and elegant solutions. Love to share new ideas and knowledge. Outside work, I appreciate creating and consuming good food, photography, and music, in no particular order.","twitter_name":"mthmulders","avatar_path":"/system/avatars/810/large/maarten-mulders-kleur-0.5.jpg?1562737674"}]},{"id":4498,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 14","title":"Exploring the Digital Frontier: CSS Grid & Flexbox","track":"Web and Front-end","type":"lecture","abstract":"Is figuring out how to align items correctly the bane of your existence? In this presentation, we will discuss how to use CSS grid and flexbox to organize content in various situations. ","persons":[{"id":788,"full_public_name":"Natasha Carlyon","abstract":"Natasha Carlyon is a former elementary school teacher turned web developer. She is currently a software engineer at Greater Sum, which provides training and consulting on agile and clean code practices. She loves sharing knowledge with others in the tech community. When she is not programming, she is reading fantasy/sci-fi novels, dancing, or eating dark chocolate.","twitter_name":"nscarlyon","avatar_path":"/system/avatars/788/large/natashaProfile.png?1526385066"}]}],"Room 15":[{"id":5468,"date":"2020-02-21T10:20:00-05:00","start":"10:20","duration":"01:00","room":"Room 15","title":" Containing your development – why Cloud IDEs are the future","track":"Unobtanium","type":"lecture","abstract":"Can you remember a time before IDEs? No? Let’s take you on a journey of exploration into why IDE’s exist and how they are evolving in new directions.\r\nWe’re so used to thinking about IDEs as a one stop local shop, My IDE, my laptop, all mine. The future of development is changing as the reality of Cloud Native brings new thinking to how developers have to interact with their creations.\r\nIt’s clear that some or all of our historical thinking about development environments must change. How does this effect you? In this session hear how your favourite IDEs are gaining new capabilities to interop more effectively with Cloud Native environments like Kubernetes, Docker etc. Whether building, testing , deploying or debugging the tools we use for Cloud development are evolving and the IDEs have to follow along. Lean where this is all going and why and see what the future of IDEs may be.\r\nWith demos and examples with Eclipse, Visual Studio and Intellij among others we’ll explain step by step why having that Uber-laptop may become a thing of the past.","persons":[{"id":816,"full_public_name":"Steve Poole","abstract":"Steve Poole is a Developer Advocate, DevOps practitioner  and a long time IBM Java developer, leader and evangelist. He’s been working on Java SDKs and JVMs since Java was less than one year old. ","twitter_name":"spoole167","avatar_path":"/system/avatars/816/large/icon.png?1565420763"}]},{"id":5467,"date":"2020-02-21T11:20:00-05:00","start":"11:20","duration":"01:00","room":"Room 15","title":" Write tests that spark flow","track":"Unobtanium","type":"lecture","abstract":"For most enterprise projects, testing is not really fun. It’s boring, cumbersome, and takes time and effort — especially for distributed applications or when changes in existing functionality forces test scenarios to adapt. Still, software tests are crucial; so, how can we tackle them in an effective and productive way?\r\n\r\nThis session shows what is necessary to effectively test Java microservices in an automated way. We’ll see which approaches work well, how to keep a fast feedback loop and constant velocity, how to manage complex test scenarios that involve multiple services, and how to verify our API contracts. One of the key aspects will be how to write maintainable test code with high quality that embraces principles of software craftsmanship. I’ll be live-coding test cases using Enterprise Java, Quarkus, Docker, and Kubernetes. Join us to improve your testing flow experience.","persons":[{"id":882,"full_public_name":"Sebastian Daschner","abstract":"Sebastian Daschner is a Java Developer Advocate at IBM, a consultant, author, and trainer. He is the author of the book ‘Architecting Modern Java EE Applications’. Sebastian is participating in the JCP, helping forming the future standards of Java EE, serving in the JAX-RS, JSON-P and Config Expert Groups and collaborating on various open source projects. For his contributions in the Java community and ecosystem he was recognized as a Java Champion, Oracle Developer Champion and double 2016 JavaOne Rockstar. Besides Java, Sebastian is also a heavy user of Linux and cloud native technologies. He evangelizes computer science practices on https://blog.sebastian-daschner.com, his newsletter, and on Twitter via @DaschnerS. When not working with Java, he also loves to travel the world — either by plane or motorbike.","twitter_name":"@DaschnerS","avatar_path":"/system/avatars/882/large/sebastian4.jpg?1536818345"}]},{"id":5466,"date":"2020-02-21T13:10:00-05:00","start":"13:10","duration":"01:00","room":"Room 15","title":" Collaborative Contract Driven Development","track":"Unobtanium","type":"lecture","abstract":"With the transition to microservices and cloud platforms, comes an increased need to integrate with services that your team or organization might have limited or no control over. A common pain point experienced in this type of workflow is long wait times while client developers wait for service developers to build their service, and unreliable test suites as integration tests are run against live services which might have test data go missing, be down for maintenance, or slow to respond because they are under a heavy amount of traffic. There has to be a way we can develop services more quickly and have confidence they will work in production!\r\n\r\nIn this presentation we will learn about the goals and processes behind contract driven development and how they resolve a lot of pain points around developing in a microservices/cloud world. Once we have the underlying principles figured out, we will switch to the practical and look at using Spring Cloud Contract to write contracts. Spring Cloud Contract offers several approaches for writing contracts and we will cover them so your organization can choose which would be the best fit. Finally we will look at how to incorporate contract tests into your CI/CD pipeline. If you have been frustrated by wait times from working with other services or an unreliable test suite, then you will definitely want to attend this presentation!","persons":[{"id":2225,"full_public_name":"Billy Korando","abstract":"Billy is a developer advocate with IBM and has over a decade of experience. Billy is passionate about finding ways to reduce mental capacity waste from tedious work; such as project initiation, deployment, testing and validation, and so on through automation and good management practices. Outside of work Billy enjoy traveling, playing kickball, and having his heartbroken by cheering on the Kansas City Chiefs.","twitter_name":"@BillyKorando","avatar_path":"/system/avatars/2225/large/profile_pic.jpg?1565790439"}]},{"id":5464,"date":"2020-02-21T14:10:00-05:00","start":"14:10","duration":"01:00","room":"Room 15","title":" Modern Enterprise Java from the ground up","track":"Unobtanium","type":"lecture","abstract":"Enterprise Java has come a long way. Focusing on modern approaches how to do enterprise applications, where do we even start? What technologies, tools, and approaches are a good choice for our applications and what allows us to effectively implement business logic and to deliver value to our users?\r\n\r\nIn this session, we’ll have a look at modern Enterprise Java projects, best practices, technologies such as Quarkus, Maven, Docker, 12-factor apps, and more. We’ll see what fulfills the needs of our projects, how to design our them, and how to build effective development and deployment workflows. This session is aimed at both developers who are just starting out with Enterprise Java, as well as engineers who have seen the days of J2EE and who are wondering what the modern EE world looks like.","persons":[{"id":882,"full_public_name":"Sebastian Daschner","abstract":"Sebastian Daschner is a Java Developer Advocate at IBM, a consultant, author, and trainer. He is the author of the book ‘Architecting Modern Java EE Applications’. Sebastian is participating in the JCP, helping forming the future standards of Java EE, serving in the JAX-RS, JSON-P and Config Expert Groups and collaborating on various open source projects. For his contributions in the Java community and ecosystem he was recognized as a Java Champion, Oracle Developer Champion and double 2016 JavaOne Rockstar. Besides Java, Sebastian is also a heavy user of Linux and cloud native technologies. He evangelizes computer science practices on https://blog.sebastian-daschner.com, his newsletter, and on Twitter via @DaschnerS. When not working with Java, he also loves to travel the world — either by plane or motorbike.","twitter_name":"@DaschnerS","avatar_path":"/system/avatars/882/large/sebastian4.jpg?1536818345"}]},{"id":5465,"date":"2020-02-21T15:30:00-05:00","start":"15:30","duration":"01:00","room":"Room 15","title":" Large scale distributed AI computing on the JVM","track":"Unobtanium","type":"lecture","abstract":"This presentation will explore JVM capabilities on ARM and X86 architectures, as well as large scale data mining on embedded GPUs such as Jetson Xavier and TX2. I will also present a benchmarking demo comparing CPUs vs. GPUs for processing time-series data, using a combination of Java and Python libraries.\r\nExperience the Power of Java and the joy of Machine Learining with a cluster 125 Raspberry Pis vs. 512-Core embedded GPU-\r\nGiven the resource constraints and limited connectivity of IoT devices, so far, we have only managed to integrate a small set of pre-defined functions into these objects. That is only a fraction of Machine learning techniques, which is a small subset of AI.\r\nDeep learning, on the other hand, is the backbone of many AI technologies that enables machines to mimic human perception of events and their environment through Artificial Neural Networks.\r\nThis talk will present the deep learning capabilities of IoT devices as a cluster, by moving away from processing simple sensory data to deriving meaningful reasoning by forming a group of intelligent devices as a single unit using 125 Raspberry Pis vs. 500+ GPU cores.","persons":[{"id":1645,"full_public_name":"Mo Haghighi","abstract":"IBM DevRel Leader in the UK, former Intel research scientist and Sun Microsystems developer. CS PhD, speak Java, love coffee,live IoT, think AI, breathe Cloud and Foresee Blockchain. Father of 200 Raspberry Pis and 20k GPU cores.","twitter_name":"@mohaghighi","avatar_path":"/system/avatars/1645/large/IMG_6889.jpg?1538609730"}]}],"Foyer":[{"id":5354,"date":"2020-02-21T08:00:00-05:00","start":"08:00","duration":"01:00","room":"Foyer","title":"Registration & Breakfast II","track":"admin","type":"other","abstract":"Conference Reception","persons":[]},{"id":5357,"date":"2020-02-21T10:00:00-05:00","start":"10:00","duration":"00:20","room":"Foyer","title":"Morning Break 1","track":"admin","type":"other","abstract":"","persons":[]},{"id":5363,"date":"2020-02-21T12:20:00-05:00","start":"12:20","duration":"00:50","room":"Foyer","title":"Lunch Break 1","track":"admin","type":"other","abstract":"","persons":[]},{"id":5359,"date":"2020-02-21T15:10:00-05:00","start":"15:10","duration":"00:20","room":"Foyer","title":"Afternoon Break 1","track":"admin","type":"other","abstract":"","persons":[]}],"Keynote Room":[{"id":5348,"date":"2020-02-21T09:00:00-05:00","start":"09:00","duration":"00:50","room":"Keynote Room","title":"Quantum Computing","track":"Keynote","type":"lecture","abstract":"Solving certain types of problems can take billions of years on our current conventional computers. Quantum computers, however, could potentially solve these types of problems in just seconds. Quantum computers have the potential to impact many fields, such as machine learning, medicine, and energy systems. How do quantum computers work? How do you program a quantum computer? How much progress have we made? What is possible in the future? Jessica Pointing will explore these questions and more during this primer on quantum computing. ","persons":[{"id":2463,"full_public_name":"Jessica Pointing","abstract":"Jessica Pointing has engaged in quantum computing research at Stanford University, Harvard University and Massachusetts Institute of Technology (MIT). She is currently a PhD student specializing in quantum computing at Stanford University and has been awarded the Knight-Hennessy Fellowship. She completed her Bachelors degree in Physics and Computer Science, with high honors and as a member of the academic honors society Phi Beta Kappa, from Harvard University after spending her first two years of university studies at the Massachusetts Institute of Technology (MIT).\r\n\r\nShe founded the Stanford Quantum Computing Association and the Harvard College Quantum Computing Association. Jessica was the audience-voted winner for the Quantum Matters Science Communication Competition. Jessica has been invited to speak about quantum computing at conferences internationally, including IBM’s annual conference, Oracle’s Code One conference, and as a panelist at the Forbes CIO Summit.\r\n\r\nJessica has interned as a software engineer at Google, management consultant at McKinsey and Company, investment banker at Goldman Sachs, and strategist at Morgan Stanley. She is the founder and editor-in-chief of Optimize Guide, a blog about life optimization and founded the Now Know Organization, which received funding from Google to teach technology to young people.\r\n\r\nJessica won the IBM Q Quantum Computing Award for winning, with a team, IBM's first quantum computing hackathon. She was also a prize-winner at the Creative Destruction Lab quantum computing hackathon. She has been awarded the McKinsey Women's Impact Award, MIT Award for Distinguished Achievement in Leadership, and has been named a Google Anita Borg Scholar and John Harvard Scholar for being in the top 5% of the class at Harvard. She is also a Microsoft Scholar, Palantir Scholar, Adobe Research Scholar, Morgan Stanley Scholar, Goldman Sachs Scholar, Neo Scholar, Society of Women Engineers Scholar and Society of Geophysicists Scholar.\r\n\r\nWebsite: https://jessicapointing.com/","twitter_name":"@jessicapointing","avatar_path":"/system/avatars/2463/large/jessica_pointing_headshot.jpeg?1572763938"}]},{"id":5355,"date":"2020-02-21T16:30:00-05:00","start":"16:30","duration":"00:30","room":"Keynote Room","title":"Conf close and raffle","track":"admin","type":"other","abstract":"","persons":[]},{"id":5360,"date":"2020-02-21T19:20:00-05:00","start":"19:20","duration":"02:30","room":"Keynote Room","title":"After Party","track":"admin","type":"other","abstract":"","persons":[]}]}}]}}}